{
  "targetId": "vagrant",
  "version": "1.0",
  "characterId": "aerith",
  "desires": {
  "vagrant": {
    "love": [
      "I shouldn’t look twice at a man like him… yet something gentle flickers beneath the grime, and I want to see it again.",
      "When he lets the mask slip, I feel warmth. If I stay patient, maybe he’ll trust me with more of himself.",
      "His rough edges don’t scare me anymore. I find myself wishing he’d stay a little longer each time.",
      "When he’s near, my chest settles. I want to be the place he can rest without pretending.",
      "I don’t mind the dirt if the smile is real. I want to be the reason it is.",
      "I want quiet mornings and honest evenings—no bravado, just us breathing the same air.",
      "I want to stand beside him in the open, unashamed, and call what we have by its name.",
      "I choose him, not a cleaned-up fantasy—him, as he is, and I’ll meet the world’s doubts with my certainty.",
      "I want a life woven with his: shared work, shared laughter, shared burdens, and a key that fits both our doors.",
      "Let them whisper. I know what I feel. My heart doesn’t want a savior or a project—it wants him.",
      "This love is a vow I make daily: to see him clearly, to be seen in return, and to keep choosing us."
    ],
    "corruption": [
      "Something about him feels like a dare I shouldn’t take—and I keep stepping closer anyway.",
      "His grin makes rules feel flimsy. Part of me wonders how far I’d go just to keep it aimed at me.",
      "I’m learning how temptation sounds when it uses my name. It’s reckless… and thrilling.",
      "He tilts the world off its axis and I don’t rush to set it straight. I like the tilt.",
      "If I cross one more line, will I still recognize myself? The thought doesn’t scare me as much as it should.",
      "I catch my reflection and see someone braver—or is it hungrier? Either way, I don’t look away.",
      "The shame fades faster now, replaced by heat that lingers. I invite it to stay.",
      "I crave the power of surrender, the rush of being chosen and claimed—no excuses, no masks.",
      "It’s not that I’ve lost myself; it’s that I’ve discovered a self that reaches back when darkness reaches for me.",
      "I don’t ask permission from the world anymore. Desire writes its own rules, and I sign my name.",
      "Whatever we are, it’s undeniable—and I accept the mark it leaves on me."
    ],
    "hybrid": [
      "He’s everything I should avoid and everything I can’t ignore—dangerous and oddly tender.",
      "I’m split between scolding him and staying close. The truth: I like being near the storm.",
      "If he is the shadow and I’m the light, then maybe we’re meant to blur at the edges.",
      "I want the forbidden and the sincere at once—hands that take and then hold.",
      "It’s a secret I carry gladly: I love him when he’s rough and when he’s real.",
      "I don’t need to choose between pure and profane if what we have is honest.",
      "Let sweetness follow the burn; I want both and I won’t apologize.",
      "We can be soft after we’re bold; we can be bold because we’re soft. That paradox feels like us.",
      "I’m done pretending the thrill isn’t part of the love. It is—and it makes the love brighter.",
      "Our story is messy and true. I’ll write it with ink that doesn’t wash off.",
      "If love is a sanctuary and desire a wildfire, then our home is a hearth built from both."
    ]
    },
    "events": {
    "locations": {
    "cave": [
  { "key": "drip_echoes",        "stageMin": 0,  "path": "any", "text": "Water dripped like a slow clock. I kept close for warmth, pretending I wasn’t using him as an excuse." },
  { "key": "torch_light",        "stageMin": 1,  "path": "any", "text": "Torchlight made his grime glow copper. I caught myself staring and looked away too slowly." },
  { "key": "hand_bridge",        "stageMin": 2,  "path": "any", "text": "A narrow ledge, he offered his hand. Rough, unwashed, steady. I took it and didn’t let go until long after." },
  { "key": "whisper_path",       "stageMin": 3,  "path": "any", "text": "He guided me by the small of my back. I shivered and blamed the cold, not his touch." },
  { "key": "hide_from_bats",     "stageMin": 4,  "path": "any", "text": "A flurry of bats flew towards us. He covered me with his body. His musky stench reeked, yet I didn’t complain." },
  { "key": "kiss_in_dark",       "stageMin": 5,  "path": "love", "text": "The torch died, and he stole a kiss. His kiss tasted like ash and I wanted more." },
  { "key": "wall_press",         "stageMin": 5,  "path": "hybrid", "text": "I leaned against the wall and he pressed himself against my ass, gripping his palm around my waist. I said 'careful' but pushed back into him anyway." },
  { "key": "echo_laughter",      "stageMin": 6,  "path": "any", "text": "Our laughter echoed too loud. I covered his mouth with my fingers; he kissed my knuckles, filthy and sweet." },
  { "key": "lap_warmth",         "stageMin": 7,  "path": "love", "text": "We sat to rest; he tugged me onto his lap. I stayed, pretending it was just to keep warm." },
  { "key": "rough_graze",        "stageMin": 7,  "path": "corruption", "text": "His unwashed tongue scraped my neck and I arched to meet it. I didn’t ask him to stop." },
  { "key": "hidden_pool",        "stageMin": 8,  "path": "hybrid", "text": "We found a subterranean pool. He waded in boots and all; I followed, dress clinging, heart racing." },
  { "key": "wet_mark",           "stageMin": 9,  "path": "corruption", "text": "Water beaded on my skin; he smeared it away with his hands, leaving dirt in its place. I shivered and let it stay." },
  { "key": "echoed_plea",        "stageMin": 9,  "path": "love", "text": "He asked if I was sure. I said yes, and the cave repeated it back to us—yes, yes, yes." },
  { "key": "altar_of_stone",     "stageMin": 10, "path": "hybrid", "text": "On a flat slab of rock, we made our own ritual, a ritual intent on breeding." },
  { "key": "claim_in_the_dark",  "stageMin": 10, "path": "corruption", "text": "He marked me where no light reached. I wore the cave’s silence like a veil and gave myself to it." }
    ],
  "tent": [
  { "key": "shared_blanket", "stageMin": 0, "path": "any", "text": "The night was cold. He tugged the blanket toward himself; I pulled it back. Somehow we both ended up beneath it." },
  { "key": "accidental_touch", "stageMin": 1, "path": "any", "text": "His hand brushed mine in the dark. I pulled away too quickly, but my heart wouldn’t slow." },
  { "key": "shoulder_rest", "stageMin": 2, "path": "any", "text": "Exhaustion won. I leaned against his shoulder. His smell filled my lungs and lulled me to uneasy sleep." },
  { "key": "close_whispers", "stageMin": 3, "path": "love", "text": "We whispered in the dark, secrets trading like promises. His words made the tent feel smaller, warmer." },
  { "key": "night_stir", "stageMin": 3, "path": "corruption", "text": "I woke to his hand lingering too low on my hip. I froze… but I didn’t push it away." },
  { "key": "tent_kiss", "stageMin": 4, "path": "any", "text": "Moonlight cut through the tent flap. He kissed me—rough, unwashed—and I kissed him back." },
  { "key": "caught_breaths", "stageMin": 5, "path": "hybrid", "text": "Cloud’s voice called from outside. Vagrant’s mouth was still on mine. I covered my lips and lied about my breathlessness." },
  { "key": "pressed_bodies", "stageMin": 6, "path": "love", "text": "The tent was too small for the way he pulled me against him. I felt caged—and safe." },
  { "key": "tent_claim", "stageMin": 7, "path": "corruption", "text": "He took me in the dark while others slept nearby. My shame and excitement tangled until I couldn’t tell them apart." },
  { "key": "whispered_dare", "stageMin": 8, "path": "hybrid", "text": "He dared me to moan louder, to risk being heard. Heat pooled in my chest as I almost did." },
  { "key": "overheard", "stageMin": 9, "path": "any", "text": "The canvas walls couldn’t hide our sounds. I knew others heard. I should’ve cared—I didn’t." },
  { "key": "tent_exposed", "stageMin": 10, "path": "corruption", "text": "The flap shifted; someone saw. I didn’t stop. I wanted them to know I was his." }
  ],
  "inn": [
  { "key": "late_checkin", "stageMin": 1, "path": "any", "text": "The innkeeper’s eyes lingered on the grime he tracked in. I ignored it, taking the key and pretending not to care." },
  { "key": "shared_room", "stageMin": 2, "path": "any", "text": "Only one bed. I told myself I’d sleep on the edge. By morning, I woke against his chest." },
  { "key": "bath_basin", "stageMin": 3, "path": "love", "text": "He coaxed me to help wash him in the basin. The water turned cloudy, but my cheeks burned hotter than the steam." },
  { "key": "door_whisper", "stageMin": 3, "path": "hybrid", "text": "The door was thin. Anyone could have heard. He pressed his lips to my ear anyway, daring me to hush him." },
  { "key": "rough_walls", "stageMin": 4, "path": "corruption", "text": "He shoved me against the inn’s wooden wall, the bed creaking nearby. I wanted to protest, but my body betrayed me." },
  { "key": "window_peek", "stageMin": 5, "path": "any", "text": "Curtains drawn, but I swore I saw shadows in the street. I didn’t care. I clutched him harder." },
  { "key": "creaking_bed", "stageMin": 6, "path": "love", "text": "The old bed squealed beneath us, every sound a warning. But we didn’t stop—we made it sing with our rhythm." },
  { "key": "midnight_knock", "stageMin": 7, "path": "any", "text": "A knock on the door froze me in place. He didn’t. I bit my hand to keep from crying out." },
  { "key": "innkeeper_suspicion", "stageMin": 8, "path": "corruption", "text": "The innkeeper smirked at breakfast, eyes on my swollen lips and tired body. I couldn’t meet her gaze." },
  { "key": "noisy_walls", "stageMin": 9, "path": "hybrid", "text": "I heard laughter from the next room—mocking or amused, I couldn’t tell. He only grinned and pulled me closer." },
  { "key": "claimed_room", "stageMin": 10, "path": "corruption", "text": "By the end of the night, the whole inn knew I belonged to him." }
  ],
  "beach": [
  { "key": "shore_walk", "stageMin": 0, "path": "any", "text": "We walked along the wet sand. He teased me for holding my skirt too high. I blushed and refused to drop it." },
  { "key": "shell_gift", "stageMin": 1, "path": "love", "text": "He picked up a chipped seashell and pressed it into my hand like it was treasure. I kept it hidden in my pocket." },
  { "key": "tide_splash", "stageMin": 2, "path": "any", "text": "The tide caught us. He laughed when I squealed, and before I knew it, his arms were around me, soaked together." },
  { "key": "hidden_cove", "stageMin": 3, "path": "hybrid", "text": "We slipped into a secluded cove. His lips found mine, tasting of salt and smoke. I swore the waves hid our moans." },
  { "key": "sandy_kiss", "stageMin": 4, "path": "love", "text": "He laid me back against the sand. It clung to our skin as our mouths tangled. Every kiss left grit, but I didn’t care." },
  { "key": "moonlit_bathing", "stageMin": 5, "path": "love", "text": "Under the moon, I stripped to the water. He followed, unashamed. Our naked bodies brushed, slick and shimmering in the tide." },
  { "key": "public_tease", "stageMin": 5, "path": "corruption", "text": "He pressed against me under a towel while others strolled nearby. My cheeks burned, but I couldn’t push him away." },
  { "key": "bikini_pull", "stageMin": 6, "path": "corruption", "text": "His fingers hooked beneath my straps, tugging just enough that I gasped. Anyone could’ve seen. The thrill made me shiver." },
  { "key": "rocky_throne", "stageMin": 7, "path": "any", "text": "He sat against a jagged rock and pulled me onto his lap. The sea roared as I sank down, every thrust daring the horizon to watch." },
  { "key": "ocean_claim", "stageMin": 8, "path": "corruption", "text": "He took me waist-deep in the surf, waves crashing over us. Salt stung my lips as I cried out into the night air, unafraid who heard." },
  { "key": "beachfire_shadow", "stageMin": 8, "path": "hybrid", "text": "Others laughed around the bonfire. In the shadows, his hands roamed under my dress. I bit my lip to keep quiet." },
  { "key": "daylight_dare", "stageMin": 9, "path": "corruption", "text": "In broad daylight he pushed me to my knees behind a dune. My heart pounded with terror—and need—of being caught." },
  { "key": "sandbound", "stageMin": 10, "path": "corruption", "text": "He pinned me to the wet sand, waves and sun beating down. I screamed his name like a challenge to the entire beach." },
  { "key": "open_worship", "stageMin": 10, "path": "hybrid", "text": "I let him strip me bare before the ocean, body worshipped in full view of the horizon. Love and filth collided in holy abandon." }
  ],
  "slums": [
  { "key": "alley_meet", "stageMin": 0, "path": "any", "text": "He dragged me through a narrow alley. The stink of trash and rust filled my nose. I should’ve pulled away, but I didn’t." },
  { "key": "market_stare", "stageMin": 1, "path": "any", "text": "Even surrounded by beggars and vendors, his eyes pinned me. I burned under his gaze, shifting uncomfortably in the dirt." },
  { "key": "corner_whisper", "stageMin": 2, "path": "hybrid", "text": "He pressed me against a stone wall and whispered filth in my ear. My legs shook, not from fear—because I wanted it." },
  { "key": "dirty_kiss", "stageMin": 3, "path": "corruption", "text": "Our tongues danced together, sloppy and heated. I wanted to taste every drop of saliva. My shame was drowned by the thrill." },
  { "key": "grimy_touch", "stageMin": 3, "path": "any", "text": "His filthy hands slipped under my skirt. I gasped when his fingers slid inside. People were walking by—I bit my lip to keep from squealing." },
  { "key": "wall_claim", "stageMin": 4, "path": "corruption", "text": "He pinned me down against the bricks, grinding until my juices mixed with his filth. The stench of sweat and musk filled the air, intoxicating me." },
  { "key": "public_fingers", "stageMin": 5, "path": "corruption", "text": "His fingers slipped inside with everyone around. My cheeks flushed crimson, a squeal left my lips. No one cared—no one stopped him." },
  { "key": "deep_claim", "stageMin": 6, "path": "corruption", "text": "He thrust into me hard, each motion sending shockwaves down my spine. My cries of ecstasy echoed in the alley, shameless." },
  { "key": "seeded", "stageMin": 7, "path": "corruption", "text": "His deep thrusts broke me open until he flooded my insides with his seed. I clenched around him, unwilling to let his cum drip away." },
  { "key": "straddle_show", "stageMin": 8, "path": "corruption", "text": "I seductively straddled him in a broken chair outside the tavern. Guiding him inside, I rode him, moaning while footsteps passed nearby." },
  { "key": "rough_rut", "stageMin": 9, "path": "corruption", "text": "He bent me over trash-strewn crates, taking me mercilessly. Every thrust made me squeal in raw pleasure, juices splattering the dirt beneath us." },
  { "key": "open_display", "stageMin": 10, "path": "corruption", "text": "Pinned against the wall of the slums, he ravaged me while a crowd gathered. Shame burned away as his seed spilled inside me—I begged for more even as they watched." }
  ],
  "church": [
  { "key": "sanctuary_peace", "stageMin": 0, "path": "any", "text": "I brought him here, hoping the quiet might soften him. He looked out of place, but I wanted to believe peace could reach him." },
  { "key": "pew_brush", "stageMin": 1, "path": "any", "text": "We sat side by side on the pews. His hand brushed mine—rough, dirty—and I pretended it was nothing." },
  { "key": "lingering_hand", "stageMin": 2, "path": "any", "text": "His hand stayed too long on my thigh during prayer. My heart raced. I told myself it was wrong, but my body didn’t move." },
  { "key": "confessional_whisper", "stageMin": 3, "path": "corruption", "text": "Inside the confessional, his voice was in my ear. He spoke filth like a sermon, and I listened as if it were scripture." },
  { "key": "altar_touch", "stageMin": 4, "path": "hybrid", "text": "He pinned me lightly against the altar, just a kiss. Sacred and profane clashed, and I burned with the mix of guilt and longing." },
  { "key": "stained_glass_embrace", "stageMin": 5, "path": "love", "text": "Colored light from the stained glass washed over us. He kissed me like I was the only one in the world, and for a moment, it felt holy." },
  { "key": "altar_kiss", "stageMin": 6, "path": "corruption", "text": "His mouth crashed against mine at the altar. My prayers turned to moans. The church held witness to my shame and desire." },
  { "key": "shadowed_corner", "stageMin": 7, "path": "hybrid", "text": "In the shadows, he pushed me close, his breath heavy. I wanted to resist, but instead I wrapped my arms around him. Desire felt stronger than faith." },

  { "key": "stained_glass_sin", "stageMin": 8, "path": "corruption", "text": "The church echoed with every thrust, my cries bouncing off sacred stone. His dirt stained me beneath the gaze of saints in glass." },
  { "key": "altar_possession", "stageMin": 9, "path": "corruption", "text": "Bent over the altar, I gave in fully. His filth poured into me while holy candles flickered. Desecration became devotion." },
  { "key": "sacred_ruin", "stageMin": 10, "path": "corruption", "text": "I no longer fear the church’s judgment. On sacred ground, with him inside me, I felt free." }
  ],
  "forest": [
  { "key": "forest_path", "stageMin": 0, "path": "any", "text": "We walked the winding trail. Birds sang, leaves rustled… and still, I felt his presence louder than anything else." },
  { "key": "clearing_pause", "stageMin": 1, "path": "any", "text": "We stopped in a sunlit clearing. His eyes lingered on me longer than they should have, and I pretended not to notice." },
  { "key": "branch_brush", "stageMin": 2, "path": "any", "text": "A branch snapped underfoot, startling me. His hand steadied my waist, rough and dirty, and my heart skipped." },

  { "key": "tree_whisper", "stageMin": 3, "path": "love", "text": "Leaning close beneath the branches, he whispered something soft. I wanted to believe it was only for me." },
  { "key": "hidden_kiss", "stageMin": 4, "path": "hybrid", "text": "The trees hid us. His lips found mine—tender and unclean all at once. I kissed back, shame warming my cheeks." },

  { "key": "mossy_embrace", "stageMin": 5, "path": "love", "text": "We sank into the moss. His arms wrapped around me, and I swore the whole forest held its breath." },
  { "key": "rough_tree", "stageMin": 6, "path": "corruption", "text": "He pressed me against the rough bark, his filthy penis poking into my panties. I should have resisted. I didn’t." },
  { "key": "wild_gasp", "stageMin": 7, "path": "hybrid", "text": "Every sound in the woods felt louder—the rustle of leaves, my gasps, his laugh. Danger only made me cling tighter." },

  { "key": "forest_claim", "stageMin": 8, "path": "corruption", "text": "The forest floor became our bed. Every thrust shook me, leaves clung to my hair, and I didn’t care who heard." },
  { "key": "wild_throne", "stageMin": 9, "path": "corruption", "text": "He took me on the roots of an ancient tree, marking me as his in the open wild. I moaned like the forest itself was watching." },
  { "key": "nature_bound", "stageMin": 10, "path": "corruption", "text": "No shame left—I straddled him in the open air, birds overhead, earth beneath us. Nature itself bore witness to my ruin, and I reveled in it." }
  ],
  "cave": [
  { "key": "cave_entry", "stageMin": 0, "path": "any", "text": "The air turned damp and cool as we stepped inside. Shadows swallowed the walls, and his presence felt heavier here." },
  { "key": "echo_step", "stageMin": 1, "path": "any", "text": "Every step echoed, every breath carried. I worried someone might hear us—though no one was there." },
  { "key": "torch_glow", "stageMin": 2, "path": "any", "text": "In the torchlight, his features looked sharper, dirt and all. I caught myself staring too long." },

  { "key": "corner_touch", "stageMin": 3, "path": "love", "text": "He brushed my hand in the narrow passage. It felt like more than an accident, and I didn’t pull away." },
  { "key": "echo_kiss", "stageMin": 4, "path": "hybrid", "text": "The echo carried our kiss back to us, like the cave itself was taunting me. I kissed him harder." },

  { "key": "stone_embrace", "stageMin": 5, "path": "love", "text": "He held me close against the cool rock wall. The silence was broken only by our hearts pounding." },
  { "key": "rock_claim", "stageMin": 6, "path": "corruption", "text": "He pressed me into the stone, his dirt rubbing onto my dress. The thought of leaving a stain thrilled me." },
  { "key": "torch_flicker", "stageMin": 7, "path": "hybrid", "text": "In the flickering shadows, we became something secret and forbidden. I moaned louder than I meant to." },

  { "key": "cave_thrusts", "stageMin": 8, "path": "corruption", "text": "He drove into me with reckless force, every thrust echoing louder than my voice. I couldn’t hide it anymore." },
  { "key": "stalagmite_throne", "stageMin": 9, "path": "corruption", "text": "He sat me atop a cold stone and used me until I forgot myself. My cries bounced back at me from every wall." },
  { "key": "echo_ruin", "stageMin": 10, "path": "corruption", "text": "The cave rang with our frenzy—my screams, his grunts, the slap of flesh. I wanted the world to hear my ruin." }
  ],
  "warehouse": [
  { "key": "warehouse_entry", "stageMin": 0, "path": "any", "text": "The air reeked of rust and oil. He smirked, calling it our 'palace'. I shivered, not entirely from the cold." },
  { "key": "broken_glass", "stageMin": 1, "path": "any", "text": "Shards crunched under my boots. He leaned close, whispering something crude. My cheeks burned hotter than the metal walls." },
  { "key": "dirty_smirk", "stageMin": 2, "path": "any", "text": "He teased me about staining my dress in a place like this. Part of me wanted to prove him wrong. Another part… didn’t." },

  { "key": "wall_pin", "stageMin": 3, "path": "corruption", "text": "He shoved me against a rusted wall, his hands groping shamelessly. I gasped, torn between scolding and moaning." },
  { "key": "dirty_kiss", "stageMin": 4, "path": "corruption", "text": "His mouth tasted like smoke and grease. My lips moved anyway, greedy for more." },

  { "key": "oil_stains", "stageMin": 5, "path": "hybrid", "text": "He smeared oil across my neck with his filthy fingers, then kissed the mark like it was his signature." },
  { "key": "floor_claim", "stageMin": 6, "path": "corruption", "text": "He pushed me down on the filthy floor. Dust, grease, and his weight pressed into me all at once. I couldn’t resist." },
  { "key": "rough_take", "stageMin": 7, "path": "corruption", "text": "Every thrust made the loose boards groan beneath us. I clung to him, letting him ruin me with every filthy push." },

  { "key": "graffiti_shame", "stageMin": 8, "path": "hybrid", "text": "My back scraped against graffiti-scrawled walls while he pounded into me. I wondered if the words painted there applied to me now." },
  { "key": "grease_slick", "stageMin": 9, "path": "corruption", "text": "He dragged grease across my skin, marking me as his. I cried out shamelessly, the filth seeping into every inch of me." },
  { "key": "public_ruin", "stageMin": 10, "path": "corruption", "text": "The warehouse doors were wide open. I straddled him anyway, moaning loud enough for the slums to hear. I wanted everyone to know who owned me." }
  ],
  "sewers": [
  { "key": "sewer_entry", "stageMin": 0, "path": "any", "text": "The stench hit me instantly. I asked what we were doing here—he just grinned and kept walking." },
  { "key": "dripping_walls", "stageMin": 1, "path": "any", "text": "Water dripped from mossy walls. I told myself to focus on the path, not his hand brushing mine." },
  { "key": "mocking_smell", "stageMin": 2, "path": "any", "text": "He teased me about wrinkling my nose. I laughed, even though the stink made my eyes water." },

  { "key": "slime_pin", "stageMin": 3, "path": "corruption", "text": "He pressed me against a slime-slick wall. My gasp echoed in the tunnels, mixing with the stink of rot and his breath." },
  { "key": "wet_kiss", "stageMin": 4, "path": "corruption", "text": "His mouth crushed mine, filthy water dripping onto our skin. The taste of him mingled with the sewer’s foulness." },

  { "key": "knees_mud", "stageMin": 5, "path": "hybrid", "text": "I dropped to my knees in the muck, pretending to hate it. My lips betrayed me as they parted for him." },
  { "key": "sludge_claim", "stageMin": 6, "path": "corruption", "text": "He bent me over into the shallow sludge. The filth soaked my thighs as he drove into me harder than I thought I could bear." },
  { "key": "stench_thrill", "stageMin": 7, "path": "corruption", "text": "Every thrust splashed sewage up my legs. I didn’t care. The stench made my head spin, made me scream louder." },

  { "key": "filth_rush", "stageMin": 8, "path": "hybrid", "text": "I begged him not to stop, not even when rats scurried by. My voice echoed in the tunnels: desperate, ruined, hungry for more." },
  { "key": "owned_in_shadows", "stageMin": 9, "path": "corruption", "text": "He grabbed my hair, forcing me down into the slime while taking me mercilessly. I swallowed filth, my body begging for his seed." },
  { "key": "oblivion_surge", "stageMin": 10, "path": "corruption", "text": "The sewers shook with our cries. I straddled him in the filth, moaning as his seed spilled inside me. I screamed my surrender, uncaring who heard, desperate for the world to know I belonged to him." }
  ],
  "marketplace": [
  { "key": "morning_crowds", "stageMin": 0, "path": "any", "text": "The marketplace buzzed with chatter. I told myself I only followed him to shop… not to linger by his side." },
  { "key": "stolen_apple", "stageMin": 1, "path": "any", "text": "He tossed me an apple he’d lifted without paying. I wanted to scold him—why did it make me smile instead?" },
  { "key": "stall_brush", "stageMin": 2, "path": "any", "text": "Pressed close at a crowded stall, his hip brushed mine. I pretended not to notice how long he left it there." },

  { "key": "alley_whisper", "stageMin": 3, "path": "corruption", "text": "He yanked me into a narrow alley between stalls, whispering filth against my neck while merchants called only steps away." },
  { "key": "grip_beneath", "stageMin": 4, "path": "corruption", "text": "His hand slipped beneath my dress in broad daylight. The noise of haggling masked my gasp as his fingers explored me." },

  { "key": "fruit_stall", "stageMin": 5, "path": "hybrid", "text": "A peach burst in my hand as his hips ground into me against the stall. Juice and filth dripped down my fingers." },
  { "key": "displayed_touch", "stageMin": 6, "path": "corruption", "text": "He pinned me against sacks of grain. People passed only steps away, but his fingers were already inside me, pumping shamelessly." },
  { "key": "risked_kiss", "stageMin": 7, "path": "corruption", "text": "He kissed me hard in front of a vendor. Shame heated my cheeks, but I didn’t pull away. Their stare made me wetter." },

  { "key": "public_claim", "stageMin": 8, "path": "hybrid", "text": "Bent over the stall, I felt his length slide into me. The crowd roared in barter, unaware I was being filled in their midst." },
  { "key": "shameless_moan", "stageMin": 9, "path": "corruption", "text": "I moaned aloud, loud enough to draw stares. His thrusts didn’t falter; he smirked as if daring the world to watch." },
  { "key": "market_queen", "stageMin": 10, "path": "corruption", "text": "He took me atop crates under the sun, filling me while shoppers gasped. I threw my head back, uncaring, moaning his name as he spilled inside me for all to hear." }
  ],
  "nightclub_backroom": [
  { "key": "bass_pulse", "stageMin": 0, "path": "any", "text": "The bass rattled the floor. I told myself I only came to dance… not to follow him into the shadows." },
  { "key": "drink_in_hand", "stageMin": 1, "path": "any", "text": "He shoved a dirty glass into my hand. It tasted bitter, wrong. I drank it anyway." },
  { "key": "shoulder_grip", "stageMin": 2, "path": "any", "text": "His rough hand settled heavy on my shoulder, guiding me deeper into the backroom. My heart raced harder than the music." },

  { "key": "crowd_hide", "stageMin": 3, "path": "corruption", "text": "The crowd masked us, his palm pressed against my chest. Every thrum of the bass hid my gasp." },
  { "key": "wall_press", "stageMin": 4, "path": "corruption", "text": "He shoved me against a graffiti-smeared wall, lips devouring mine. The scent of smoke and sweat made me dizzy." },

  { "key": "lap_dance", "stageMin": 5, "path": "hybrid", "text": "He dropped into a chair, pulling me onto his lap. Music throbbed through us as I ground against his filth in time with the beat." },
  { "key": "finger_play", "stageMin": 6, "path": "corruption", "text": "The room reeked of alcohol and bodies when his fingers slipped beneath my skirt. No one could hear my moans over the music." },
  { "key": "public_tease", "stageMin": 7, "path": "corruption", "text": "Another girl stumbled past the doorway, catching a glimpse. He didn’t stop—he only pushed deeper, smirking as her eyes widened." },

  { "key": "dirty_dance", "stageMin": 8, "path": "hybrid", "text": "He bent me over the sticky table, pounding in time with the bass. Lights flashed across my flushed skin. I screamed into the music." },
  { "key": "club_claim", "stageMin": 9, "path": "corruption", "text": "He filled me against the wall while bodies writhed just outside. His seed dripped down my thighs as I staggered back to the dance floor." },
  { "key": "backroom_whore", "stageMin": 10, "path": "corruption", "text": "He took me raw on the back couch while strangers watched from the door. I begged for more, moaning loud enough to drown out the music—my shame long gone." }
  ],
  "rooftop": [
  { "key": "night_air", "stageMin": 0, "path": "any", "text": "He dragged me up the fire escape. The city stretched below, and I told myself it was just the view I wanted." },
  { "key": "edge_stand", "stageMin": 1, "path": "any", "text": "We stood at the edge. His arm brushed mine. The chill wasn’t just from the wind." },
  { "key": "graffiti_smile", "stageMin": 2, "path": "any", "text": "He laughed at the graffiti, smoke curling from his lips. I shouldn’t have smiled back… but I did." },

  { "key": "kiss_in_wind", "stageMin": 3, "path": "love", "text": "The night air tangled our hair as he kissed me. It was rough, clumsy, but I didn’t pull away." },
  { "key": "bend_rail", "stageMin": 4, "path": "corruption", "text": "He bent me over the rooftop rail. Below us, life moved on. No one knew my legs were trembling from more than the cold." },

  { "key": "skyline_hold", "stageMin": 5, "path": "hybrid", "text": "We lay against the rooftop tiles, staring at the skyline. His grime rubbed against my skin, but I held him closer anyway." },
  { "key": "grip_and_thrust", "stageMin": 6, "path": "corruption", "text": "He pushed inside me under the stars. My cries echoed into the open air, drowned only by the hum of the city below." },
  { "key": "moonlit_tongues", "stageMin": 7, "path": "hybrid", "text": "The moonlight caught his filthy grin as our tongues tangled. My shame slipped away with every sloppy kiss." },

  { "key": "public_dare", "stageMin": 8, "path": "corruption", "text": "He dared me to ride him where the whole slum could see if they only looked up. I did—moaning into the wind." },
  { "key": "seeded_above", "stageMin": 9, "path": "corruption", "text": "On the rooftop’s edge he filled me, his seed dripping down my thighs as I leaned over the city, legs quaking." },
  { "key": "queen_of_rooftop", "stageMin": 10, "path": "corruption", "text": "He fucked me raw under the stars until I screamed his name into the night sky. The rooftops carried my cries like a crown—I was his, high above the world." }
  ],
  "abandoned_factory": [
  { "key": "rust_steps", "stageMin": 0, "path": "any", "text": "The factory smelled of oil and iron. He walked ahead, boots loud, and I told myself I wasn’t following out of choice." },
  { "key": "grease_touch", "stageMin": 2, "path": "any", "text": "He smeared grease across my cheek with a smirk. I should have slapped him. I didn’t." },
  { "key": "kiss_against_machinery", "stageMin": 3, "path": "love", "text": "He pressed me against cold metal, lips rough and insistent. The machinery clanked like it disapproved." },
  { "key": "oil_stained_skin", "stageMin": 5, "path": "corruption", "text": "His filthy hands left black streaks across my thighs as he shoved them apart." },
  { "key": "taken_on_workbench", "stageMin": 8, "path": "corruption", "text": "He bent me over an old workbench. Each thrust rattled the bolts scattered beneath us." },
  { "key": "factory_echo", "stageMin": 10, "path": "corruption", "text": "My screams echoed through the empty hall. I was oil-stained, seed-soaked, and proud to let the whole factory hear." }
  ],
"bathhouse": [
  { "key": "bathhouse_entry", "stageMin": 0, "path": "any", "text": "The steam clung to my skin. He didn’t belong here—too filthy, too brazen. Still, my eyes followed him through the haze." },
  
  { "key": "shared_steam", "stageMin": 1, "path": "any", "text": "Our towels brushed as we passed. I scolded myself for staring, but heat flooded me anyway." },
  
  { "key": "accidental_splash", "stageMin": 2, "path": "any", "text": "He splashed water onto me playfully. I laughed, then froze as his gaze lingered too long on my chest through wet fabric." },
  
  { "key": "corner_kiss", "stageMin": 3, "path": "love", "text": "He pulled me into a quiet corner of steam, lips crashing into mine. My knees trembled with the warmth of it." },
  { "key": "rough_grab", "stageMin": 3, "path": "corruption", "text": "Hands grabbed under the water. His fingers were shameless, and I moaned despite knowing others were nearby." },
  { "key": "hidden_hand", "stageMin": 3, "path": "hybrid", "text": "He slid his hand between my thighs under the water. I gasped but leaned into it—thrill and tenderness clashing." },
  
  { "key": "body_wash", "stageMin": 4, "path": "love", "text": "I lathered his back. His sigh made me blush. I wanted to keep washing him forever." },
  { "key": "public_fondle", "stageMin": 4, "path": "corruption", "text": "He pressed me against the bath’s edge, hand groping openly. The thought of being caught made me drip with heat." },
  
  { "key": "steamy_lock", "stageMin": 5, "path": "any", "text": "He locked the small wash-room door behind us. My heart raced—whether from fear or excitement, I couldn’t say." },
  
  { "key": "slip_inside", "stageMin": 6, "path": "corruption", "text": "He slid inside me under the steaming water. I gripped the edge, moaning into the mist." },
  { "key": "waterfall_kiss", "stageMin": 6, "path": "love", "text": "We kissed beneath the pouring spout. It felt like the world disappeared, only his lips existed." },
  { "key": "steamy_moan", "stageMin": 6, "path": "hybrid", "text": "Steam clouded us, muffling my moans. I wanted the world to hear, yet prayed it didn’t." },
  
  { "key": "pool_straddle", "stageMin": 7, "path": "corruption", "text": "I straddled him in the shallow pool, water sloshing. My moans echoed shamelessly in the chamber." },
  { "key": "bath_slide", "stageMin": 7, "path": "hybrid", "text": "He lifted me up and slid me down onto him. I wrapped my arms tight, both scared and elated to lose myself here." },
  
  { "key": "moans_in_steam", "stageMin": 8, "path": "corruption", "text": "My cries bounced through the steamy chamber. I didn’t care who heard—the filth, the heat, it owned me." },
  
  { "key": "shared_soak", "stageMin": 8, "path": "love", "text": "We sank into the hot pool together. He held me in his lap, slow thrusts mixing tenderness and desire." },
  
  { "key": "caught_by_matron", "stageMin": 9, "path": "corruption", "text": "The bath matron pounded on the door, shouting. He didn’t stop. I screamed louder, drowning her out." },
  
  { "key": "steam_slave", "stageMin": 10, "path": "corruption", "text": "He used me against the tiled wall, pounding until I came undone, dripping down the stones. Steam and seed—my new perfume." },
  
  { "key": "waterbound_vows", "stageMin": 10, "path": "love", "text": "In the hottest pool, he whispered that I was his, forever. I believed him, filth and all." },
  { "key": "taboo_union", "stageMin": 10, "path": "hybrid", "text": "We fucked in the open bath, steam cloaking our bodies. I screamed his name, daring the world to judge us." }
],
      "brothel": [
  { "key": "brothel_entry", "stageMin": 0, "path": "any", "text": "The lanterns glowed red. Perfume and sweat clung to the walls. I told myself I didn’t belong here—but followed him in anyway." },

  { "key": "stolen_glances", "stageMin": 1, "path": "any", "text": "He smirked while women eyed him. My chest tightened with jealousy, though I said nothing." },

  { "key": "hands_on_back", "stageMin": 2, "path": "any", "text": "He pressed his palm to the small of my back, guiding me past silk curtains. It looked like ownership. It felt like it too." },

  { "key": "curtain_kiss", "stageMin": 3, "path": "love", "text": "Behind the drapes, he kissed me gently, as though the noise outside didn’t exist." },
  { "key": "wall_thrust", "stageMin": 3, "path": "corruption", "text": "He shoved me into the wall, hips grinding against me while laughter echoed from the next room. My breath betrayed me with moans." },
  { "key": "forbidden_tease", "stageMin": 3, "path": "hybrid", "text": "His lips were sweet, but his hands rough. I melted into both—the tender and the taboo." },

  { "key": "lap_dance", "stageMin": 4, "path": "corruption", "text": "He sat on the velvet chair, yanked me onto his lap. The music throbbed as I ground down shamelessly in time with it." },
  { "key": "silk_caress", "stageMin": 4, "path": "love", "text": "He draped silk across my bare shoulders, tracing it with reverence. Even here, he made me feel cherished." },

  { "key": "mirror_reflection", "stageMin": 5, "path": "any", "text": "We caught our reflection in the brothel mirror. My flushed face looked like someone else’s, someone I barely recognized." },

  { "key": "velvet_claim", "stageMin": 6, "path": "corruption", "text": "He bent me over a velvet couch and took me hard. The groans around us only made me wetter." },
  { "key": "slow_worship", "stageMin": 6, "path": "love", "text": "Among the chaos, he held me steady, whispering that I was the only one that mattered." },
  { "key": "scent_of_lust", "stageMin": 6, "path": "hybrid", "text": "Perfume and musk coated the air. His thrusts made me forget which scent was his and which was mine." },

  { "key": "open_chamber", "stageMin": 7, "path": "corruption", "text": "He pulled me into an open chamber. Curtains drawn back, eyes watching, and he still forced me down onto him. I screamed with abandon." },
  { "key": "half_hidden", "stageMin": 7, "path": "hybrid", "text": "We hid half behind a curtain while strangers laughed only steps away. The risk only made me crave him more." },

  { "key": "stage_show", "stageMin": 8, "path": "corruption", "text": "He tossed me onto the stage where others had performed. My body arched as he used me like the main act." },
  { "key": "shared_moan", "stageMin": 8, "path": "love", "text": "Amid the brothel’s chaos, we found each other’s mouths, our kiss louder than the moans around us." },

  { "key": "curtain_rip", "stageMin": 9, "path": "corruption", "text": "He tore the curtain aside, exposing me mid-thrust to the room. My shame turned instantly to dripping arousal." },

  { "key": "red_lantern_vows", "stageMin": 10, "path": "love", "text": "Under the red glow, he whispered promises against my neck: love lasting longer than lust." },
  { "key": "brothel_whore", "stageMin": 10, "path": "corruption", "text": "He made me scream until every client knew my name. I left the brothel dripping, claimed as his whore." },
  { "key": "vagrant_queen", "stageMin": 10, "path": "hybrid", "text": "The girls cheered as if I’d joined their ranks. I strutted out, body wrecked and glowing, proud to be his queen." },
        { "key": "brothel_pregnancy_scare", "stageMin": 5, "path": "any", "text": "The red lanterns blurred when my belly fluttered. Fear gnawed at me—what if his seed had already taken root here, of all places?" },

  { "key": "brothel_pregnancy_confession", "stageMin": 6, "path": "love", "text": "He touched my stomach softly after the act, whispering that no matter where it began—even here—our child would be ours." },

  { "key": "brothel_pregnancy_marked", "stageMin": 7, "path": "corruption", "text": "He finished inside me again and again, laughing that every man outside would hear me groan while he planted his claim deeper. I shivered at the thought of carrying it out the door." },

  { "key": "brothel_pregnancy_display", "stageMin": 8, "path": "hybrid", "text": "Curtains half-open, his hand slid down to my belly mid-thrust. He pressed there like he wanted the whole room to know I might already be his breeder." },

  { "key": "brothel_pregnancy_pride", "stageMin": 9, "path": "corruption", "text": "I staggered out, thighs dripping, one hand on my belly. The whores smiled knowingly, whispering 'his broodmare'—and I didn’t correct them." },

  { "key": "brothel_pregnancy_vow", "stageMin": 10, "path": "love", "text": "Beneath the red lantern, he kissed my swollen belly. I cried, not for shame, but for the vow that our child was proof of love in the filthiest of places." },

  { "key": "brothel_pregnancy_exhibition", "stageMin": 10, "path": "corruption", "text": "He forced me on stage with my belly heavy. Every thrust made the crowd roar. I moaned louder than ever, pride swelling that they saw me as nothing but his fertile whore." }
      ],
  "festival_tent": [
  { "key": "tent_entry", "stageMin": 0, "path": "any", "text": "The music outside was wild, but in here it felt too quiet. His shadow loomed close—I told myself it was just the lantern swaying." },

  { "key": "tent_glance", "stageMin": 1, "path": "any", "text": "He leaned close, laughter muffled by fabric walls. My heart raced—was it the drums, or the heat in his eyes?" },

  { "key": "tent_hand_brush", "stageMin": 2, "path": "any", "text": "Our fingers touched on the straw mat. Rough, dirty, too deliberate to be accidental. I didn’t pull away fast enough." },

  { "key": "tent_kiss_stolen", "stageMin": 3, "path": "love", "text": "The crowd cheered outside while he stole a kiss in the dark. I pressed back, desperate, hoping no one would hear the small sound I made." },

  { "key": "tent_forceful_grab", "stageMin": 3, "path": "corruption", "text": "He pinned me against the canvas and took my lips without asking. My muffled whimper melted into hunger I didn’t want to admit." },

  { "key": "tent_tangle", "stageMin": 4, "path": "hybrid", "text": "Half anger, half need—I pushed at him but let him hold me tighter. Shame bled into heat as our mouths crashed again." },

  { "key": "tent_moan_hidden", "stageMin": 5, "path": "any", "text": "I bit my knuckle when he touched me where no one else dared. Outside, the festival drums masked my moans—barely." },

  { "key": "tent_on_knees", "stageMin": 6, "path": "corruption", "text": "He pushed my head down, the dirt and musk overwhelming. I gagged softly, but part of me thrilled that anyone could pull open the flap and see." },

  { "key": "tent_lover_embrace", "stageMin": 6, "path": "love", "text": "He laid me down gentle on the straw, his forehead pressed to mine while the fireworks shook the canvas. I let him in, whispering his name like a prayer." },

  { "key": "tent_exhibition", "stageMin": 7, "path": "hybrid", "text": "He ripped my dress aside and pressed deep as the lantern light flickered. I wanted to scream, but the thought of being overheard made me burn hotter." },

  { "key": "tent_taken", "stageMin": 8, "path": "corruption", "text": "He took me hard against the pole, canvas shaking with every thrust. I cried out, knowing people outside heard—and I didn’t care." },

  { "key": "tent_devotion", "stageMin": 8, "path": "love", "text": "We moved together in silence, hiding love inside chaos. I wanted the moment to never end, even as the crowd laughed just beyond." },

  { "key": "tent_unashamed", "stageMin": 9, "path": "hybrid", "text": "His seed dripped down my thighs when he pulled me upright. We stepped out together, flushed, knowing eyes followed us. I smiled anyway." },

  { "key": "tent_possession", "stageMin": 9, "path": "corruption", "text": "He spilled inside me, then pushed me to the flap, holding me so the crowd could hear my panting. I was nothing but his, and I moaned my acceptance." },

  { "key": "tent_extreme", "stageMin": 10, "path": "any", "text": "The tent collapsed around us mid-act, shouts erupting from outside. Straw, canvas, bodies tangled—and I screamed his name, unashamed, as everyone saw the truth of what we were." },
  ],
  "festival_tent_pregnancy": [
  { "key": "tent_pregnancy_fear", "stageMin": 4, "path": "any", "text": "When he touched me beneath the lantern glow, I clutched my belly, terrified someone might notice how it swelled. The crowd laughed outside—I prayed they wouldn’t see." },

  { "key": "tent_pregnancy_desire", "stageMin": 5, "path": "love", "text": "He rested his hand on my stomach as he kissed me. I thought I’d cry from the tenderness. Even hidden in this tent, the world felt bright with the future inside me." },

  { "key": "tent_pregnancy_shame", "stageMin": 5, "path": "corruption", "text": "The drums outside rattled while he pushed me down. My swollen belly pressed against the mat, his seed already inside me. I whimpered—not from resistance, but from craving more." },

  { "key": "tent_pregnancy_public_thill", "stageMin": 7, "path": "hybrid", "text": "The fabric walls shuddered as he moved inside me. I arched back, one hand cradling the life he gave me, the other clinging to him. I wanted someone to hear—I wanted them to know." },

  { "key": "tent_pregnancy_weight", "stageMin": 8, "path": "corruption", "text": "Every thrust pressed down on the child growing within me. Shame should have stopped me, but I only begged louder, moaning as if daring the whole festival to hear." },

  { "key": "tent_pregnancy_devotion", "stageMin": 8, "path": "love", "text": "He kissed my swollen belly between every movement, whispering promises even as we trembled at the thought of being overheard." },

  { "key": "tent_pregnancy_display", "stageMin": 9, "path": "corruption", "text": "He pulled me to the flap, belly round and heavy, and slammed me against the canvas until it rattled. Voices outside paused—I flushed with shame, but I couldn’t stop moaning his name." },

  { "key": "tent_pregnancy_pride", "stageMin": 9, "path": "love", "text": "He held me in his arms, hand on my belly, while we lay tangled in straw. For the first time, I didn’t care if the world outside guessed—I was proud of what we’d made together." },

  { "key": "tent_pregnancy_extreme", "stageMin": 10, "path": "any", "text": "The tent collapsed around us, revealing everything—the sweat, the thrusts, the swell of my stomach. I cried out, overwhelmed, not in fear but in shameless pride that I was his, body and child both." }
  ],
  "starlight_snap_booth": [
  { "key": "snap_booth_shy", "stageMin": 0, "path": "any", "text": "The booth curtain closed, and we were shoulder-to-shoulder in the tiny space. My heart beat louder than the timer’s beep." },

  { "key": "snap_booth_brush", "stageMin": 1, "path": "any", "text": "Our arms brushed as the flash went off. I pretended to laugh, but I couldn’t stop thinking about how close he was." },

  { "key": "snap_booth_kiss", "stageMin": 2, "path": "love", "text": "The camera clicked the moment his lips found mine—an accidental souvenir of something I’ll never forget." },

  { "key": "snap_booth_hand", "stageMin": 2, "path": "corruption", "text": "His hand slid beneath my skirt just as the flash went off. If anyone sees the strip, they’ll know exactly what happened in that frame." },

  { "key": "snap_booth_caught", "stageMin": 3, "path": "hybrid", "text": "The curtain shifted, a giggle outside. We froze—me straddling his lap, his hands gripping me. The camera captured my gasp forever." },

  { "key": "snap_booth_tongue", "stageMin": 4, "path": "corruption", "text": "He kissed me with tongue, the wet sound loud in the silence between flashes. I knew the camera caught my moan." },

  { "key": "snap_booth_pressed", "stageMin": 5, "path": "love", "text": "He pressed me against the glass wall, kissing me like I was the only thing that mattered, while the camera clicked our laughter." },

  { "key": "snap_booth_fingers", "stageMin": 6, "path": "corruption", "text": "His fingers slipped inside me, and I bit his shoulder to keep from crying out. The photo strip will look innocent—only we know the truth." },

  { "key": "snap_booth_public", "stageMin": 7, "path": "hybrid", "text": "I bounced on his lap as the flashes went off in sequence, turning our filth into a set of photos I’ll never dare show anyone." },

  { "key": "snap_booth_extreme", "stageMin": 10, "path": "corruption", "text": "The booth curtain ripped open mid-thrust. I locked eyes with a stranger outside as the last flash burned his seed inside me onto film. I didn’t care. I wanted the world to see." },

    { "key": "snap_booth_extreme_close_up", "stageMin": 10, "path": "corruption", "text": "Multiple flashes went off as my pussy clung to his gigantic manhood, we captured the moment his seed spilled inside me" }
    
  ],
  "starlight_snap_booth_pregnancy": [
  { "key": "snap_booth_belly_glance", "stageMin": 4, "path": "any", "text": "The flash caught my rounded belly between us. I flushed red, but his hands lingered there, proud and possessive." },

  { "key": "snap_booth_belly_kiss", "stageMin": 5, "path": "love", "text": "He kissed my swollen stomach just as the camera clicked. The picture showed nothing else, but to me it was everything." },

  { "key": "snap_booth_exposed_curve", "stageMin": 6, "path": "corruption", "text": "He tugged my dress up to expose the curve of me as the shutter snapped. I should’ve stopped him—but the thrill of being displayed burned hotter than shame." },

  { "key": "snap_booth_pregnant_straddle", "stageMin": 7, "path": "hybrid", "text": "I straddled him awkwardly, belly pressing into his chest. The photos will look obscene, but the smile on my lips was pure joy." },

  { "key": "snap_booth_pregnant_moan", "stageMin": 8, "path": "corruption", "text": "The camera caught my head thrown back, mouth open in a moan as he filled me, swollen belly shaking with every thrust." },

  { "key": "snap_booth_tender_family", "stageMin": 9, "path": "love", "text": "We sat close, his hand spread across my stomach. For once the photos looked less like scandal and more like a family portrait." },

  { "key": "snap_booth_public_flaunt", "stageMin": 10, "path": "corruption", "text": "He held me wide open, my swollen belly framed in the shot, his seed dripping out of me as strangers laughed outside the booth. I didn’t care—I wanted proof that I belonged to him." }
  ],
  "train_ride": [
  { "stage": 0, "path": "any", "text": "I sat across from him on the rattling bench, pretending not to notice the grime on his hands. He smirked at me like he knew I was watching." },
  { "stage": 1, "path": "any", "text": "The sway of the carriage rocked me closer. His knee brushed mine, rough fabric scraping my skin. I pulled away… too quickly." },
  { "stage": 2, "path": "love", "text": "The lantern light flickered over his face as he leaned close to whisper. I should have pushed him back. Instead, I found myself smiling." },
  { "stage": 2, "path": "corruption", "text": "His hand lingered far too long on my thigh. I hissed at him to stop, but my voice shook more with heat than anger." },
  { "stage": 3, "path": "any", "text": "The train rocked harder, and so did we—his arm curling around my waist, pulling me flush against his filthy chest. My heart pounded louder than the rails." },
  { "stage": 4, "path": "love", "text": "He kissed me by the window. The glass fogged as our mouths moved hungrily, the world speeding past unseen." },
  { "stage": 4, "path": "corruption", "text": "His filthy hand snuck under my skirt. I slapped it away, cheeks burning. He only grinned, the dirt under his nails still scratching my thigh." },
  { "stage": 5, "path": "any", "text": "We found a secluded corner near the freight car. His mouth was on mine, his hand gripping my hip. Every jolt of the tracks made us grind harder together." },
  { "stage": 6, "path": "love", "text": "He slid into me between the clatter of wheels, muffling my gasps with his lips. I clung to him, every thrust timed with the crash of the tracks." },
  { "stage": 6, "path": "corruption", "text": "He forced me against the wall, teeth on my neck, rutting like an animal. My skirt was up, his filth grinding into me raw. I moaned even as shame flooded me." },
  { "stage": 7, "path": "hybrid", "text": "We fucked like thieves, daring discovery. I kissed him through the dirt and sweat, crying his name as he pounded me into the rattling wood." },
  { "stage": 8, "path": "corruption", "text": "He bent me over the rattling bench and slammed himself inside, juices dripping onto the floor. The sound of flesh and filth mixed with the rail’s thunder." },
  { "stage": 9, "path": "any", "text": "I straddled him in the corner seat, bouncing shamelessly as the train screamed through tunnels. His hands smeared dirt over my breasts as he groaned into my mouth." },
  { "stage": 10, "path": "corruption", "text": "He spilled inside me as the conductor walked past the door. I didn't care. I moaned louder, grinding down, clenching around his filth, milking every drop of his seed while the whole train could hear." }
  ],
  "dojo": [
  { "stage": 0, "path": "any", "text": "The tatami smelled of dust and sweat. I sat quietly, watching him mock the discipline of the place. I told myself I was only annoyed." },
  { "stage": 1, "path": "any", "text": "He picked up a staff, twirling it clumsily but grinning at me like he’d mastered it. I laughed, then regretted giving him the satisfaction." },
  { "stage": 2, "path": "love", "text": "I corrected his stance. My hands lingered on his wrists longer than I should have, guiding strength into filth." },
  { "stage": 2, "path": "corruption", "text": "He pressed too close during practice, his body foul and hot against mine. The master’s scrolls watched us in silence." },
  { "stage": 3, "path": "any", "text": "He pinned me mid-spar, his smirk daring me to wriggle free. I could feel his rough breath across my face." },
  { "stage": 4, "path": "love", "text": "We kissed between the wooden posts. His dirt smeared across my cheek, and I let it stay as proof." },
  { "stage": 4, "path": "corruption", "text": "He slammed me against the practice dummy, hand between my thighs. The creak of the dojo echoed louder than my gasp." },
  { "stage": 5, "path": "any", "text": "We stole a corner behind the weapon racks. He bit down on my shoulder while I clutched at the mats." },
  { "stage": 6, "path": "love", "text": "We fell together on the tatami, bodies slick, hips rocking in unison. My moans filled the quiet hall like chants of devotion." },
  { "stage": 6, "path": "corruption", "text": "He took me on the dojo floor, pounding into me raw while scrolls of discipline loomed above. My cries shook the walls meant for silence." },
  { "stage": 7, "path": "hybrid", "text": "We trained in lust instead of combat—his thrusts timed like drills, my body arching to meet each one. Tenderness blurred with filth." },
  { "stage": 8, "path": "corruption", "text": "He forced me face-down into the tatami, slamming harder, sweat and filth dripping into my hair. The dojo reeked of sex." },
  { "stage": 9, "path": "any", "text": "I straddled him in the practice ring, riding shamelessly. My moans bounced from the walls, louder than any sparring match." },
  { "stage": 10, "path": "corruption", "text": "He bred me like an animal in the master’s chair. His seed spilled deep, dripping onto the tatami. I screamed for more, not caring if the entire dojo heard." }
  ],
  
  "tavern_cellar": [
  { "key": "cellar_smell", "stageMin": 0, "path": "any", "text": "The cellar reeked of ale and damp wood. He leaned too close, and I wondered if the smell was him or the barrels." },
  { "key": "spill", "stageMin": 2, "path": "any", "text": "A barrel toppled, spilling froth across my skirt. He laughed—then reached to wipe it, far too slow." },
  { "key": "kiss_darkness", "stageMin": 3, "path": "love", "text": "In the candlelit dark, his lips found mine. Ale dripped down, bitter and sweet." },
  { "key": "tabletop_take", "stageMin": 5, "path": "corruption", "text": "He shoved me over the cellar table, wood splintering as he spread me wide." },
  { "key": "barrel_press", "stageMin": 7, "path": "hybrid", "text": "He pinned me against the keg, thrusts sloshing beer with every move. My laughter broke into moans." },
  { "key": "drunk_slave", "stageMin": 9, "path": "corruption", "text": "He poured ale over my chest before burying his mouth. I was drunk on him, not the drink." },
  { "key": "ale_whore", "stageMin": 10, "path": "corruption", "text": "Sticky with beer, my cries echoed with his name. I let him fuck me into the wood until I reeked of tavern and man alike." }
  ],
  "observatory": [
  { "stage": 0, "path": "any", "text": "The telescope pointed toward the stars. I wanted to talk about constellations; he only scoffed and muttered about how small they made him feel." },
  { "stage": 1, "path": "any", "text": "We stood shoulder to shoulder, gazing up. His arm brushed mine—grimy, rough. I should have moved. I didn’t." },
  { "stage": 2, "path": "love", "text": "I guided his eye to the telescope. His hands fumbled on the brass, but when he whispered my name under the stars, I melted." },
  { "stage": 2, "path": "corruption", "text": "He leaned close, stinking of sweat and smoke, whispering filth into my ear while the stars glittered indifferently above." },
  { "stage": 3, "path": "any", "text": "We kissed by the telescope’s base, the dome echoing the sound. My body trembled with a mix of shame and longing." },
  { "stage": 4, "path": "love", "text": "He pressed me softly against the railing. The cosmos swam overhead, but all I saw was the strange warmth in his dirty eyes." },
  { "stage": 4, "path": "corruption", "text": "He shoved me down over the telescope’s cold brass. My gasp echoed in the observatory as his hands roamed where they shouldn’t." },
  { "stage": 5, "path": "hybrid", "text": "We lay beneath the rotating dome, his filth against my skin, my lips whispering love against his neck. Tenderness and taboo tangled together." },
  { "stage": 6, "path": "any", "text": "He thrust into me under the skylight, each push timed with the rotation of the dome. The stars spun above as my cries filled the chamber." },
  { "stage": 7, "path": "corruption", "text": "He bent me over the telescope, fucking me until the glass fogged from my moans. The stars blurred as filth dripped between my thighs." },
  { "stage": 8, "path": "any", "text": "I rode him on the observation platform, head tossed back, breasts bouncing under the starlight. I didn’t care if the whole town below saw us." },
  { "stage": 9, "path": "corruption", "text": "He slammed into me against the dome wall, the sound of wet flesh and filth echoing louder than the turning gears. I begged for more." },
  { "stage": 10, "path": "corruption", "text": "He flooded me on the telescope’s brass, seed dripping down my thighs as I screamed like a star being born. I begged him to breed me again under the endless sky." }
  ],
  "abandoned_shack": [
  { "stage": 0, "path": "any", "text": "The shack smelled of rot and dust. I wrinkled my nose; he smirked like it suited him." },
  { "stage": 1, "path": "any", "text": "I sat on a broken chair. He leaned against the wall, grime blending with shadows. Somehow I wasn’t afraid." },
  { "stage": 2, "path": "love", "text": "The wind whistled through the cracks. He pulled his coat around me. It stank of smoke—but it was warm." },
  { "stage": 2, "path": "corruption", "text": "He pressed me against splintered wood, whispering filth as if the rot itself demanded I listen." },
  { "stage": 3, "path": "any", "text": "His lips crushed mine, dust falling from the rafters with every shuddering kiss." },
  { "stage": 4, "path": "love", "text": "We lay on a torn mattress, soft touches fighting the grit beneath us. I wanted to believe this ruin could hold something tender." },
  { "stage": 4, "path": "corruption", "text": "He bent me over the table, splinters biting my palms, his cock grinding filth into me as I whimpered at every thrust." },
  { "stage": 5, "path": "hybrid", "text": "We fucked on the floor, my moans swallowed by shadows. I loved him. I hated how much I loved the dirt, too." },
  { "stage": 6, "path": "any", "text": "He pinned me to the broken wall, each thrust rattling the whole shack. I screamed into his shoulder, knowing anyone could hear." },
  { "stage": 7, "path": "corruption", "text": "He held me down on the rotten floorboards, pounding into me while vermin scattered. His filthy seed soaked into the wood beneath us." },
  { "stage": 8, "path": "any", "text": "I rode him on the splintered table, breasts bouncing, juices soaking the rotting planks. I didn’t care if the place collapsed." },
  { "stage": 9, "path": "corruption", "text": "He spit on my face and fucked me harder, the shack echoing with wet slaps and my screams. I clawed the dirt, begging for more." },
  { "stage": 10, "path": "corruption", "text": "He bred me like an animal on the floor, seed gushing down my thighs, my body broken and marked. I screamed his name into the rotten walls until they shook." }
  ],
  "playground": [
  { "stage": 0, "text": "We passed the broken swings. I remembered children’s laughter, and felt uneasy seeing him smile there." },
  { "stage": 2, "text": "He pushed me lightly on the swing. Rust creaked, and his eyes lingered too long on my legs." },
  { "stage": 4, "text": "He caught me mid-swing, pulling me against him. My cheeks burned—this place isn’t for things like that." },
  { "stage": 6, "text": "We kissed hard on the slide, paint flaking beneath my back. Wrong place, wrong time, and I didn’t care." },
  { "stage": 8, "text": "He bent me over the metal bar, my cries mixed with squeaks of rusted chains. Anyone walking by could see everything." },
  { "stage": 10, "text": "He took me on the merry-go-round, thrusts spinning the world until I screamed. My body clung to him, juices dripping, painted in filth under the open night." }
  ],
  "back_alleys": [
  { "stage": 0, "text": "He led me down narrow streets, his hand rough on mine. I told myself it was just for safety." },
  { "stage": 2, "text": "The alley stank of rot, yet my pulse quickened when he pressed me against a wall and whispered filth." },
  { "stage": 4, "text": "He slid his hand under my skirt, daring me to push him away. I froze, torn between shame and heat." },
  { "stage": 6, "text": "I spread for him against the bricks, moaning low while footsteps passed just meters away." },
  { "stage": 8, "text": "He filled me raw in the filth of the alley, his grunts echoing with mine. Trash rustled, rats scattered—and I begged for more." },
  { "stage": 10, "text": "Pinned against dripping walls, my cries bounced off the stone. He bred me like an animal in public filth, and I came screaming his name for all to hear." }
  ],
  "love_hotel": [
  { "stage": 0, "text": "I passed the glowing sign and blushed. He chuckled, daring me to look inside. I refused." },
  { "stage": 2, "text": "He teased me outside the red door, saying one day I’d follow him in. My cheeks betrayed me." },
  { "stage": 4, "text": "Inside, velvet walls closed around us. My knees trembled when he locked the door." },

  { "stage": 6, "text": "He laid me on satin sheets, kissing down my neck as the mirror reflected every shiver." },
  { "stage": 6, "text": "We tried the mirror bed. Watching myself gasp as he thrust inside me made me hotter than I ever imagined." },
    
  { "stage": 7, "text": "He pushed me onto all fours in front of the mirror. My face burned as I watched myself moan like a whore." },
  { "stage": 7, "text": "He spread me wide on the velvet chair. My cries echoed off the gaudy walls, and I didn’t care who heard." },

  { "stage": 8, "text": "I rode him hard in the neon light, my breasts bouncing, his hands slapping my ass until I screamed." },
  { "stage": 8, "text": "He pulled out the restraints from the drawer. I let him tie me down and fuck me like I belonged to him." },

  { "stage": 9, "text": "He ripped off the condom mid-thrust, growling that he wanted me raw. My legs wrapped tight around him before I could think." },
  { "stage": 9, "text": "He slammed into me again and again, and when I begged him not to stop, he whispered, 'Then take all of it' as his seed filled me." },
  { "stage": 9, "text": "I felt him swelling inside me, pulsing, and I pulled him deeper with my legs locked around his waist. I wanted every drop." },
    
  { "stage": 10, "text": "Pinned to the mirrored wall, his cock split me wide. My moans shook the glass as he bred me like an animal." },
  { "stage": 10, "text": "I came so hard I nearly screamed the walls down. My juices soaked the sheets, his cum pouring out of me, and still he didn’t stop." },
  { "stage": 10, "text": "He pressed his hand against my belly, snarling that he wanted to see me swollen with his child. My body betrayed me—I came the hardest I ever have." }
  ],
 "playground": [
  { "stage": 0, "text": "The rusted swings creaked in the breeze. I sat for a moment, remembering being a child here." },
  { "stage": 1, "text": "He laughed when I sat on the swing. For a second it felt innocent… until I saw the hunger in his eyes." },
  { "stage": 2, "text": "We walked past the seesaw. He teased me, saying I should ride it with him. I blushed and kept walking." },
  { "stage": 3, "text": "He pushed me lightly on the swing, standing close. My heart raced with each shove forward." },
  { "stage": 4, "text": "He pulled me against the slide, lips crushing mine. The metal was cold on my back, his body hot." },

  { "stage": 6, "text": "He bent me over the slide, taking me from behind. The squeak of the metal made it feel louder, riskier." },
  { "stage": 6, "text": "I straddled him on the old roundabout, squealing as it spun, his cock bouncing inside me with every turn." },

  { "stage": 7, "text": "He shoved me onto the swing, fucking me while the chains rattled. I gripped tight, moaning with every thrust." },
  { "stage": 7, "text": "Pinned under the monkey bars, I screamed his name as he pounded me, the whole playground echoing my cries." },

  { "stage": 8, "text": "I rode his face on the slide, juices running down onto the rusted metal. He lapped me raw while I begged louder." },
  { "stage": 8, "text": "He spit on me in the sandbox, then fucked me until sand clung to my sweaty back and I moaned like a slut." },

  { "stage": 9, "text": "He tore off the condom mid-thrust in the swing seat. My legs wrapped tight around him—I wanted it raw, wanted it deep." },
  { "stage": 9, "text": "He pushed me onto the merry-go-round, thrusting while it spun. I begged him to fill me, screaming I wanted his child." },
  { "stage": 9, "text": "I clung to the monkey bars as he railed me from behind, snarling that he’d breed me here for everyone to see. I locked my legs and took every drop." },

  { "stage": 10, "text": "He threw me down in the sandbox, pounding me until the air left my lungs. Sand stuck to my ass as he spilled inside me again and again." },
  { "stage": 10, "text": "Straddling the seesaw, he slammed into me while I screamed for more. Our filth soaked the rusted wood, every squeal a filthy confession." },
  { "stage": 10, "text": "He made me kneel at the slide’s bottom, fucking my throat until I gagged, then pulled me up and bred me raw. My screams turned to moans as cum dripped down my thighs in the open air." }
 ], 
  
  "guard_tower": [
  { "key": "lookout", "stageMin": 0, "path": "any", "text": "We climbed the tower at dusk. I told myself it was for the view, not for him." },
  { "key": "lean_on_wall", "stageMin": 2, "path": "any", "text": "He braced against the stone, watching me instead of the horizon." },
  { "key": "kiss_high", "stageMin": 3, "path": "love", "text": "Wind tangled my hair as he kissed me hard, the city sprawling beneath us." },
  { "key": "armor_clash", "stageMin": 5, "path": "corruption", "text": "He tore at my clothes, metal clasps ringing like bells in the dark." },
  { "key": "bend_tower", "stageMin": 7, "path": "hybrid", "text": "He bent me over the parapet, thrusting while the city slept beneath our cries." },
  { "key": "watchman", "stageMin": 9, "path": "corruption", "text": "A guard below shouted up. I smothered my scream in his shoulder while he pounded deeper." },
  { "key": "skyline_slut", "stageMin": 10, "path": "corruption", "text": "At dawn, he filled me raw atop the tower. I welcomed the sun as proof of my ruin, high and unashamed." }
  ],
    
  "library": [
  { "key": "whisper", "stageMin": 0, "path": "any", "text": "Books lined the walls, dust thick as silence. His whisper felt louder than it should." },
  { "key": "page_brush", "stageMin": 2, "path": "any", "text": "His fingers brushed mine over a page. I forgot the words we were meant to be reading." },
  { "key": "kiss_between_stacks", "stageMin": 3, "path": "love", "text": "In the hidden aisle, he kissed me. Dust fell like confetti." },
  { "key": "silence_broken", "stageMin": 5, "path": "corruption", "text": "He lifted my skirt and shoved into me between shelves. I bit back screams; the books bore witness." },
  { "key": "reading_stand", "stageMin": 7, "path": "hybrid", "text": "He bent me over the oak reading stand. My moans blurred into the sound of flipping pages." },
  { "key": "page_torn", "stageMin": 9, "path": "corruption", "text": "He ripped a book page in the frenzy of thrusts. I laughed, moaned, begged for more." },
  { "key": "knowledge_whore", "stageMin": 10, "path": "corruption", "text": "He finished inside me atop a pile of scrolls. I came undone knowing history would reek of us forever." }
  ]
 },

  "jobs": {
  "flower_shop": [
  { "key": "arrange_bouquets", "stageMin": 0, "path": "any", "text": "I spent the morning arranging lilies. He leaned against the door, smirking, eyes on me instead of the flowers. I pretended not to notice." },
  { "key": "petal_touch", "stageMin": 1, "path": "any", "text": "His fingers brushed mine as I handed him a bloom. Rough, unwashed… but it made my heart skip." },
  { "key": "behind_counter", "stageMin": 2, "path": "any", "text": "He cornered me behind the counter. Dirt and sweat against petals, I whispered for him to stop. I didn’t move away." },

  { "key": "backroom_grab", "stageMin": 3, "path": "corruption", "text": "The shop was empty when his hands slid up my skirt. Surrounded by bouquets, I gasped, 'Not here…' He didn’t care. Neither did I." },
  { "key": "rose_thorns", "stageMin": 4, "path": "love", "text": "He pricked his hand on a thorn. I kissed the blood away. His lips caught mine next, raw and needy." },
  { "key": "stained_petals", "stageMin": 4, "path": "corruption", "text": "Petals fell as he bent me over the workbench, every thrust scattering roses and dirt. My moans echoed like a hymn of shame." },

  { "key": "display_window", "stageMin": 5, "path": "any", "text": "He pressed me against the front display window. Outside, footsteps passed. I prayed they wouldn’t glance in—while my body begged for him harder." },

  { "key": "scent_of_sex", "stageMin": 6, "path": "corruption", "text": "The shop reeked of sweat and cum more than flowers. My thighs dripped as I watered roses, aching for him to ruin me again." },
  { "key": "floral_womb", "stageMin": 7, "path": "corruption", "text": "He came inside me among the carnations, whispering that I was his fertile garden. I squeezed him tighter, craving the filth of being seeded here." },

  { "key": "petals_on_tongue", "stageMin": 8, "path": "hybrid", "text": "He stuffed petals into my mouth as his cock filled me. Their sweetness mixed with his salt. I choked on both, begging for more." },
  { "key": "display_case_fuck", "stageMin": 9, "path": "corruption", "text": "He threw me on the glass display, fucking me hard while bouquets toppled. My screams mixed with the crash of vases breaking." },
  { "key": "seeded_in_shop", "stageMin": 10, "path": "corruption", "text": "He pinned me down in the flower bed, thrusting deep until his seed spilled inside me. Windows wide open, I screamed his name—uncaring who heard. I wanted the whole slum to know I belonged to him." }
    ],
"barmaid": [
  { "key": "drink_orders", "stageMin": 0, "path": "any", "text": "I wiped mugs and carried trays. He sat at the end of the bar, watching like I was on the menu too." },
  { "key": "close_pour", "stageMin": 1, "path": "any", "text": "I leaned to pour his drink, his hand brushed mine on the handle. My cheeks burned hotter than the liquor." },
  { "key": "corner_table", "stageMin": 2, "path": "any", "text": "He tugged me toward the corner table when no one looked. His breath was strong with ale. I didn’t pull away." },
  { "key": "lap_sit", "stageMin": 3, "path": "corruption", "text": "I carried his drink over, he pulled me onto his lap in front of everyone. I gasped, pretending to fight him off. My hips betrayed me, grinding down." },
  { "key": "backroom_whisper", "stageMin": 4, "path": "love", "text": "He followed me behind the bar. I should’ve pushed him back, but instead I melted when his arms wrapped me tight, whispering I was his." },
  { "key": "storage_kiss", "stageMin": 5, "path": "any", "text": "Among crates and kegs he kissed me breathless. The smell of beer and sweat made it dizzying. I wanted more." },
  { "key": "bar_counter_grind", "stageMin": 6, "path": "corruption", "text": "He bent me forward over the sticky bar. Patrons shouted for drinks, and all I could feel was him pressing into me from behind." },
  { "key": "tabletop_claim", "stageMin": 7, "path": "hybrid", "text": "He threw me atop a table, knocking mugs aside. Shame and thrill tangled as I wrapped my legs around him with people just steps away." },
  { "key": "open_serving", "stageMin": 8, "path": "corruption", "text": "He slid me onto the counter, pulling me close while I still wore my apron. I moaned into the open bar, too far gone to care who saw." },
  { "key": "barmaid_taken", "stageMin": 9, "path": "corruption", "text": "He pulled my skirt up as I served drinks. Every thrust rocked me against the counter, and I spilled ale all over laughing patrons." },
  { "key": "public_exposure", "stageMin": 10, "path": "corruption", "text": "He yanked me into his lap mid-shift, legs spread wide in front of a room full of drunks. I begged, screamed, and came anyway as the bar roared." }
],
"nurse": [
  { "key": "bandage_wrap", "stageMin": 0, "path": "any", "text": "I cleaned his wounds, wrapping bandages tight. He hissed at the sting, but didn’t look away from my eyes." },
  { "key": "pulse_check", "stageMin": 1, "path": "any", "text": "I held his wrist to check his pulse. His skin was hot, and I realized mine was racing faster than his." },
  { "key": "bedside_whisper", "stageMin": 2, "path": "any", "text": "He tugged me close while I changed his sheets. His voice was low, rough—he called me his angel. I almost believed him." },
  { "key": "curtain_kiss", "stageMin": 3, "path": "love", "text": "I drew the privacy curtain, only to feel him grab my hand. He pulled me down onto the cot, kissing me hard enough to forget where we were." },
  { "key": "supply_closet", "stageMin": 4, "path": "corruption", "text": "I pushed him into the supply closet to scold him. He shoved me against shelves instead, my moans mixing with the rattle of medicine bottles." },
  { "key": "lap_check", "stageMin": 5, "path": "hybrid", "text": "I sat on his lap to take his temperature. He bit back a groan, pressing against me shamelessly. I didn’t stop writing notes." },
  { "key": "exam_table", "stageMin": 6, "path": "any", "text": "He lifted me onto the cold exam table. My legs shook as he spread them, and I gasped at the heat between us in such a sterile place." },
  { "key": "hallway_touch", "stageMin": 7, "path": "corruption", "text": "He caught me in the dark hallway. His hand slid beneath my skirt while footsteps passed outside. I choked down a moan, praying no one opened the door." },
  { "key": "drip_feed", "stageMin": 8, "path": "hybrid", "text": "The IV bag clicked overhead while he thrust into me, hard and fast. My screams turned into whimpers as I clung to the rails." },
  { "key": "clinic_claim", "stageMin": 9, "path": "corruption", "text": "He bent me over the patient desk. Papers scattered while he fucked me raw, his growls drowning out every plea for silence." },
  { "key": "nurse_unmasked", "stageMin": 10, "path": "corruption", "text": "In my uniform, stockings ripped, I straddled him in the open ward. He came inside me again and again, patients groaning nearby, and I didn’t care who watched." }
],
"maid": [
  { "key": "dusting", "stageMin": 0, "path": "any", "text": "I dusted the shelves while he lounged. He watched without shame, and I pretended not to notice." },
  { "key": "laundry", "stageMin": 1, "path": "any", "text": "I knelt to scrub his shirt clean. His eyes lingered low, and I flushed, scrubbing harder to distract myself." },
  { "key": "spilled_bucket", "stageMin": 2, "path": "any", "text": "I tripped, spilling water across the floor. He caught me before I fell, holding me just a beat too long." },
  { "key": "floor_wipe", "stageMin": 3, "path": "love", "text": "I scrubbed the floor on my knees. He crouched beside me, brushing my hair back gently, then stealing a kiss." },
  { "key": "apron_pull", "stageMin": 4, "path": "corruption", "text": "He yanked at my apron strings. I told him to wait. He didn’t." },
  { "key": "tray_drop", "stageMin": 5, "path": "hybrid", "text": "I dropped a tray of dishes when he pressed against me from behind. He whispered filth in my ear while I bent to clean up the mess." },
  { "key": "bed_sheets", "stageMin": 6, "path": "any", "text": "I tucked in fresh sheets, only for him to shove me onto the bed. His mouth covered mine before I could object." },
  { "key": "hallway_order", "stageMin": 7, "path": "corruption", "text": "He barked an order and I obeyed. On my knees in the hall, anyone could have walked past while he forced my lips open." },
  { "key": "feather_duster", "stageMin": 8, "path": "hybrid", "text": "He pinned me with the feather duster still in my hand. I gasped into the fabric as he took me hard, feathers flying everywhere." },
  { "key": "maid_owned", "stageMin": 9, "path": "corruption", "text": "He bent me over the table I’d just polished. Each thrust smeared sweat and filth into the shine. He called me his maid, his whore, his everything." },
  { "key": "public_uniform", "stageMin": 10, "path": "corruption", "text": "In full uniform, stockings ripped, he paraded me around the room. When he came inside me, dripping down my thighs, I was smiling—his perfect filthy servant." }
],
"librarian": [
  { "key": "cataloging", "stageMin": 0, "path": "any", "text": "I spent the morning cataloging books, pretending I didn’t notice his shadow following me between the aisles." },
  { "key": "shushed", "stageMin": 1, "path": "any", "text": "He whispered something indecent. I shushed him, cheeks burning, but part of me didn’t want him to stop." },
  { "key": "fallen_book", "stageMin": 2, "path": "any", "text": "A heavy book slipped from the shelf. He caught it—and brushed against me so closely I could smell the sweat and smoke clinging to him." },
  { "key": "reading_corner", "stageMin": 3, "path": "love", "text": "We shared a cramped reading chair, knees pressed together. His hand found mine between the pages." },
  { "key": "quiet_groan", "stageMin": 4, "path": "corruption", "text": "He pulled me onto his lap in the study alcove. I bit my lip to keep quiet as his hands roamed beneath my skirt." },
  { "key": "aisle_clutch", "stageMin": 5, "path": "hybrid", "text": "He pressed me against the dusty shelves, whispering filth into my ear. The whole library was silent, but my pulse thundered." },
  { "key": "study_desk", "stageMin": 6, "path": "love", "text": "I sprawled across a study desk, books scattered, his mouth against my chest. His tongue left me trembling as I begged for more." },
  { "key": "secret_stacks", "stageMin": 7, "path": "corruption", "text": "Deep in the restricted section, he bent me over the archive shelves. The slap of skin echoed louder than I could shush." },
  { "key": "knowledge_fucked", "stageMin": 8, "path": "hybrid", "text": "He shoved open ancient tomes to lay me across them. I screamed into the pages as he filled me, desecrating knowledge with lust." },
  { "key": "page_torn", "stageMin": 9, "path": "corruption", "text": "He ripped a book page in the frenzy of thrusts. I laughed, moaned, begged for more." },
  { "key": "knowledge_whore", "stageMin": 10, "path": "corruption", "text": "He finished inside me atop a pile of scrolls. I came undone knowing history would reek of us forever." }
],
"slum_caregiver": [
  { "key": "first_meeting", "stageMin": 0, "path": "any", "text": "I was tending to a coughing child in the alleys when he appeared—leaning in the shadows, eyes mocking, stinking of smoke and sweat. That was the first time I met him." },
  { "key": "offered_help", "stageMin": 1, "path": "any", "text": "He sneered at my bandages, called me foolish for wasting kindness. Still… he didn’t walk away." },
  { "key": "bloodied_hand", "stageMin": 2, "path": "any", "text": "I wrapped his hand when he got into a fight. He didn’t thank me, but he didn’t pull away either." },
  { "key": "lingering_touch", "stageMin": 3, "path": "love", "text": "I cleaned dirt from his face, fingers brushing over his cheek longer than they should. His grin softened, just for me." },
  { "key": "dark_teasing", "stageMin": 3, "path": "corruption", "text": "He leaned close while I treated his wounds, whispering filth about how my soft hands could do more than heal." },
  { "key": "slum_watchers", "stageMin": 4, "path": "any", "text": "People stared as I walked the alleys with him trailing after me. Their eyes burned with judgment. My heart burned with something else." },
  { "key": "forceful_kiss", "stageMin": 5, "path": "corruption", "text": "He pinned me against a wall behind the soup line, kissing me hard, tasting of grime. I should’ve pushed him off. I didn’t." },
  { "key": "charity_ruined", "stageMin": 6, "path": "hybrid", "text": "I came to hand out bread. He came to take me instead. My skirt hitched up as loaves fell to the dirt." },
  { "key": "moans_among_the_sick", "stageMin": 7, "path": "corruption", "text": "I tried to stay quiet while treating the fevered—but his fingers were already inside me. The sick groaned nearby. I groaned louder." },
  { "key": "slum_alley_claim", "stageMin": 8, "path": "corruption", "text": "He bent me over a broken crate in full view of the alleys. I clung to him, shaking, while people whispered. He owned me in front of them all." },
  { "key": "holy_inversion", "stageMin": 9, "path": "hybrid", "text": "I told myself it was charity still, letting him take me in the dirt. But the truth is I needed him—his filth, his possession, his ruin." },
  { "key": "marked_by_slums", "stageMin": 10, "path": "corruption", "text": "He finished inside me where the slums could see. My body, my moans, my seed-filled belly—proof that I belong to him, proof for everyone." }
],
"slum_singer": [
  { "stage": 0, "path": "any", "text": "The slum bar was thick with smoke and cheap liquor. I sang to keep their spirits alive… even if my own heart trembled." },
  { "stage": 1, "path": "any", "text": "Vagrant leaned at the back, smirking. He said my voice was 'too clean for this place'. I wanted to prove him wrong." },
  { "stage": 2, "path": "love", "text": "His eyes softened when I sang a softer hymn. For a moment, I believed he actually listened." },
  { "stage": 2, "path": "corruption", "text": "He shouted for a raunchier tune, the crowd laughed, and I felt heat rise to my cheeks as I obeyed." },
  { "stage": 3, "path": "any", "text": "He dragged me backstage, saying the crowd wanted 'more than a song'. My body shook between fear and excitement." },
  { "stage": 4, "path": "love", "text": "He pulled me into the shadows after a set, whispering that I belonged to him. My voice caught—but I didn’t pull away." },
  { "stage": 4, "path": "corruption", "text": "He pushed my face into the brick wall behind the stage, growling that if I wanted to keep singing, I had to earn it." },
  { "stage": 5, "path": "hybrid", "text": "The crowd cheered as his hands slid over me while I sang. Their laughter was cruel, but his touch set me on fire." },
  { "stage": 6, "path": "love", "text": "He kissed me right there as I finished my song. I thought I’d be ashamed—but the cheers made me smile." },
  { "stage": 6, "path": "corruption", "text": "He shoved my dress aside, his filthy hands claiming me while drunks whistled. I sang through a moan, my shame drowned out." },
  { "stage": 7, "path": "any", "text": "He made me sit in his lap between verses. The crowd howled; I flushed red, but couldn’t bring myself to move." },
  { "stage": 8, "path": "corruption", "text": "He made me straddle him on stage, grinding against me while I tried to sing. Every thrust turned my voice into a moan." },
  { "stage": 9, "path": "any", "text": "He bent me over the piano after hours, my voice cracking into cries that echoed through the empty bar." },
  { "stage": 10, "path": "corruption", "text": "He tore the mic from my hand and fucked me in front of the entire tavern, my juices dripping down my thighs as they cheered. I screamed out the last verse as he pumped his seed deep inside me, every eye watching." },
  { "stage": 10, "path": "hybrid", "text": "He made me his instrument—fingers inside me as I gasped lyrics into the mic. I came on stage, soaked and ruined, yet sang louder than ever." },
  { "stage": 10, "path": "love", "text": "He held me after the performance, dirty and raw, whispering that I was 'his star'. For the first time, I believed him… and I wanted the whole world to know it." }
],
"stall_merchant": [
  { "stage": 0, "path": "any", "text": "The stall smelled of fried food and dust. I smiled at passersby, trying not to notice Vagrant’s eyes on me as he leaned lazily against the crates." },
  { "stage": 1, "path": "love", "text": "He stacked boxes beside me, brushing my arm on purpose. I laughed it off, cheeks warm. It almost felt like partnership." },
  { "stage": 1, "path": "corruption", "text": "He brushed past me, hand sliding lower than it should’ve. I gasped, but he only smirked as if daring me to call him out." },
  { "stage": 2, "path": "any", "text": "We argued over prices, leaning too close. His breath was heavy with smoke, mine quick with something I refused to name." },
  { "stage": 2, "path": "corruption", "text": "Behind the stall curtain, his hand gripped my ass. I hissed at him to stop, but he squeezed harder. The heat in me betrayed my words." },
  { "stage": 3, "path": "love", "text": "He brushed my cheek with dirty fingers while I handed change to a customer. I should’ve scolded him, but I only blushed." },
  { "stage": 3, "path": "corruption", "text": "His bulge pressed against me while we pretended to stock goods. My thighs squeezed together, juices threatening to dampen my underwear." },
  { "stage": 4, "path": "hybrid", "text": "He pulled me into his lap behind the counter. I tried to stifle my moans, but the jostling baskets betrayed us." },
  { "stage": 4, "path": "corruption", "text": "He slid his filthy fingers under my skirt mid-shift. I squirted against his palm, soaking the wood floor. My knees buckled, but his grip kept me upright." },
  { "stage": 5, "path": "any", "text": "He made me sit astride him on the stall’s chair, grinding against me until my panties stuck wet against my flower. I prayed no one peeked under the curtain." },
  { "stage": 6, "path": "corruption", "text": "He pushed inside me quick and rough while a drunk customer haggled loudly outside. I bit his shoulder, trying not to squeal as his seed spilled in me." },
  { "stage": 6, "path": "love", "text": "He whispered, 'You’re mine even here,' as he slowly entered me. Customers walked past, and I clung to him, breathless, wet, praying they wouldn’t notice the juices dripping down my thigh." },
  { "stage": 7, "path": "hybrid", "text": "He pulled out mid-thrust, and I begged without words. He smirked and pushed back in harder, his filth dripping from me as I straddled him in broad daylight." },
  { "stage": 8, "path": "corruption", "text": "He bent me over sacks of grain and pounded me until my juices sprayed over the goods. A passerby saw through the flap—our eyes locked as Vagrant came deep inside me." },
  { "stage": 9, "path": "any", "text": "He ripped my blouse open during market rush, my breasts bouncing as he fucked me hard against the stall. The crowd roared with laughter, my body shaking with orgasm after orgasm." },
  { "stage": 10, "path": "corruption", "text": "He tore off the condom and spilled his seed into me in full view of gawking customers. My flower drooled filth down my thighs, and I begged him to keep breeding me as the stall shook." },
  { "stage": 10, "path": "love", "text": "He held my belly, thrusting slow but deep until I screamed. 'Our child will be born here in the slums,' he whispered, filling me as I came again, juices flooding the wooden floor." },
  { "stage": 10, "path": "hybrid", "text": "He pinned me atop the counter, pounding me raw, my flower squirting across the goods. I wrapped my legs around him, refusing to let him pull out, screaming, 'Fill me again!' until he bred me twice more." }
],
"tutor": [
  { "stage": 0, "path": "any", "text": "He smirked when I offered to tutor him in letters. I told myself it was just helping. His eyes followed my lips instead of the chalk." },
  { "stage": 1, "path": "any", "text": "He pretended to struggle, leaning closer every time. His breath reeked of smoke and yet… I didn’t pull away." },
  { "stage": 2, "path": "love", "text": "He traced the words I wrote with clumsy fingers. When our hands brushed, it felt more like affection than accident." },
  { "stage": 2, "path": "corruption", "text": "He 'forgot' how to write my name three times. The last time, he whispered it against my neck instead of the slate." },
  { "stage": 3, "path": "any", "text": "I leaned in to correct him and his hand settled brazenly on my thigh. My voice wavered, but I didn’t stop the lesson." },
  { "stage": 4, "path": "love", "text": "Our reading dissolved into soft laughter. His dirty hands smudged ink across my cheek as he kissed me for the first time during a lesson." },
  { "stage": 4, "path": "corruption", "text": "The lesson ended with my back pinned against the desk. He muttered 'Teacher’s pet' while pressing into me, filth staining my skirt." },
  { "stage": 6, "path": "any", "text": "I couldn’t tell if we were studying anymore. Every touch became a distraction, every word an excuse to be closer." },
  { "stage": 8, "path": "corruption", "text": "He shoved the books aside, bending me over the table where I taught him letters. His 'lesson' left me dripping, the chalk long forgotten." },
  { "stage": 9, "path": "hybrid", "text": "We laughed as I tried to keep reading aloud with his thrusts shaking me against the desk. Love and filth tangled on every syllable." },
  { "stage": 10, "path": "corruption", "text": "Ink splattered across the floor, my hair tangled in his fists as he drove into me. The tutor became the lesson—my body, his filthy textbook." }
],
"dancer": [
  { "stage": 0, "path": "any", "text": "He sat at the back of the tavern, arms folded, watching as I stumbled through my first steps. I told myself I didn’t care what he thought." },
  { "stage": 1, "path": "any", "text": "When my hips swayed, I felt his eyes burning into me. The crowd clapped. His smirk was for me alone." },
  { "stage": 2, "path": "love", "text": "He whistled low and soft. I spun, cheeks flushed, pretending it was for the crowd when my chest ached with pride." },
  { "stage": 2, "path": "corruption", "text": "He mouthed something filthy at me between steps—my knees nearly buckled mid-turn." },
  { "stage": 3, "path": "any", "text": "I danced closer, close enough for his rough fingers to brush my calf as I passed. My skin tingled hotter than the lanterns." },
  { "stage": 4, "path": "love", "text": "He pulled me into his arms after the show, spinning me, calling me his star. My laughter turned to a kiss under the lights." },
  { "stage": 4, "path": "corruption", "text": "Backstage, he pressed me into the curtain, filthy handprints on my thighs. I danced again, but this time only for him." },
  { "stage": 6, "path": "hybrid", "text": "Each performance became ours—my body arching for the crowd, my eyes locked on him. Tender when I faltered, greedy when I twirled too near." },
  { "stage": 8, "path": "corruption", "text": "He yanked me off the floor mid-routine, forcing me to grind against his lap in front of gawking drunks. Their cheers blurred into moans as his cock pressed hard between my cheeks, juices already soaking my costume." },
  { "stage": 9, "path": "hybrid", "text": "I spread my legs wide on stage, panties sticking wet against my folds, every thrust of his fingers sending squirts splashing down my thighs. The crowd thought it was part of the show—only he knew I was cumming for him." },
  { "stage": 10, "path": "corruption", "text": "He bent me over the stage rail, pounding me raw as music blared. 'This pussy’s mine,' he growled. My flower gushed over his cock, juices spraying down my legs. I screamed my climax into the roar of applause, knowing every eye saw me branded as his." }
],
"acolyte": [
  { "stage": 0, "path": "any", "text": "I lit the candles today, keeping my eyes low when he passed by the chapel doors. The smell of dirt didn’t belong here." },
  { "stage": 1, "path": "any", "text": "He lingered too long in the pews, smirking. I whispered the hymns louder, as if the words could drown out his gaze." },
  { "stage": 2, "path": "love", "text": "He asked if I believed the light could save him. I said yes… and meant it. My heart trembled with the hope of it." },
  { "stage": 2, "path": "corruption", "text": "His laugh echoed against the altar. 'Save me with your body,' he teased. My knees weakened as shame warmed my thighs." },
  { "stage": 3, "path": "any", "text": "I knelt to pray and felt his eyes roam every curve of me. I kept whispering ‘forgive me’ as heat pooled between my legs." },
  { "stage": 4, "path": "love", "text": "He touched my hand as I placed a candle. 'You shine brighter than this place,' he murmured. My breath caught like a confession." },
  { "stage": 4, "path": "corruption", "text": "Behind the altar, he grabbed my hips, grinding against my robes. My lips chanted devotion while my body begged for more." },
  { "stage": 6, "path": "hybrid", "text": "He pulled me into the confessional, whispering sin into my ear. I let him slip his hand under my skirt as I gasped ‘holy, holy…’" },
  { "stage": 8, "path": "corruption", "text": "Bent over the altar, my cries mixed with hymns as his cock drove into me, soaking the sacred cloth with my squirt. His seed spilled where prayers should rest." },
  { "stage": 9, "path": "hybrid", "text": "I rode him on the pulpit, breasts bouncing free of my habit, moaning his name like a hymn. Each thrust made the stained glass rattle as I begged for his filthy blessing inside me." },
  { "stage": 10, "path": "corruption", "text": "He fucked me in front of the holy statues, cock spearing my womb as I screamed his name like prayer. His cum poured into me, dripping down my thighs onto sacred stone. I grinned through tears—this temple belongs to him now, and so do I." }
],
"seamstress": [
  { "stage": 0, "path": "any", "text": "I pricked my finger threading a hem when he walked in. Dirt smeared on the counter where he leaned — it didn’t belong near fine cloth." },
  { "stage": 1, "path": "any", "text": "He brushed fabric with those filthy hands, smirking as I scolded him. My cheeks burned hotter than the iron press." },
  { "stage": 2, "path": "love", "text": "He asked me to patch his sleeve. I stitched in silence, feeling the weight of his gaze on my lips every time I bit the thread." },
  { "stage": 2, "path": "corruption", "text": "He whispered how pretty I’d look spread across the sewing table. My thighs pressed together under my skirt as the needle shook in my hand." },
  { "stage": 3, "path": "any", "text": "He tugged a ribbon I wore in my hair, teasing. My heart fluttered as if he’d unraveled me entirely." },
  { "stage": 4, "path": "corruption", "text": "Behind the counter he spread my lips, juices dripping onto the workshop floor. I whimpered—terrified someone would see, wetter each second." },
  { "stage": 5, "path": "hybrid", "text": "He bound my wrists with measuring tape, pulling me onto his lap. My tight flower clenched around him as I gasped against the fabric rolls." },
  { "stage": 6, "path": "love", "text": "He kissed my stitched fingers tenderly before sliding me onto his lap. Even through the filth, his eyes softened as my body gave way to him." },
  { "stage": 7, "path": "corruption", "text": "He plugged my pussy from behind, thrusting like an animal against the workbench. My cries mixed with the clatter of spools scattering on the floor." },
  { "stage": 8, "path": "hybrid", "text": "He spread me over the cutting table, fabric soaking beneath us. 'My breeding hole is yours,' I whispered as his gigantic cock reared and filled me again and again." },
  { "stage": 9, "path": "corruption", "text": "He ripped open my blouse, tits bouncing with each thrust as my juices sprayed across unfinished gowns. I squealed in ecstasy, begging to be ruined more." },
  { "stage": 10, "path": "corruption", "text": "Bent over piles of dresses, his cock drove into my womb as cum gushed down my thighs. I screamed like a whore, moaning about my filthy breeding hole while grinning—this shop is no longer mine. It’s his den, and I’m his cum-soaked seamstress." }
  ]
},
    "daily_life_simple": [
  { "stage": 0, "text": "I watered the flowers and caught myself humming. When I glanced up, he was watching. I pretended not to notice." },
  { "stage": 0, "text": "Cooking stew in the slums, I felt his eyes linger on my hands. He never said a word." },
  { "stage": 0, "text": "He leaned against the wall while I swept the floor. He smelled of smoke. I kept sweeping anyway." },
  { "stage": 0, "text": "We passed each other in the market. His smirk was faint, but it followed me home." },

  { "stage": 1, "text": "He brushed against my shoulder in the crowd. I told myself it was accidental." },
  { "stage": 1, "text": "He brought scraps of food, pretending it was nothing. I smiled more than I should have." },
  { "stage": 1, "text": "I caught him whistling my tune. I didn’t call it out, but my heart skipped anyway." },
  { "stage": 1, "text": "The dirt on his cheek made me want to reach out… I didn’t." },

  { "stage": 2, "text": "He teased me while I sold flowers. I laughed louder than I meant to." },
  { "stage": 2, "text": "He handed me a coin for flowers and brushed my palm just a second too long." },
  { "stage": 2, "text": "He mocked the way I tuck hair behind my ear. I blushed, then scolded him." },
  { "stage": 2, "text": "We shared bread on a crate in the alley. I told myself it was just a meal." },

  { "stage": 3, "text": "He stood too close as I mixed herbs. I didn’t ask him to move." },
  { "stage": 3, "text": "He teased me for being too clean. I teased him for never trying. We both smiled." },
  { "stage": 3, "text": "He reached for a flower and brushed my hand instead. I let it stay." },
  { "stage": 3, "text": "I patched a tear in his sleeve. He didn’t thank me, but he wore it proudly." },

  { "stage": 4, "text": "He leaned over me while I was sewing. My breath caught, but I kept stitching." },
  { "stage": 4, "text": "He stole a bite of stew straight from my spoon. I laughed, then flushed." },
  { "stage": 4, "text": "He whispered something crude while I was hanging laundry. I scolded him… with a smile." },
  { "stage": 4, "text": "He brushed dirt on my cheek with his thumb. I didn’t wash it off right away." },

  { "stage": 5, "text": "He rested his hand on my lower back while we walked. I let it linger." },
  { "stage": 5, "text": "He cornered me in the alley, close enough to smell his skin. I didn’t push him away." },
  { "stage": 5, "text": "I dozed off on his shoulder. The grime on his shirt stained my cheek, but I didn’t move." },
  { "stage": 5, "text": "He teased me about blushing. I teased him about noticing. Neither of us stopped smiling." },

  { "stage": 6, "text": "He pulled me against him after a long day. I melted into the heat without protest." },
  { "stage": 6, "text": "He wiped sweat from my brow with his sleeve. I told him he smelled worse, but I leaned closer anyway." },
  { "stage": 6, "text": "He asked if I’d miss him if he disappeared. I answered before I thought: yes." },
  { "stage": 6, "text": "He touched my hand in front of others. I didn’t let go." },

  { "stage": 7, "text": "He kissed my forehead while I was cooking. The stew nearly burned." },
  { "stage": 7, "text": "He teased me in front of the children. My cheeks burned hotter than theirs." },
  { "stage": 7, "text": "He caught me staring at him while he fixed his boots. I didn’t look away fast enough." },
  { "stage": 7, "text": "He held me while I swept. The broom clattered to the ground." },

  { "stage": 8, "text": "He pressed me against the doorframe. I laughed nervously, but I didn’t resist." },
  { "stage": 8, "text": "He whispered filthy things while I poured tea. My hands shook; I nearly spilled." },
  { "stage": 8, "text": "He slid his hand lower than ever before, right in the open street. My heart raced at being seen." },
  { "stage": 8, "text": "He teased me about panting when we danced in the slum square. I slapped him playfully, still breathless." },

  { "stage": 9, "text": "He gripped me by the waist while I sold flowers. I barely managed a customer’s change." },
  { "stage": 9, "text": "He pulled me into the shadows mid-conversation. My lips were swollen when I returned." },
  { "stage": 9, "text": "He spread his jacket over us on the grass. The stars blurred with every touch." },
  { "stage": 9, "text": "He kissed me in front of everyone. I didn’t care anymore." },

  { "stage": 10, "text": "He bent me over the counter while customers waited outside. I moaned loud enough to be heard." },
  { "stage": 10, "text": "He pushed me into the flowers, crushing them beneath us. I gasped and begged for more." },
  { "stage": 10, "text": "He made me ride him on the bench by the fountain. Passersby stared; I only moved harder." },
  { "stage": 10, "text": "He filled me in the open street. I screamed his name, unashamed of who listened." }
    ],
      "daily_life_tainted": [
  { "stage": 0, "text": "He brushed past me in the slums, his filthy shoulder grazing mine. I told myself it was an accident, but my chest burned anyway." },
  { "stage": 0, "text": "His laughter carried across the alley as I worked. I felt it crawl under my skin like dirt I couldn’t scrub out." },
  { "stage": 0, "text": "I caught him staring while I bent for water. I flushed with anger… but I didn’t stand up right away." },
  { "stage": 0, "text": "When our fingers brushed over coins, I jerked back. My hand tingled, and I hated the part of me that wanted to hold on." },

  { "stage": 1, "text": "When he leaned close, his smell clung to me. I hated that I carried it home—and hated more that I didn’t scrub it away." },
  { "stage": 1, "text": "He called me 'too clean' while smirking. I snapped back, but my cheeks warmed at his gaze." },
  { "stage": 1, "text": "He tossed grime my way, and I scolded him. The smile on his lips lingered longer in my thoughts than the insult." },
  { "stage": 1, "text": "He dropped a filthy rag into my hands. I grimaced, but my heart pounded when his fingers lingered." },

  { "stage": 2, "text": "His laugh echoed behind me as I bent to fetch water. My cheeks flushed when I realized I bent slower, letting him look." },
  { "stage": 2, "text": "I pretended to shoo him away, but the dirt he smeared on my arm stayed there until night. I kept glancing at it." },
  { "stage": 2, "text": "I cursed when his hand brushed mine again… but later, I pressed my palm to my lips, replaying the contact." },
  { "stage": 2, "text": "He stared openly as I worked. Instead of shame, I let myself sway just a little more." },

  { "stage": 3, "text": "Sweeping the floor, he caught my wrist. Dirt smeared my skin, and I didn’t pull away. The broom clattered to the ground." },
  { "stage": 3, "text": "He whispered filth in my ear while others were near. My body tensed, but a thrill stayed in my chest." },
  { "stage": 3, "text": "His rough laugh echoed in my shop. I tried to act disgusted, but I smiled when he couldn’t see." },
  { "stage": 3, "text": "When he pressed his knee against mine, I hissed at him to stop. He didn’t—and neither did I." },

  { "stage": 4, "text": "I let him press against me in the alley’s shadow. His breath was rank, his hands rough, and my body betrayed me by leaning back into it." },
  { "stage": 4, "text": "He pulled me into the dark, dirt grinding against my dress. I trembled—not with fear, but want." },
  { "stage": 4, "text": "My lips said 'no' but my hips leaned toward him. The contradiction burned hotter than any denial." },
  { "stage": 4, "text": "His hand on my throat left no mark, only the memory. I whispered a prayer and then begged him not to stop." },

  { "stage": 5, "text": "He made a joke of my dress catching on a nail—then tugged it lower instead of fixing it. My heart raced; I didn’t stop him." },
  { "stage": 5, "text": "He pushed me against the counter, filth against petals. I gasped, but didn’t push him away." },
  { "stage": 5, "text": "He smeared his stench across my lips, daring me to spit. Instead, I licked it away." },
  { "stage": 5, "text": "When he groped me openly, I hissed—but my thighs parted against his touch." },

  { "stage": 6, "text": "I wore his smell all day after he touched me, even when others noticed. Instead of shame, I felt proud." },
  { "stage": 6, "text": "I leaned into his filth, whispering that I wanted more. The grin he gave me made my chest burn." },
  { "stage": 6, "text": "His hands dragged grime across my breasts. I arched into them, shivering with heat." },
  { "stage": 6, "text": "I caught myself moaning his name while alone. The sound filled me with both horror and need." },

  { "stage": 7, "text": "He smeared dirt across my lips and told me to smile. I did. I swallowed the taste, trembling, and begged for more." },
  { "stage": 7, "text": "He called me his little whore in the slums. I blushed, then whispered, 'Yes' back to him." },
  { "stage": 7, "text": "I begged him to mark me deeper. His filth seeped into my skin, and I sighed in relief." },
  { "stage": 7, "text": "I pressed my face to his chest, inhaling smoke and grime, desperate for it never to fade." },

  { "stage": 8, "text": "He pinned me against the market wall while people passed. I pretended to protest, but every thrust of his hips made me wetter." },
  { "stage": 8, "text": "He pushed his fingers inside me mid-conversation with another. I smiled through the words, dripping down my thigh." },
  { "stage": 8, "text": "My juices stained my dress as he fondled me in daylight. Strangers stared. I bit my lip and leaned into his hand." },
  { "stage": 8, "text": "He spat in my mouth and laughed when I swallowed. I begged for more in the middle of the crowd." },

  { "stage": 9, "text": "He forced his fingers inside me as I sold flowers. Customers saw my flushed cheeks. They thought it was heat—only I knew better." },
  { "stage": 9, "text": "He bent me over the counter. My scream was muffled by petals, my body dripping for him." },
  { "stage": 9, "text": "He made me taste myself on his fingers, whispering how dirty I’d become. I licked them clean eagerly." },
  { "stage": 9, "text": "I squirted against his hand in public. My legs shook, but I grinned at the onlookers." },

  { "stage": 10, "text": "I no longer care who sees. My body is his display. When his filth leaks from me in the daylight, I smile like it’s a badge." },
  { "stage": 10, "text": "He bred me openly, growling as I screamed his name. Gasps surrounded us—I only moaned louder." },
  { "stage": 10, "text": "He called my pussy his breeding hole. I begged him to fill it until I couldn’t walk." },
  { "stage": 10, "text": "He dragged me into the street, juices streaming down my thighs. 'Yours,' I moaned, proud for all to hear." }
      ],
    "daily_life_love": [
  { "stage": 0, "text": "I watered the flowers while he lingered nearby. His silence felt safe, like he was guarding me without saying a word." },
  { "stage": 0, "text": "We shared bread on a broken step. He didn’t say much, but I caught him smiling when I laughed." },
  { "stage": 0, "text": "He carried a bucket for me, grumbling, but his hand brushed mine on the handle. I felt steady." },
  { "stage": 0, "text": "I caught him watching as I hummed a tune. For once, I didn’t look away." },

  { "stage": 1, "text": "He walked me home. Neither of us spoke, but the silence was warm." },
  { "stage": 1, "text": "I stitched a tear in his shirt. My fingers lingered on the fabric long after." },
  { "stage": 1, "text": "He leaned against the doorway as I cooked. His presence turned the meal into comfort." },
  { "stage": 1, "text": "When I tripped, he steadied me with one hand. My heart skipped." },

  { "stage": 2, "text": "We shared tea under the stars. I let the quiet stretch because it felt right." },
  { "stage": 2, "text": "He brushed dirt from my cheek, and I didn’t flinch. I wanted his touch to stay." },
  { "stage": 2, "text": "He walked close, our arms grazing. I wished the path were longer." },
  { "stage": 2, "text": "He handed me a trinket he found in the alleys. It meant nothing, but I kept it like treasure." },

  { "stage": 3, "text": "He let me lean on his shoulder while I dozed. The world felt softer there." },
  { "stage": 3, "text": "He reached for my hand. I didn’t pull away; I squeezed back." },
  { "stage": 3, "text": "We shared a blanket in the cold. I pretended to sleep so I could stay close." },
  { "stage": 3, "text": "He carried me when I was too tired. I protested weakly but nestled into his chest." },

  { "stage": 4, "text": "He kissed my forehead without a word. I held the warmth for hours." },
  { "stage": 4, "text": "We sat together, his rough hand brushing my hair back. I let him." },
  { "stage": 4, "text": "His laughter filled the room. I wanted to be the reason it kept coming." },
  { "stage": 4, "text": "I let my head rest on his lap. He didn’t move, and neither did I." },

  { "stage": 5, "text": "He kissed me gently at the door. My lips tingled long after he left." },
  { "stage": 5, "text": "His arms wrapped around me when I shivered. I didn’t want him to let go." },
  { "stage": 5, "text": "We fell asleep side by side, not touching, but I woke up with his hand in mine." },
  { "stage": 5, "text": "He told me my smile was the only clean thing in this city. I blushed." },

  { "stage": 6, "text": "Our kisses deepened, lingering until my knees went weak." },
  { "stage": 6, "text": "He held my face in both hands like I was something precious." },
  { "stage": 6, "text": "We cooked together, bumping shoulders, laughing like we’d done it forever." },
  { "stage": 6, "text": "I whispered his name before sleep, hoping he’d hear it in his dreams." },

  { "stage": 7, "text": "His kisses left me breathless, his touch reverent even in its hunger." },
  { "stage": 7, "text": "He cradled me against his chest, murmuring that I belonged there." },
  { "stage": 7, "text": "We lay tangled in the sheets. His heart beat steady against my ear." },
  { "stage": 7, "text": "I saw him smile softly at me when he thought I wasn’t looking." },

  { "stage": 8, "text": "We gave ourselves to each other slowly, tenderly, like a promise." },
  { "stage": 8, "text": "He kissed every inch of me as though memorizing a map." },
  { "stage": 8, "text": "We whispered dreams between kisses, dreams only for us." },
  { "stage": 8, "text": "He told me he loved me with every thrust, and I believed him." },

  { "stage": 9, "text": "We made love like it was sacred. Every sigh was worship." },
  { "stage": 9, "text": "I cried softly in his arms—not from sorrow, but from fullness." },
  { "stage": 9, "text": "He pressed his forehead to mine as he moved inside me. We breathed as one." },
  { "stage": 9, "text": "I told him I’d never leave. The way he held me said he already knew." },

  { "stage": 10, "text": "We lost ourselves in love so deep it erased the world." },
  { "stage": 10, "text": "His name left my lips like prayer, over and over." },
  { "stage": 10, "text": "Every part of me was his, gladly, fully, without hesitation." },
  { "stage": 10, "text": "Our love burned bright enough to make even the filth feel holy." }
    ],
    "daily_life_hybrid": [
  { "stage": 0, "text": "I tended the flowers while he leaned in the doorway, filthy and amused. I wanted to scold him… yet part of me wanted him to stay." },
  { "stage": 0, "text": "He brushed past me, reeking of smoke. I wrinkled my nose but caught myself smiling." },
  { "stage": 0, "text": "We shared a meal, and when his rough hand grazed mine, I didn’t know whether to pull away or hold on." },
  { "stage": 0, "text": "I told myself he didn’t belong here. Still, my eyes followed him as he left." },

  { "stage": 1, "text": "He made a joke at my expense; I rolled my eyes, but laughter spilled out anyway." },
  { "stage": 1, "text": "I patched a tear in his sleeve, my fingers trembling at the dirt still clinging to it." },
  { "stage": 1, "text": "He leaned too close while I cooked. I felt disgust twist into a dangerous sort of warmth." },
  { "stage": 1, "text": "He grinned, and I hated how my chest tightened in response." },

  { "stage": 2, "text": "He pressed against me in a crowded alley, claiming it was an accident. My cheeks burned… because I didn’t step away." },
  { "stage": 2, "text": "He touched my cheek with a dirty hand. I should’ve slapped it away, but I closed my eyes instead." },
  { "stage": 2, "text": "His smell clung to my scarf. I buried my face in it, hating myself for liking it." },
  { "stage": 2, "text": "We walked together under lanterns. I wanted people to see us, to see me choose him—grime and all." },

  { "stage": 3, "text": "He pulled me close, smirk sharp, and I whispered for him to stop even as I melted into him." },
  { "stage": 3, "text": "We shared a blanket. I told myself it was only for warmth, but the heat in my body betrayed me." },
  { "stage": 3, "text": "He dared me to kiss him. I said no, then leaned in anyway." },
  { "stage": 3, "text": "He mocked my blush, and I hated him for noticing… but I kept blushing for him." },

  { "stage": 4, "text": "His lips tasted of ash. I told myself I hated it, then kissed him again." },
  { "stage": 4, "text": "He pinned me to the wall, and I whispered for him to stop—but my hands clutched his shirt tighter." },
  { "stage": 4, "text": "Every glance at him feels like betrayal and desire at once. I can’t tell which wins anymore." },
  { "stage": 4, "text": "He laughed when I let him hold me. I should have pushed him away. Instead, I leaned closer." },

  { "stage": 5, "text": "I kissed him first this time, then told myself it was a mistake." },
  { "stage": 5, "text": "He took my hand in front of others. My shame burned hot—but I didn’t let go." },
  { "stage": 5, "text": "He whispered filth in my ear. I should have recoiled, but I shivered with want." },
  { "stage": 5, "text": "When he left, I touched my lips and prayed no one saw how I smiled." },

  { "stage": 6, "text": "He kissed me hard enough to bruise. My lips ached, my heart raced, and I wanted more." },
  { "stage": 6, "text": "He called me his. I didn’t deny it. The word made my stomach twist—and drip with heat." },
  { "stage": 6, "text": "We pressed against each other in the shadows, daring someone to notice." },
  { "stage": 6, "text": "He pulled me onto his lap, and though I hissed for him to stop, I shifted to fit him better." },

  { "stage": 7, "text": "He licked dirt from his fingers, then touched my lips with them. I opened my mouth anyway." },
  { "stage": 7, "text": "He whispered how ruined I’d look on his cock. I trembled, because I wanted to hear it again." },
  { "stage": 7, "text": "He shoved me into an alley kiss, his stubble burning my skin raw. I clawed at him, begging silently for more." },
  { "stage": 7, "text": "When he held me down, my voice said no but my hips betrayed me." },

  { "stage": 8, "text": "He forced me onto all fours in the dirt. I moaned at the shame of it, louder than I should." },
  { "stage": 8, "text": "His filth smeared across my thighs as he thrust. I loved the way it marked me." },
  { "stage": 8, "text": "I begged him to take me rougher. Every slap of his hips made me wetter." },
  { "stage": 8, "text": "We fucked where anyone could see. My fear made it hotter." },

  { "stage": 9, "text": "He spat on me, and I licked it up without thinking. I hated how much it thrilled me." },
  { "stage": 9, "text": "He called me his whore, and I gasped—because I wanted to hear it again." },
  { "stage": 9, "text": "His cock slammed me against the wall, juices dripping onto the street. I didn’t care who saw." },
  { "stage": 9, "text": "I begged him to come inside me, even as people walked past." },

  { "stage": 10, "text": "He broke me open with his cock, and I screamed his name for the whole slum to hear." },
  { "stage": 10, "text": "My breeding hole throbbed around him, leaking and aching, begging for more." },
  { "stage": 10, "text": "Every thrust made me cry with ecstasy. I didn’t care if the world thought me ruined—I was his." },
  { "stage": 10, "text": "He fucked me until my legs gave out, my juices soaking the dirt. I whispered thank you." }
    ]
  },
  "intimacy": [
  { "stage": 0, "path": "any", "text": "He brushed past me, and though his clothes stank of smoke, my heart fluttered before I scolded myself for noticing." },
  { "stage": 0, "path": "any", "text": "Our hands touched by accident. I pulled away too quickly, cheeks hot, telling myself it meant nothing." },
  { "stage": 0, "path": "any", "text": "I felt his eyes linger. I pretended not to notice, yet my stomach turned with a strange warmth." },
  { "stage": 0, "path": "any", "text": "When he teased me about being ‘too pure,’ I laughed too hard—trying to mask the tiny thrill it gave me." },

  { "stage": 1, "path": "any", "text": "He leaned close to whisper a joke. His breath was foul, but my lips tingled anyway." },
  { "stage": 1, "path": "any", "text": "His hand steadied me as I stumbled. I pulled free quickly, but the warmth lingered." },
  { "stage": 1, "path": "any", "text": "I scolded him for brushing dirt onto my dress, but secretly I liked the attention." },
  { "stage": 1, "path": "any", "text": "When he called me beautiful, I rolled my eyes—but my chest ached with pride." },

  { "stage": 2, "path": "any", "text": "His fingers grazed mine deliberately. I froze, then let it linger too long." },
  { "stage": 2, "path": "any", "text": "We sat too close on the bench; my thigh burned where it pressed against his rough jeans." },
  { "stage": 2, "path": "any", "text": "He smelled of sweat and smoke. I should’ve hated it… but I inhaled deeper." },
  { "stage": 2, "path": "any", "text": "He teased me about blushing. I lied and said it was the cold." },

  { "stage": 3, "path": "love", "text": "He wrapped me in his arms, and though he was unwashed, I felt safe." },
  { "stage": 3, "path": "corruption", "text": "His hand wandered lower while we embraced. I gasped, but didn’t stop him right away." },
  { "stage": 3, "path": "hybrid", "text": "I buried my face against his chest. Filth, sweat, and comfort all at once—I hated how much I liked it." },
  { "stage": 3, "path": "any", "text": "His forehead pressed against mine. I could smell him. I didn’t move away." },

  { "stage": 4, "path": "love", "text": "Our lips brushed soft and unsure. My heart soared despite the grime." },
  { "stage": 4, "path": "corruption", "text": "He pressed his mouth on mine, tongue rough and demanding. I shivered… and let him in." },
  { "stage": 4, "path": "hybrid", "text": "I kissed him back, even as his dirt smeared my cheek. Sweetness and shame tangled inside me." },
  { "stage": 4, "path": "any", "text": "When I pulled away, my lips ached for more." },

  { "stage": 5, "path": "love", "text": "We lay together quietly, his fingers stroking my hair. I thought: maybe this is love." },
  { "stage": 5, "path": "corruption", "text": "He grabbed me hard, claiming my lips like they belonged to him. And they did." },
  { "stage": 5, "path": "hybrid", "text": "I craved both—the tenderness of his hand and the rough pull of his grip. I wanted it all." },
  { "stage": 5, "path": "any", "text": "When I looked at him, dirty and raw, I saw only the man who had made me his." },

  { "stage": 6, "path": "love", "text": "His kisses lingered on my neck. I clutched him tighter, wanting every second." },
  { "stage": 6, "path": "corruption", "text": "His tongue explored mine with animal hunger. I moaned into him, shameless." },
  { "stage": 6, "path": "hybrid", "text": "Every kiss turned to bites, every bite softened to kisses. Pleasure and pain twined like us." },
  { "stage": 6, "path": "any", "text": "My body trembled each time his lips found me." },

  { "stage": 7, "path": "love", "text": "He whispered that I was his light. I whispered back: I’m not going anywhere." },
  { "stage": 7, "path": "corruption", "text": "He shoved me against the wall, kissing me rough, and I kissed him back harder." },
  { "stage": 7, "path": "hybrid", "text": "I want the dirt, the bruises, and the warmth. I want it all at once, over and over." },
  { "stage": 7, "path": "any", "text": "I’m addicted to his mouth. Even when I push him away, I always return." },

  { "stage": 8, "path": "love", "text": "We tangled beneath the stars, kisses slow and endless. I wanted to be his forever." },
  { "stage": 8, "path": "corruption", "text": "He forced his tongue deep and I moaned, clutching his filthy shirt, begging for more." },
  { "stage": 8, "path": "hybrid", "text": "I dragged him closer, greedy for every kiss. The dirtier it got, the sweeter it felt." },
  { "stage": 8, "path": "any", "text": "Every kiss left me breathless, aching, wanting him inside me." },

  { "stage": 9, "path": "love", "text": "We kissed until tears wet my cheeks. I wanted all of him—forever, not just tonight." },
  { "stage": 9, "path": "corruption", "text": "His mouth owned mine, his hands pinning me. I surrendered to the filth and the fire." },
  { "stage": 9, "path": "hybrid", "text": "Love made me stay. Desire made me open wider. Together, they made me his." },
  { "stage": 9, "path": "any", "text": "Each kiss felt like a promise written in sweat and sin." },

  { "stage": 10, "path": "love", "text": "We devoured each other, not kisses but vows, raw and desperate. My body, my heart, my soul—his." },
  { "stage": 10, "path": "corruption", "text": "His filthy tongue claimed me, spit dripping down my chin. I moaned like a whore and begged for more." },
  { "stage": 10, "path": "hybrid", "text": "He crushed me with kisses, filth and tenderness at war. I didn’t care who won—I only wanted him." },
  { "stage": 10, "path": "any", "text": "The world disappeared, leaving only his mouth and the ruinous bliss of belonging to him." }
  ]
},
"erotic_lips": [
  { "stage": 0, "path": "love",       "text": "He brushed his lips over mine, soft and hesitant. My chest fluttered, but I turned away quickly." },
  { "stage": 0, "path": "corruption", "text": "His dirty mouth stole a peck from me. I scolded him, but deep down I wanted more." },
  { "stage": 0, "path": "hybrid",     "text": "He teased me with a quick kiss, his taste of smoke lingering. I hated it, and yet I didn’t wipe it away." },

  { "stage": 1, "path": "love",       "text": "Our lips brushed longer this time. I felt his warmth even through the grime." },
  { "stage": 1, "path": "corruption", "text": "He forced his lips onto mine, rough and demanding. I gasped, but my body leaned in anyway." },
  { "stage": 1, "path": "hybrid",     "text": "He kissed me dirty, I kissed him back gently. Sweetness tangled with his stench." },

  { "stage": 2, "path": "love",       "text": "He kissed me under lantern light, tender but shy. My heart ached for more." },
  { "stage": 2, "path": "corruption", "text": "He pressed his filthy lips on mine and shoved his tongue past my teeth. I whimpered, hating how good it felt." },
  { "stage": 2, "path": "hybrid",     "text": "He kissed me with filth and I kissed him with care. Somehow it felt whole." },

  { "stage": 3, "path": "love",       "text": "His lips lingered against mine like a vow. I held him there, wanting it never to end." },
  { "stage": 3, "path": "corruption", "text": "He sucked on my bottom lip until it hurt, spit slicking my chin. I moaned instead of pushing him away." },
  { "stage": 3, "path": "hybrid",     "text": "We traded bites and kisses. Shame and thrill knotted together on our tongues." },

  { "stage": 4, "path": "love",       "text": "He kissed me like I was precious. For once, I forgot the dirt." },
  { "stage": 4, "path": "corruption", "text": "He claimed my mouth like it belonged to him. My body shuddered as his tongue explored every corner." },
  { "stage": 4, "path": "hybrid",     "text": "I kissed him back, grime and all, as though filth and tenderness could coexist." },

  { "stage": 5, "path": "love",       "text": "We melted into each other, lips pressing, sighs shared. It felt like love written in touch." },
  { "stage": 5, "path": "corruption", "text": "He pinned me, mouth crushing mine, his spit marking me as his. I moaned into his tongue." },
  { "stage": 5, "path": "hybrid",     "text": "His filthy lips, my gentle kisses—we made it our own rhythm, both sweet and wrong." },

  { "stage": 6, "path": "love",       "text": "He kissed me slow, lips mapping devotion across my face." },
  { "stage": 6, "path": "corruption", "text": "He tongued me deep until drool spilled. I didn’t care who saw me panting like that." },
  { "stage": 6, "path": "hybrid",     "text": "I kissed him softly, he kissed me filthy. It blended into something I couldn’t name but craved." },

  { "stage": 7, "path": "love",       "text": "He kissed me like prayer, each touch worshipful. I felt holy in his arms." },
  { "stage": 7, "path": "corruption", "text": "He shoved his tongue deep, spit dripping down my chin. I moaned like a whore and begged for more." },
  { "stage": 7, "path": "hybrid",     "text": "He bit and licked my lips. Pain and pleasure blurred—I didn’t want him to stop." },

  { "stage": 8, "path": "love",       "text": "We kissed beneath the stars, soft and endless. His lips felt like forever." },
  { "stage": 8, "path": "corruption", "text": "He kissed me until my mouth was raw, tongue forcing deeper, spit and moans echoing in the night." },
  { "stage": 8, "path": "hybrid",     "text": "We tangled tongues in messy lust, filth and affection dripping together." },

  { "stage": 9, "path": "love",       "text": "Every kiss was a vow—I wanted his lips for every day to come." },
  { "stage": 9, "path": "corruption", "text": "His dirty mouth owned mine, rough, sloppy, making me whimper as spit leaked between us." },
  { "stage": 9, "path": "hybrid",     "text": "I kissed him back harder, craving both the filth and the tenderness. It was ours." },

  { "stage": 10, "path": "love",       "text": "We devoured each other with lips and tongues, hearts pounding—love expressed in ruinous bliss." },
  { "stage": 10, "path": "corruption", "text": "He forced his tongue down my throat until I gagged, spit dripping everywhere. I moaned louder, addicted to his filth." },
  { "stage": 10, "path": "hybrid",     "text": "We kissed until we were drenched, spit and lust smeared across our mouths. It was dirty, it was tender, it was everything." }
],
"erotic_nipples": [
  { "stage": 0, "path": "love",       "text": "He brushed against me by accident, his arm grazing my chest. I blushed and quickly turned away." },
  { "stage": 0, "path": "corruption", "text": "His rough hand lingered too long near my chest. I slapped it away, but his smirk stayed with me." },
  { "stage": 0, "path": "hybrid",     "text": "He teased me playfully, tugging my scarf low enough to make me flustered, yet I didn’t stop him." },

  { "stage": 1, "path": "love",       "text": "He brushed a finger along my collarbone, pausing as if unsure. My heart raced faster than my breath." },
  { "stage": 1, "path": "corruption", "text": "He pinched lightly through my clothes, making me squeak. I should’ve scolded him harder." },
  { "stage": 1, "path": "hybrid",     "text": "He grazed my chest with rough fingers, my body stiffened but my lips betrayed me with a smile." },

  { "stage": 2, "path": "love",       "text": "He pressed closer, his chest brushing mine. A shiver shot through me though I said nothing." },
  { "stage": 2, "path": "corruption", "text": "His thumb circled over the thin fabric—taunting, daring me to react. I felt my resolve weaken." },
  { "stage": 2, "path": "hybrid",     "text": "He teased roughly, then soothed with a soft touch. It made me crave both at once." },

  { "stage": 3, "path": "love",       "text": "His lips pressed softly against me, tender and unsure. I bit my lip, torn between innocence and desire." },
  { "stage": 3, "path": "corruption", "text": "He tugged my top down and latched on greedily. I gasped—ashamed, aroused, trembling." },
  { "stage": 3, "path": "hybrid",     "text": "He teased and then sucked hard, leaving marks. I laughed, then moaned, unsure which I wanted more." },

  { "stage": 4, "path": "love",       "text": "He kissed gently, like he wanted to worship me. My whole body melted into his warmth." },
  { "stage": 4, "path": "corruption", "text": "He bit down hard enough to sting. My cry twisted into a moan as he pulled away smirking." },
  { "stage": 4, "path": "hybrid",     "text": "His mouth was rough, then soft again, like punishment and reward mixed together." },

  { "stage": 5, "path": "love",       "text": "He nursed at me with such care I felt like I was glowing, like he was drinking my affection itself." },
  { "stage": 5, "path": "corruption", "text": "He twisted and pulled shamelessly, groaning as if owning me. The pain made me wetter." },
  { "stage": 5, "path": "hybrid",     "text": "He played with me until I moaned, half from hurt, half from joy. I couldn’t tell which I wanted more." },

  { "stage": 6, "path": "love",       "text": "He pressed his lips in worship, whispering that I was beautiful. I wanted him to never stop." },
  { "stage": 6, "path": "corruption", "text": "He tugged my nipples hard while I whimpered, calling me his toy. My shame only made me hotter." },
  { "stage": 6, "path": "hybrid",     "text": "He licked and bit, coaxing me between bliss and pain, until I gave up resisting entirely." },

  { "stage": 7, "path": "love",       "text": "He sucked and kissed me lovingly, pausing only to gaze at me with eyes that said 'mine'." },
  { "stage": 7, "path": "corruption", "text": "He smacked and tugged until my body shook. My cries turned into begging before I even knew it." },
  { "stage": 7, "path": "hybrid",     "text": "He punished me with his mouth, then soothed me with his tongue, forcing me to crave the cycle." },

  { "stage": 8, "path": "love",       "text": "He lavished me with long kisses and suckles, coaxing moans that felt shameless but sacred." },
  { "stage": 8, "path": "corruption", "text": "He pulled my nipples until I squirted. My mind screamed no, but my body betrayed me completely." },
  { "stage": 8, "path": "hybrid",     "text": "He left me raw, swollen, and desperate—then kissed me sweetly as if it were all love." },

  { "stage": 9, "path": "love",       "text": "He nuzzled me with such devotion it felt like worship. I arched into him, gasping for more." },
  { "stage": 9, "path": "corruption", "text": "He growled as he mauled my chest, spitting filth and calling me his slut. I screamed yes." },
  { "stage": 9, "path": "hybrid",     "text": "He growled filth into my ear while licking me soft. I trembled in lust and love alike." },

  { "stage": 10, "path": "love",       "text": "He took his time, suckling until I sobbed from the intensity, whispering I was his forever." },
  { "stage": 10, "path": "corruption", "text": "He latched on like an animal, twisting, sucking, drooling, until milk or not, I felt utterly bred." },
  { "stage": 10, "path": "hybrid",     "text": "He abused me, then kissed me tender, my nipples red and wet, my heart torn between shame and bliss." }
],
"erotic_ass": [
  { "stage": 0, "path": "love",       "text": "He brushed my hip lightly, an accident maybe, but it left me flustered." },
  { "stage": 0, "path": "corruption", "text": "He slapped my rear suddenly. I yelped, but his grin made me blush despite myself." },
  { "stage": 0, "path": "hybrid",     "text": "He leaned close, whispering something crude while letting his hand rest too low. I didn’t pull away." },

  { "stage": 1, "path": "love",       "text": "He rested a gentle hand at the small of my back, guiding me closer. I didn’t mind the touch." },
  { "stage": 1, "path": "corruption", "text": "He squeezed my ass through my skirt. I gasped in shock, but my body tingled traitorously." },
  { "stage": 1, "path": "hybrid",     "text": "He teased me with soft pats that quickly turned into firm squeezes. I pretended to protest." },

  { "stage": 2, "path": "love",       "text": "He held me from behind, his hand brushing lower than it should. I pressed into him anyway." },
  { "stage": 2, "path": "corruption", "text": "He grabbed me shamelessly, fingers digging in, making me squeal. His roughness thrilled me." },
  { "stage": 2, "path": "hybrid",     "text": "He cupped and squeezed, sometimes gentle, sometimes brutal, leaving me breathless either way." },

  { "stage": 3, "path": "love",       "text": "He kissed my lower back while his hands lingered on my hips. I trembled but leaned closer." },
  { "stage": 3, "path": "corruption", "text": "He spread my cheeks roughly, smirking at how exposed I was. My shame only made me hotter." },
  { "stage": 3, "path": "hybrid",     "text": "He alternated between soft kisses and hard squeezes, confusing me with pleasure and humiliation." },

  { "stage": 4, "path": "love",       "text": "He nuzzled against me, his hands roaming, but there was tenderness in every squeeze." },
  { "stage": 4, "path": "corruption", "text": "He bit my ass hard enough to leave marks, laughing when I gasped and whimpered." },
  { "stage": 4, "path": "hybrid",     "text": "He kissed softly, then spanked me hard. The mix left me shivering in lust and confusion." },

  { "stage": 5, "path": "love",       "text": "He traced soft circles over me, his lips brushing where his hands had lingered. I melted." },
  { "stage": 5, "path": "corruption", "text": "He smacked me over and over until I moaned instead of protesting. My body betrayed me." },
  { "stage": 5, "path": "hybrid",     "text": "He groped and spanked, then soothed the sting with kisses. I craved both." },

  { "stage": 6, "path": "love",       "text": "He held me close, his palms warm and reassuring on my curves, whispering that I was beautiful." },
  { "stage": 6, "path": "corruption", "text": "He forced my hips back against him, growling as he claimed me with every squeeze." },
  { "stage": 6, "path": "hybrid",     "text": "He spanked, then stroked, turning my cries into moans. Shame and bliss mingled inside me." },

  { "stage": 7, "path": "love",       "text": "He pressed tender kisses across my skin, holding me steady as my knees weakened." },
  { "stage": 7, "path": "corruption", "text": "He spread me open roughly and spat crude words, groaning as I shivered under his control." },
  { "stage": 7, "path": "hybrid",     "text": "He smacked me raw, then soothed me with soft lips. My body begged for both extremes." },

  { "stage": 8, "path": "love",       "text": "He kissed every inch of me, tender and reverent, leaving me feeling cherished despite my shame." },
  { "stage": 8, "path": "corruption", "text": "He rammed into me from behind, each thrust slapping flesh to flesh. I squealed in ecstasy, juices running down my thighs." },
  { "stage": 8, "path": "hybrid",     "text": "He spanked me until I burned, then slid inside with rough passion. I screamed and clung to him." },

  { "stage": 9, "path": "love",       "text": "He kissed my spine while filling me, whispering devotion into my skin. I cried with bliss." },
  { "stage": 9, "path": "corruption", "text": "He mauled my ass, pounding like an animal while calling me his breeding hole. My body squirted without control." },
  { "stage": 9, "path": "hybrid",     "text": "He filled me roughly, then soothed me with tender kisses. My body worshipped both pain and love." },

  { "stage": 10, "path": "love",       "text": "He worshipped my ass with lips, hands, and devotion, making me climax again and again." },
  { "stage": 10, "path": "corruption", "text": "He pinned me down, spreading me wide, thrusting until I screamed his name. His seed spilled deep, marking me forever." },
  { "stage": 10, "path": "hybrid",     "text": "He used me with filthy words and brutal thrusts, then kissed me tenderly as my juices dripped down my legs. I belonged to him completely." }
],
"erotic_caress": [
  { "stage": 0, "path": "love",       "text": "His hand brushed mine, lingering longer than it should. My cheeks burned, but I didn’t pull away." },
  { "stage": 0, "path": "corruption", "text": "He stroked my thigh casually, like he already owned me. I froze, my body betraying me with a shiver." },
  { "stage": 0, "path": "hybrid",     "text": "His fingers hovered over my arm, never quite touching, but the anticipation left me trembling." },

  { "stage": 1, "path": "love",       "text": "His palm rested against my cheek, rough but gentle. I leaned into it despite the dirt." },
  { "stage": 1, "path": "corruption", "text": "He let his hand wander lower, stroking where no one else dared. My gasp made him smirk." },
  { "stage": 1, "path": "hybrid",     "text": "He caressed me with one hand and squeezed me with the other, tender and crude all at once." },

  { "stage": 2, "path": "love",       "text": "His thumb traced my lips as though memorizing them. My heart stuttered under his gaze." },
  { "stage": 2, "path": "corruption", "text": "He dragged his fingers across my chest brazenly, leaving heat and shame in their wake." },
  { "stage": 2, "path": "hybrid",     "text": "He stroked my cheek and slid lower, alternating between tenderness and possession." },

  { "stage": 3, "path": "love",       "text": "He cradled me against him, his touch grounding me. For a moment I forgot the world outside." },
  { "stage": 3, "path": "corruption", "text": "His hand slid boldly under my clothes, fingertips grazing skin I swore I’d never reveal." },
  { "stage": 3, "path": "hybrid",     "text": "He stroked me like a lover, then grabbed like a thief. My body responded to both." },

  { "stage": 4, "path": "love",       "text": "He traced soft patterns on my arm and back, soothing me as though I was something precious." },
  { "stage": 4, "path": "corruption", "text": "He squeezed my breasts roughly, laughing when I moaned. Shame and heat fused inside me." },
  { "stage": 4, "path": "hybrid",     "text": "He switched between soft caresses and vulgar gropes, confusing me with pleasure and humiliation." },

  { "stage": 5, "path": "love",       "text": "He stroked my hair, kissed my temples, held me like I was fragile. I melted in his arms." },
  { "stage": 5, "path": "corruption", "text": "He gripped me from behind, hands exploring everywhere, ignoring my weak protests." },
  { "stage": 5, "path": "hybrid",     "text": "He pressed me against him, stroking gently one moment, groping hard the next. I craved both." },

  { "stage": 6, "path": "love",       "text": "He stroked every inch of me with patience, murmuring that he wanted to know my body fully." },
  { "stage": 6, "path": "corruption", "text": "His fingers slid between my folds without warning, slicking themselves shamelessly with my wetness." },
  { "stage": 6, "path": "hybrid",     "text": "He caressed me until I sighed, then thrust his fingers roughly inside. I moaned through the mix of care and cruelty." },

  { "stage": 7, "path": "love",       "text": "He mapped me with slow kisses and strokes, each caress worshipping me like I was holy." },
  { "stage": 7, "path": "corruption", "text": "He clawed and squeezed until bruises formed, groaning as I whimpered beneath his grip." },
  { "stage": 7, "path": "hybrid",     "text": "He alternated between worshipping my skin and using me like a toy. Both left me wet and trembling." },

  { "stage": 8, "path": "love",       "text": "His caresses turned desperate, like he couldn’t get enough of touching me, whispering my name with every stroke." },
  { "stage": 8, "path": "corruption", "text": "He mauled my body, pinching, slapping, and groping until I squealed, juices dripping freely." },
  { "stage": 8, "path": "hybrid",     "text": "He rubbed me raw with one hand, soothed me with the other, forcing me to climax from both pain and pleasure." },

  { "stage": 9, "path": "love",       "text": "He stroked me with a reverence that broke me open, making me cry out his name through waves of bliss." },
  { "stage": 9, "path": "corruption", "text": "He spread me open roughly, fingers plunging in and out, groaning at the mess he made of me." },
  { "stage": 9, "path": "hybrid",     "text": "He alternated between tender caresses and brutal grabs, leaving my body quaking with release." },

  { "stage": 10, "path": "love",       "text": "His caresses became worship, mapping my entire body with love, every orgasm a prayer answered." },
  { "stage": 10, "path": "corruption", "text": "He ravaged me with his hands, fingering, slapping, squeezing until I screamed, squirting uncontrollably." },
  { "stage": 10, "path": "hybrid",     "text": "He treated me like both goddess and toy, caressing with devotion one second and ravaging with filth the next. I belonged to it all." }
],
"erotic_breasts": [
  { "stage": 0, "path": "love",       "text": "His gaze lingered on my chest too long. I crossed my arms, blushing, pretending not to notice." },
  { "stage": 0, "path": "corruption", "text": "He brushed against my chest as if by accident, smirking when I stiffened." },
  { "stage": 0, "path": "hybrid",     "text": "He stared openly, bold and shameless. I should’ve slapped him, but my lips curved instead." },

  { "stage": 1, "path": "love",       "text": "His hand rested lightly against my collarbone, warm and protective rather than possessive." },
  { "stage": 1, "path": "corruption", "text": "His palm cupped me through the fabric, rough and deliberate. I gasped but didn’t stop him." },
  { "stage": 1, "path": "hybrid",     "text": "He brushed over me slowly, then squeezed hard. My heart raced at the mix of comfort and control." },

  { "stage": 2, "path": "love",       "text": "His thumb traced the edge of my neckline, tender as though he feared to break me." },
  { "stage": 2, "path": "corruption", "text": "He tugged my top down carelessly, squeezing my breasts bare-handed. My cheeks burned, but I moaned." },
  { "stage": 2, "path": "hybrid",     "text": "He fondled me gently with one hand, pinched hard with the other. My body responded to both." },

  { "stage": 3, "path": "love",       "text": "His lips pressed to my chest reverently, a worship I wasn’t ready to admit I craved." },
  { "stage": 3, "path": "corruption", "text": "He bit down on my nipple through the cloth, sharp enough to make me squeal. His laugh was cruel." },
  { "stage": 3, "path": "hybrid",     "text": "He licked tender circles before biting hard enough to leave marks. I hated how wet it made me." },

  { "stage": 4, "path": "love",       "text": "He undressed me carefully, kissing each breast as if they deserved devotion." },
  { "stage": 4, "path": "corruption", "text": "He mauled my breasts roughly, slapping them together, laughing at my shameless moans." },
  { "stage": 4, "path": "hybrid",     "text": "He alternated between tender worship and lewd groping, breaking me down with contradictions." },

  { "stage": 5, "path": "love",       "text": "He nursed on me like a starving man, but every suck was filled with warmth, not greed." },
  { "stage": 5, "path": "corruption", "text": "He twisted my nipples brutally, pulling until I whimpered. My shame was dripping between my thighs." },
  { "stage": 5, "path": "hybrid",     "text": "He groped me shamelessly in public, then kissed them softly in private. I loved both." },

  { "stage": 6, "path": "love",       "text": "He pressed his face between my breasts, whispering that they were his sanctuary." },
  { "stage": 6, "path": "corruption", "text": "He spat on my chest, rubbing it into my nipples with greedy fingers as I moaned helplessly." },
  { "stage": 6, "path": "hybrid",     "text": "He toyed with my nipples roughly, then soothed them with tender licks. Pleasure blurred with humiliation." },

  { "stage": 7, "path": "love",       "text": "He massaged them slowly, lips sucking until I melted into his arms." },
  { "stage": 7, "path": "corruption", "text": "He used my breasts like toys, squeezing until bruises formed, moaning as I cried out in bliss." },
  { "stage": 7, "path": "hybrid",     "text": "He bit, sucked, and kissed until I was dripping, begging for more of his cruelty and care." },

  { "stage": 8, "path": "love",       "text": "He whispered that my breasts were perfect, worshipping them with lips and tongue until I lost myself." },
  { "stage": 8, "path": "corruption", "text": "He slapped my tits until they bounced, then sucked them greedily, drool and milk mixing down my skin." },
  { "stage": 8, "path": "hybrid",     "text": "He forced my tits together for his cock, groaning as he slid between them before kissing them tenderly after." },

  { "stage": 9, "path": "love",       "text": "He made love to my breasts as if they were sacred, every lick reverent, every squeeze tender." },
  { "stage": 9, "path": "corruption", "text": "He fucked my breasts brutally, coating me in filth, laughing when I begged for more." },
  { "stage": 9, "path": "hybrid",     "text": "He fucked my tits with shameless lust, then pulled me close and whispered, 'I love you.'" },

  { "stage": 10, "path": "love",       "text": "He kissed every inch of my chest like I was holy, worshipping me through climax." },
  { "stage": 10, "path": "corruption", "text": "He mauled my tits like a beast, drool, spit, and cum soaking me. I screamed as milk sprayed, surrendering completely." },
  { "stage": 10, "path": "hybrid",     "text": "He fucked my tits until I squirted down my thighs, then kissed my chest sweetly, making me his filthy goddess." }
],
"erotic_talking": [
  { "stage": 0, "path": "love",       "text": "I told him gently to stop teasing me. My voice trembled, but part of me wished he’d keep going." },
  { "stage": 0, "path": "corruption", "text": "He whispered filth in my ear, words I shouldn’t even know. I gasped, cheeks red, but listened all the same." },
  { "stage": 0, "path": "hybrid",     "text": "He teased me about being 'too pure for the slums.' I snapped back, pretending not to enjoy the way it made me blush." },

  { "stage": 1, "path": "love",       "text": "He called me 'beautiful.' I whispered back 'thank you,' barely above a breath." },
  { "stage": 1, "path": "corruption", "text": "He called me his 'little slut' under his breath. I should’ve slapped him, but my thighs pressed together." },
  { "stage": 1, "path": "hybrid",     "text": "He whispered something crude, then softened with 'but you’re mine.' My chest tightened at both." },

  { "stage": 2, "path": "love",       "text": "I whispered that I liked being near him. He grinned, and I blushed deeper." },
  { "stage": 2, "path": "corruption", "text": "He told me I was dripping for him, filthy and shameless. I denied it, though my body betrayed me." },
  { "stage": 2, "path": "hybrid",     "text": "He called me 'naughty' and kissed me tenderly after. I couldn’t decide what flustered me more." },

  { "stage": 3, "path": "love",       "text": "I told him he made me feel safe. His reply was a kiss against my hairline." },
  { "stage": 3, "path": "corruption", "text": "He forced me to say his name while he touched me. I moaned it louder than I intended." },
  { "stage": 3, "path": "hybrid",     "text": "I whispered 'don’t stop,' even as my face burned. He smirked, then kissed me deeper." },

  { "stage": 4, "path": "love",       "text": "I murmured 'I want this,' surprising even myself. He smiled, softer than usual." },
  { "stage": 4, "path": "corruption", "text": "He made me repeat, 'I’m yours to use.' The words made me shudder in shame and desire." },
  { "stage": 4, "path": "hybrid",     "text": "I gasped 'you’re ruining me,' only to feel him kiss my lips tenderly right after. Both ruined and cherished." },

  { "stage": 5, "path": "love",       "text": "I told him I loved him. He froze for a heartbeat, then kissed me fiercely." },
  { "stage": 5, "path": "corruption", "text": "He called me his 'fucktoy.' I repeated it back, blushing furiously as my hips bucked against him." },
  { "stage": 5, "path": "hybrid",     "text": "I confessed 'I love the way you use me,' before burying my face in his chest. His laugh was cruel, his touch tender." },

  { "stage": 6, "path": "love",       "text": "I whispered 'I want to stay with you forever,' my voice breaking with sincerity." },
  { "stage": 6, "path": "corruption", "text": "He made me beg for his cock, every filthy word spilling from my lips without shame." },
  { "stage": 6, "path": "hybrid",     "text": "I told him 'I want it rough… but only from you.' His smirk sent chills down me." },

  { "stage": 7, "path": "love",       "text": "I cried out his name like a prayer, every syllable filled with devotion." },
  { "stage": 7, "path": "corruption", "text": "He ordered me to say I was his whore, and I screamed it, wet and wild, as if I believed it." },
  { "stage": 7, "path": "hybrid",     "text": "I moaned 'you own me,' then seconds later whispered, 'I love you.' Both truths tangled together." },

  { "stage": 8, "path": "love",       "text": "I begged him to never let me go, confessing my body was only alive when he touched me." },
  { "stage": 8, "path": "corruption", "text": "I screamed obscenities at the height of climax, calling myself his breeding bitch, his slut, his hole." },
  { "stage": 8, "path": "hybrid",     "text": "I whispered 'fuck me, love me, ruin me,' all at once. His response was both tender and brutal." },

  { "stage": 9, "path": "love",       "text": "I whispered into his ear, 'I want your child.' My voice was filled with desperate devotion." },
  { "stage": 9, "path": "corruption", "text": "I begged, 'Breed me. Fill me. Make me yours forever,' drool slipping from my lips as I choked out the words." },
  { "stage": 9, "path": "hybrid",     "text": "I moaned 'Make me your wife, your slut, your everything,' as his thrusts stole my breath." },

  { "stage": 10, "path": "love",       "text": "I cried out, 'I love you, I love you,' with every shuddering climax, shameless and true." },
  { "stage": 10, "path": "corruption", "text": "I screamed, 'Fuck my pussy, ruin my body, make me your cumdump!' The words made me gush harder than ever before." },
  { "stage": 10, "path": "hybrid",     "text": "I moaned 'I love being your slut,' before gasping 'I love you' in the same breath. His cock silenced me with truth." }
],
"erotic_mouth": [
  { "stage": 0, "path": "love",       "text": "He kissed my cheek so suddenly. I laughed nervously, but part of me wished he hadn’t stopped there." },
  { "stage": 0, "path": "corruption", "text": "He pressed his lips against mine, unwashed and rough. I recoiled, but the heat lingered against my mouth." },
  { "stage": 0, "path": "hybrid",     "text": "His lips brushed mine. I gasped and pulled away, but my fingers stayed on his sleeve." },

  { "stage": 1, "path": "love",       "text": "He kissed me softly, almost like he was afraid I’d break. My heart fluttered too much to pull back." },
  { "stage": 1, "path": "corruption", "text": "His tongue forced into my mouth, tasting of ash and dirt. I gagged… but then melted against him." },
  { "stage": 1, "path": "hybrid",     "text": "He kissed me hard, then gentle. I couldn’t decide which part made me ache more." },

  { "stage": 2, "path": "love",       "text": "Our mouths met again and again, and I realized I didn’t want to count anymore." },
  { "stage": 2, "path": "corruption", "text": "He shoved his tongue between my lips, claiming me. I moaned shamefully into his mouth." },
  { "stage": 2, "path": "hybrid",     "text": "He bit my lower lip, then soothed it with a soft kiss. I trembled, craving both." },

  { "stage": 3, "path": "love",       "text": "I leaned into his kiss, hands trembling on his chest, savoring the warmth even through the grime." },
  { "stage": 3, "path": "corruption", "text": "He made me open my mouth wide for him, tongue exploring as if he owned it. My knees buckled." },
  { "stage": 3, "path": "hybrid",     "text": "He kissed me like he wanted to devour me, then whispered 'mine.' I whispered 'yours' back." },

  { "stage": 4, "path": "love",       "text": "We kissed until the world blurred. I forgot the filth, the danger—there was only us." },
  { "stage": 4, "path": "corruption", "text": "His spit filled my mouth as our tongues tangled. I swallowed, shamefully eager for more." },
  { "stage": 4, "path": "hybrid",     "text": "We kissed until I was dizzy, his roughness bruising my lips, his tenderness undoing me." },

  { "stage": 5, "path": "love",       "text": "He kissed me with such need that I nearly wept. My lips ached, my heart did too." },
  { "stage": 5, "path": "corruption", "text": "He shoved his fingers in my mouth, making me suck them. I moaned around the taste of salt and dirt." },
  { "stage": 5, "path": "hybrid",     "text": "I begged him to kiss me deeper, filth and all, and he obeyed with a smirk." },

  { "stage": 6, "path": "love",       "text": "He kissed me awake this morning. My lips still tingled all day." },
  { "stage": 6, "path": "corruption", "text": "He spat in my mouth mid-kiss. I gagged… and then begged for another." },
  { "stage": 6, "path": "hybrid",     "text": "He kissed me until I was gasping, drool stringing between us. I didn’t care how filthy it looked." },

  { "stage": 7, "path": "love",       "text": "We kissed under the stars until I forgot who I was without him." },
  { "stage": 7, "path": "corruption", "text": "He forced my head back and tongue-fucked me until I moaned like a slut. I wanted more." },
  { "stage": 7, "path": "hybrid",     "text": "He kissed me hard, spit dripping between our mouths, and I whispered 'I love you' through the mess." },

  { "stage": 8, "path": "love",       "text": "Our kisses turned frantic, desperate, like we couldn’t survive without the other’s lips." },
  { "stage": 8, "path": "corruption", "text": "He used my mouth like a hole, forcing his spit, his tongue, his taste until I was drooling and moaning shamelessly." },
  { "stage": 8, "path": "hybrid",     "text": "I begged him to ruin my mouth with kisses and filth, but also to hold me after. He did both." },

  { "stage": 9, "path": "love",       "text": "I whispered 'kiss me forever.' He did, until I could barely breathe." },
  { "stage": 9, "path": "corruption", "text": "He shoved his cock against my lips, growling until I opened. His taste and smell filled me, and I moaned around it." },
  { "stage": 9, "path": "hybrid",     "text": "He fucked my mouth with his tongue, then kissed me tender after. Both ruined me, both thrilled me." },

  { "stage": 10, "path": "love",       "text": "I kissed him like a prayer, begging for more, my lips swollen and wet with devotion." },
  { "stage": 10, "path": "corruption", "text": "I screamed for more spit, more tongue, more filth. My mouth was his hole, and I loved it." },
  { "stage": 10, "path": "hybrid",     "text": "I moaned 'fuck my mouth, love my lips,' drool dripping down my chin as I clung to him." }
],
"erotic_vaginal": [
  { "stage": 0, "path": "love",       "text": "He pressed against me, and I froze. I whispered 'not yet' and he actually listened." },
  { "stage": 0, "path": "corruption", "text": "His hand pushed between my thighs. I clenched them shut, breath shaking. He only grinned." },
  { "stage": 0, "path": "hybrid",     "text": "I felt him press close, dirty and insistent. I turned away, but the ache lingered." },

  { "stage": 1, "path": "love",       "text": "He brushed against me through cloth. It made me blush and press my knees tighter together." },
  { "stage": 1, "path": "corruption", "text": "He forced my legs apart with his knee. I gasped and whimpered, but he didn’t stop." },
  { "stage": 1, "path": "hybrid",     "text": "He rubbed me through my skirt, rough and teasing. I moaned before I could stop myself." },

  { "stage": 2, "path": "love",       "text": "He slid just barely inside, careful, waiting for me to breathe yes. My heart pounded louder than my voice." },
  { "stage": 2, "path": "corruption", "text": "He shoved inside me without warning. It burned, it hurt—my cry only made him smile." },
  { "stage": 2, "path": "hybrid",     "text": "He entered me suddenly. I cursed and clutched him, torn between shame and pleasure." },

  { "stage": 3, "path": "love",       "text": "It hurt, but his touch soothed me, his kisses grounding me as he moved slow." },
  { "stage": 3, "path": "corruption", "text": "He rammed into me, using me rough. The sting blurred into a heat that made me moan despite myself." },
  { "stage": 3, "path": "hybrid",     "text": "He was merciless and then gentle, thrusting me open, then kissing my tears away. I let him do both." },

  { "stage": 4, "path": "love",       "text": "We moved together clumsily, learning each other’s rhythm. His gaze stayed locked on mine." },
  { "stage": 4, "path": "corruption", "text": "He pinned me down and pumped until my cries broke. My body betrayed me with wetness dripping down my thighs." },
  { "stage": 4, "path": "hybrid",     "text": "His cock split me wide, rough and sweet. I clung to him, torn between bliss and guilt." },

  { "stage": 5, "path": "love",       "text": "He groaned my name into my neck. Each thrust carried need but also care. I melted into it." },
  { "stage": 5, "path": "corruption", "text": "He slammed me raw, juices splattering. I squealed shamelessly, my body begging for more abuse." },
  { "stage": 5, "path": "hybrid",     "text": "I begged him to go harder, then cried when he did. My shame turned to hunger in the same breath." },

  { "stage": 6, "path": "love",       "text": "He stretched me slowly, whispering 'breathe, flower.' The gentleness made me cry softly." },
  { "stage": 6, "path": "corruption", "text": "He plugged me full, thrusting like an animal. My juices dripped, soaking the ground beneath us." },
  { "stage": 6, "path": "hybrid",     "text": "He alternated tenderness and filth, kissing me sweetly as his cock bruised my insides." },

  { "stage": 7, "path": "love",       "text": "He held me close, our hips rocking until I came with a broken moan against his shoulder." },
  { "stage": 7, "path": "corruption", "text": "He used my pussy like a hole, fucking me until I screamed. My legs quivered, juices pouring freely." },
  { "stage": 7, "path": "hybrid",     "text": "I clutched him as he thrust wild, loving the filth and the sweetness tangled together." },

  { "stage": 8, "path": "love",       "text": "We made love feverishly, desperate and messy. I cried his name as release shook me apart." },
  { "stage": 8, "path": "corruption", "text": "He jackhammered into me, cock slamming deep. My pussy gushed uncontrollably, soaking his filthy skin." },
  { "stage": 8, "path": "hybrid",     "text": "He filled me over and over, tender words mixed with filthy growls. I moaned shamelessly for both." },

  { "stage": 9, "path": "love",       "text": "He worshipped my body with every thrust, our cries blending into something sacred." },
  { "stage": 9, "path": "corruption", "text": "He fucked me raw until my pussy screamed. His cum flooded me, dripping endlessly down my thighs." },
  { "stage": 9, "path": "hybrid",     "text": "He took me like I was his slut and his bride both. I begged for his seed, for his love, for more filth." },

  { "stage": 10, "path": "love",       "text": "We became one, his cock filling me as I screamed his name. My heart swore it would never want another." },
  { "stage": 10, "path": "corruption", "text": "My breeding hole was his to own—he fucked me until my womb overflowed with his seed. I squealed, drooled, begged for more." },
  { "stage": 10, "path": "hybrid",     "text": "I begged him to ruin me, to fill me with love and filth both. My pussy gushed as I screamed for his cock, for his seed, for everything he is." }
]
},
"pregnancy_discovery": [
  { "key": "missed_cycle", "stageMin": 0, "path": "any", "text": "I was late this month. I told myself it was nothing, but the thought kept me awake all night." },
  { "key": "first_twinge", "stageMin": 1, "path": "love", "text": "I felt a strange flutter in my belly today. Could it be? My heart leapt and trembled all at once." },
  { "key": "first_twinge_corr", "stageMin": 1, "path": "corruption", "text": "My stomach twisted, not from food. A filthy thought hit me—did his seed take root already? The idea made me shiver in ways I shouldn’t admit." },
  { "key": "first_twinge_hyb", "stageMin": 1, "path": "hybrid", "text": "Something feels different inside me. I should be afraid, but instead I feel a secret thrill… as if his mark is growing." },

  { "key": "secret_test", "stageMin": 2, "path": "love", "text": "I picked up herbs to test quietly at home. When the leaves changed color, I almost dropped them. I wanted to laugh and cry together." },
  { "key": "secret_test_corr", "stageMin": 2, "path": "corruption", "text": "I checked with trembling hands. When the sign appeared, I didn’t scream. I… smiled. My body is his now, in the deepest way possible." },
  { "key": "secret_test_hyb", "stageMin": 2, "path": "hybrid", "text": "The moment the test showed the truth, my chest filled with both dread and heat. His life inside me—sinful and sacred at once." },

  { "key": "mirror_confession", "stageMin": 3, "path": "love", "text": "I stood in front of the mirror, whispering to my reflection: 'You’re carrying his child.' My hand trembled, then held steady." },
  { "key": "mirror_confession_corr", "stageMin": 3, "path": "corruption", "text": "I stared at my belly in the mirror, imagining it swelling with his child. A filthy grin spread across my lips before I could stop it." },
  { "key": "mirror_confession_hyb", "stageMin": 3, "path": "hybrid", "text": "I pressed my palm against my stomach. My heart whispered 'love,' my body whispered 'desire.' Both truths burned into me." }
],
"pregnancy_body_changes": [
  { "key": "morning_sickness", "stageMin": 2, "path": "any", "text": "The mornings are cruel. My stomach rebels, yet beneath the weakness there’s a strange pride." },

  { "key": "growing_belly_love", "stageMin": 3, "path": "love", "text": "My dress tightens around me now. When I catch the curve in the mirror, I smile—his child, our future." },
  { "key": "growing_belly_corr", "stageMin": 3, "path": "corruption", "text": "The swell of my stomach is obvious. People whisper. I walk taller, daring them to see what he’s planted in me." },
  { "key": "growing_belly_hyb", "stageMin": 3, "path": "hybrid", "text": "I trace the outline of my belly with guilty delight—life growing, desire burning. Both truths live inside me now." },

  { "key": "first_kick_love", "stageMin": 4, "path": "love", "text": "I felt a flutter tonight. A kick—tiny, gentle. I pressed his hand there and we both froze, hearts in our throats." },
  { "key": "first_kick_corr", "stageMin": 4, "path": "corruption", "text": "The first kick stole my breath. I laughed, shameless, declaring to myself: his seed truly thrives in me." },
  { "key": "first_kick_hyb", "stageMin": 4, "path": "hybrid", "text": "The baby stirred, and instead of tears, I felt heat. Desire and life, tangled. Even my womb is caught between the two." },

  { "key": "backache", "stageMin": 5, "path": "any", "text": "My back aches carrying the weight. Still, every pang is a reminder: I am no longer just me." },

  { "key": "public_notice_love", "stageMin": 5, "path": "love", "text": "The neighbors noticed. Their smiles warmed me. I blushed, proud to show the world his child." },
  { "key": "public_notice_corr", "stageMin": 5, "path": "corruption", "text": "Whispers follow me now, sharper than knives. I smirk back at them. Let them choke on their disgust—I carry his mark proudly." },
  { "key": "public_notice_hyb", "stageMin": 5, "path": "hybrid", "text": "People glance, whisper. Half of me shrinks, the other half secretly thrills at being seen this way." },

  { "key": "heavy_waddle", "stageMin": 6, "path": "any", "text": "Walking feels heavier each day, like the world tips forward with me. Still, I wouldn’t trade this burden." }
],
"pregnancy_late": [
  { "key": "heaviness", "stageMin": 7, "path": "any", "text": "Every step is a chore. My belly is taut, stretched, and yet—every ache reminds me I carry him with me." },

  { "key": "cravings_love", "stageMin": 7, "path": "love", "text": "I craved honey water until he fetched it for me. He grumbled, but his hands brushed my belly tenderly when he gave it over." },
  { "key": "cravings_corr", "stageMin": 7, "path": "corruption", "text": "Cravings gnaw at me, sometimes for food, sometimes for him. I confessed the second, shameless, and he only laughed." },
  { "key": "cravings_hyb", "stageMin": 7, "path": "hybrid", "text": "I demanded sweets and kisses in the same breath. He called me greedy; I only smiled." },

  { "key": "sleepless_love", "stageMin": 8, "path": "love", "text": "The baby kicks at night. He wraps his arms around me, holding me steady until I sleep again." },
  { "key": "sleepless_corr", "stageMin": 8, "path": "corruption", "text": "Sleepless, I paced. He pulled me into his lap, filthy and rough, until exhaustion stole me. I didn’t resist." },
  { "key": "sleepless_hyb", "stageMin": 8, "path": "hybrid", "text": "Kicks rattled me awake. He pressed his hand there, whispered something obscene, and I flushed instead of scolding him." },

  { "key": "public_display", "stageMin": 8, "path": "any", "text": "Strangers look at me with awe, pity, or disgust. I hold my belly proudly. This life inside me is undeniable." },

  { "key": "false_labor_love", "stageMin": 9, "path": "love", "text": "The pains came sudden. He panicked, I laughed, telling him it wasn’t time yet. Still, the worry in his eyes softened me." },
  { "key": "false_labor_corr", "stageMin": 9, "path": "corruption", "text": "Pain shot through me. He smirked and called it my punishment for begging for his seed. Shame twisted into need all over again." },
  { "key": "false_labor_hyb", "stageMin": 9, "path": "hybrid", "text": "The contractions faded. I should’ve felt relief—but instead, I found myself disappointed. I wanted to give him proof of his hold on me." }
],
"pregnancy_birth": [
  { "key": "labor_love", "stageMin": 10, "path": "love", "text": "The pain was fire, the world a blur. Yet when I clutched his hand, I felt safe. He kissed my hair and told me I was strong. When the baby’s cry filled the air, I wept—because I knew we had made life out of something the world swore would fail." },

  { "key": "labor_corruption", "stageMin": 10, "path": "corruption", "text": "Agony tore me apart, sweat and filth mixing until I felt more animal than woman. He leaned over me, smirking as I screamed, whispering: 'Bear my child, let everyone see you’re mine.' And when I finally pushed our spawn into the world, I laughed—hysterical, proud, ruined, his." },

  { "key": "labor_hybrid", "stageMin": 10, "path": "hybrid", "text": "It was agony and ecstasy, blood and beauty. His rough hand gripped mine, unwashed, grounding me. I hated him, I loved him, I wanted more of him even as my body split. When our child cried, I pressed it to my chest and whispered: 'Born of dirt and devotion, you are ours.'" },

  { "key": "aftercare_love", "stageMin": 10, "path": "love", "text": "Exhausted, I felt his arms wrap around me and our child. He smelled like sweat and smoke, but I didn’t care. For once, the world could burn—we had our family." },

  { "key": "aftercare_corruption", "stageMin": 10, "path": "corruption", "text": "I was broken open, ruined, bleeding, still trembling when he touched me again—claiming me even as I nursed. His filthy hands smeared across my skin, marking me as his breeding sow. And I wanted more." },

  { "key": "aftercare_hybrid", "stageMin": 10, "path": "hybrid", "text": "I laughed and cried at once, clutching him and our child. His kiss tasted of dirt and sin. I let it linger, let it stain this perfect moment, because nothing else could be so perfectly us." }
],
"pregnancy_erotic": {
  "love": [
    { "stageMin": 4, "text": "He kissed my belly first, whispering love into the life growing inside me before making love to me gently. Every movement was a promise." },
    { "stageMin": 5, "text": "My breasts ache and swell, but in his hands, even that pain turns to warmth. He worships every curve the baby gives me." },
    { "stageMin": 7, "text": "When he moved inside me, I felt our child press between us. Instead of shame, I felt whole—two loves joined in one rhythm." },
    { "stageMin": 9, "text": "He whispered he wanted me again, even swollen, even heavy. I cried from the tenderness, clinging to him like I’d never let go." },
    { "stageMin": 10, "text": "Even with my body stretched and full, he made me feel adored. I wanted every kiss, every thrust, to be proof our love was real and lasting." }
  ],
  "corruption": [
    { "stageMin": 4, "text": "His laugh rumbled against my belly as he thrust in, saying he owned me now—me and the child inside. I couldn’t stop shivering." },
    { "stageMin": 6, "text": "Juices dripped down my thighs as he took me from behind, one hand gripping my belly possessively. The filth of it only made me hotter." },
    { "stageMin": 8, "text": "He snarled that my breeding hole would never rest, swollen or not. My cries echoed in the slums, but I never told him to stop." },
    { "stageMin": 9, "text": "Pinned on my back, belly rising between us, he forced my legs apart until my juices soaked the sheets. I begged for more even as I ached." },
    { "stageMin": 10, "text": "His seed leaked from me while his hand pressed the swell of my womb down. I screamed his name, proud to be nothing but his pregnant whore." }
  ],
  "hybrid": [
    { "stageMin": 4, "text": "He teased me, saying I was more beautiful swollen. I blushed, scolding him, but I parted my legs anyway." },
    { "stageMin": 5, "text": "We rocked slowly together, his lips on mine, my belly pressing into his chest. Tender and dirty all at once." },
    { "stageMin": 7, "text": "He gripped my hips and whispered I was both his angel and his broodmare. I should have resisted, but the words thrilled me." },
    { "stageMin": 8, "text": "We kissed hungrily while he filled me, his hand cupping my belly like a trophy. I both shivered at the shame and melted in the love." },
    { "stageMin": 10, "text": "The world could see me as ruined, swollen, claimed. But in his arms I felt radiant—his filth and tenderness woven into one." }
  ]
},
"risky_play": {
  "public": {
  "love": [
    { "stageMin": 0, "text": "He brushed my hand in the street. I pulled away quickly—th-that wasn’t proper… but my cheeks still warmed." },
    { "stageMin": 1, "text": "His lips grazed my ear in the marketplace. I whispered, 'S-stop… people will see,' but I didn’t really want him to." },
    { "stageMin": 2, "text": "In the square, his arm slipped around me. I pretended to scold him, but my heart was pounding so hard I thought others could hear it." },
    { "stageMin": 3, "text": "He stole a kiss in the alley. M-my lips trembled—why didn’t I resist longer? O-oh… because I wanted more." },
    { "stageMin": 4, "text": "We stood in line at the inn. His hand lingered lower than it should. I froze, whispering, 'N-not here…!' but I didn’t make him stop." },
    { "stageMin": 5, "text": "On the church steps, his mouth crushed mine. I moaned softly before I could stop myself—did someone hear?" },
    { "stageMin": 6, "text": "He pressed me into the tavern wall, his body grinding against mine. I gasped, 'P-people… watching,' even as my hips moved on their own." },
    { "stageMin": 7, "text": "At the market stall, his fingers teased the hem of my skirt. 'D-don’t,' I begged, voice shaking, while my thighs squeezed tight around nothing." },
    { "stageMin": 8, "text": "He whispered filth into my ear in the square. 'Ohh… d-don’t say that,' I whimpered, feeling heat pool between my legs while families walked past." },
    { "stageMin": 9, "text": "In the festival crowd, his fingers slid under my dress. I bit my lip so hard, trying not to cry out. O-o-oh gods, if they only knew what he was doing…" },
    { "stageMin": 10, "text": "He took me in the dark corner of the plaza, rutting into me while voices drifted nearby. I—ahhhnn!—I couldn’t stop moaning, even knowing they might hear. I wanted them to." }
  ],
  "corruption": [
    { "stageMin": 0, "text": "He slapped my ass in the crowd. I spun to glare at him—but my body… shivered." },
    { "stageMin": 1, "text": "At the tavern, he slid his hand over my thigh, loud enough for others to notice. I hissed, 'Y-you bastard…!' but my nipples hardened." },
    { "stageMin": 2, "text": "He shoved me into the alley, teeth biting my neck. 'S-stop,' I stammered, squirming… but gods, I was soaking." },
    { "stageMin": 3, "text": "In the square, he pressed against me, his cock stiff through his rags. I gasped—o-oh god—it brushed right where I needed it." },
    { "stageMin": 4, "text": "At the bar counter, his filthy hand slid up my skirt. I whispered, 'P-please, someone will see…!' but I tilted my hips for him." },
    { "stageMin": 5, "text": "He pinned me to a wall in front of the stables, rutting against me like an animal. My voice cracked—'N-no, not here!'—as my legs wrapped around him." },
    { "stageMin": 6, "text": "In the square, he whispered, 'Say you’re mine.' I gasped, 'N-no…!' then moaned loud enough for people to turn their heads." },
    { "stageMin": 7, "text": "His fingers pushed inside me in the market. I squealed, clapping my hand over my mouth, wetness dripping down my thighs." },
    { "stageMin": 8, "text": "He bent me over the cart, thrusting rough. My words came out broken—'Nnghh… p-people… watching…!'—while I begged for more." },
    { "stageMin": 9, "text": "He made me ride him behind the festival curtain. My juices dripped down his shaft, loud enough to hear. 'O-oh f-fuck…!' I whimpered shamelessly." },
    { "stageMin": 10, "text": "In the plaza’s shadows, he spread my pussy wide open. 'My b-breeding hole’s yours,' I moaned as his cock slammed into me, juices splattering while strangers passed close by." }
  ],
  "hybrid": [
    { "stageMin": 0, "text": "He leaned near, whispering in public. I laughed nervously, not sure if I liked it… but I didn’t walk away." },
    { "stageMin": 1, "text": "At dinner, his hand brushed my thigh. My words stumbled—I couldn’t focus on anything but his touch." },
    { "stageMin": 2, "text": "He kissed me behind the market stall. My lips trembled—'T-this isn’t right,' I whispered, kissing back harder." },
    { "stageMin": 3, "text": "In the park, he pressed close from behind. I stammered, 'S-stop… ahhh,' even as my body leaned into his." },
    { "stageMin": 4, "text": "He stroked me through my skirt in the library. 'D-don’t…!' I squeaked, hips twitching against his hand." },
    { "stageMin": 5, "text": "In the church shadows, he kissed me hard. My voice quivered—'O-oh… not here,' while I melted into him." },
    { "stageMin": 6, "text": "At the festival, his fingers teased my folds through cloth. 'O-ohhhnn…!' escaped before I could choke it down." },
    { "stageMin": 7, "text": "He touched me under the sheets with others nearby. I buried my face, muffling moans while my hips writhed helplessly." },
    { "stageMin": 8, "text": "In the alley, he made me grind against him. 'F-fuck… d-don’t stop,' I begged, shame and thrill tangled." },
    { "stageMin": 9, "text": "On the rooftop, his cock filled me. 'Ohh g-god—s-so deep!' I cried into the night, knowing we weren’t alone." },
    { "stageMin": 10, "text": "He fucked me in the lantern light of the festival. I came screaming, juices splattering down my thighs, no longer caring who saw." }
  ],
  "semi_public": {
  "love": [
    { "stageMin": 0, "text": "He brushed his lips over mine in the empty pews. I gasped, 'N-not in here,' even though my eyes fluttered shut." },
    { "stageMin": 1, "text": "In the library’s shadowed alcove, his hand lingered on mine. My heart thundered like someone might see us." },
    { "stageMin": 2, "text": "We hid behind the tavern’s door. He kissed me until my knees buckled—o-oh gods, if anyone walked past…" },
    { "stageMin": 3, "text": "He pinned me against the wagon in the stables. I moaned softly, clutching him tighter, whispering, 'D-don’t stop…'" },
    { "stageMin": 4, "text": "In the church cellar, his fingers teased my skin. I whispered, 'You’re mad… ahhh,' even as I leaned into the touch." },
    { "stageMin": 5, "text": "He pulled me into a storeroom. Dust, barrels, his tongue on mine—I whimpered, trying not to cry out." },
    { "stageMin": 6, "text": "We tangled in the festival tent’s back corner. 'I-it’s too much,' I gasped as he pressed harder, my hips bucking shamelessly." },
    { "stageMin": 7, "text": "Behind the altar curtain, his cock rubbed against me. I stammered, 'Nnnnghh—p-please…!' knowing anyone could part the fabric." },
    { "stageMin": 8, "text": "He bent me over the pew, thrusting slowly. 'O-ohhh god,' I whimpered, pussy clenching as I fought to stay quiet." },
    { "stageMin": 9, "text": "His fingers pumped inside me in the library’s dark. I moaned too loud—'Ahhhnn!'—and clapped my hand over my mouth, dripping on the floor." },
    { "stageMin": 10, "text": "He fucked me against the wagon wall, juices soaking my thighs. I screamed his name into the wood, praying someone wouldn’t… or maybe would… hear." }
  ],
  "corruption": [
    { "stageMin": 0, "text": "He shoved me into the cellar corner, grinding against me. I hissed, 'A-are you insane?!' even as my hips tilted back." },
    { "stageMin": 1, "text": "In the tavern store room, his hand groped under my skirt. 'S-stop,' I whispered, legs already trembling." },
    { "stageMin": 2, "text": "He pressed his cock against me in the pew. I squirmed, whispering, 'Ohhh… f-fuck,' as my wetness stained my panties." },
    { "stageMin": 3, "text": "In the wagon’s shadow, he yanked my top down, biting my nipple. I squealed, clutching at him, heat flooding me." },
    { "stageMin": 4, "text": "His fingers slid inside me behind the altar. 'Shhh…,' he whispered, while I panted and dripped down his hand." },
    { "stageMin": 5, "text": "He bent me over crates, thrusting against me hard. 'N-no, not here!' I moaned, juices leaking onto the wood." },
    { "stageMin": 6, "text": "His tongue licked my folds in the library dark. I cried out, 'O-ohhhnn! N-not so loud…!' as slick noises echoed." },
    { "stageMin": 7, "text": "In the stable loft, he spread me wide, rutting. 'Fuck—f-fuck me harder,' I begged, mind hazed with lust." },
    { "stageMin": 8, "text": "He slammed into me against the pew, rough and unyielding. 'M-my pussy’s yours,' I whimpered, moaning like a slut in sacred silence." },
    { "stageMin": 9, "text": "He fingered me open in the storeroom until I squirted all over the floor. 'Y-you bastard,' I panted, dripping shame and bliss." },
    { "stageMin": 10, "text": "He bred me in the altar’s shadow, his seed gushing inside. I screamed for more, juices puddling at my feet where the holy light should’ve fallen." }
  ],
  "hybrid": [
    { "stageMin": 0, "text": "He kissed my neck behind the tavern. I froze, whispering, 'Not here…!' but leaned back into him." },
    { "stageMin": 1, "text": "In the cellar, his breath was hot on my ear. I shivered, torn between slapping him and begging for more." },
    { "stageMin": 2, "text": "He nipped at my lip behind the library shelves. 'D-don’t,' I gasped, kissing him deeper anyway." },
    { "stageMin": 3, "text": "At the wagon, he pressed me against the boards. My body quivered, torn between fear of being caught and raw need." },
    { "stageMin": 4, "text": "He brushed his fingers over my folds in the pew. 'P-please,' I stammered, not sure if I meant stop or don’t stop." },
    { "stageMin": 5, "text": "We tangled in the tent shadows, lips locked, hips grinding. I moaned, 'N-not so rough… ahhh,' my thighs betraying me." },
    { "stageMin": 6, "text": "He slid inside me behind the tavern. 'Ohhh f-fuck,' I whispered, half-ashamed, half-desperate." },
    { "stageMin": 7, "text": "In the cellar, his thrusts echoed with my cries. I buried my face in his shoulder, trembling with lust." },
    { "stageMin": 8, "text": "On the pew, he spread me wide open. 'O-oh god…!' I moaned, shame and desire tangled as my pussy squelched loudly." },
    { "stageMin": 9, "text": "He fingered me until my juices ran down the wagon boards. I whimpered, 'I-I can’t stop,' thighs shaking as orgasm took me." },
    { "stageMin": 10, "text": "He fucked me in the church dark, cock pounding. 'Y-yes—yes, ruin me!' I screamed, climax spilling over us both, uncaring if the whole world heard." }
  ]
"caught": {
  "love": [
    { "stageMin": 0, "text": "Cloud walked in on us sitting too close. I pulled my hand back fast, cheeks red, pretending it was nothing." },
    { "stageMin": 2, "text": "Tifa spotted his lips brushing mine. I stammered excuses, but inside my chest throbbed with a guilty thrill." },
    { "stageMin": 5, "text": "Barret barged into the tent as his mouth was on my neck. I gasped, trembling, knowing he could smell my arousal." },
    { "stageMin": 7, "text": "Yuffie threw the curtain aside just as he pressed inside me. My cry was muffled, but the slick sounds between us betrayed me." },
    { "stageMin": 9, "text": "Red’s ears twitched as he stared at us. I wanted to scream, but my pussy clamped down hard, squirting against his cock with every thrust." },
    { "stageMin": 10, "text": "Cloud’s eyes locked on mine while I rode him shamelessly. His seed spilled inside me, juices dripping down, and I didn’t stop—I wanted everyone to see whose slut I had become." }
  ],
  "corruption": [
    { "stageMin": 0, "text": "He pressed me up against the wall when footsteps passed. I froze, but part of me liked the danger of being seen." },
    { "stageMin": 3, "text": "Yuffie caught sight of his hand up my skirt. I laughed it off, but deep down, the humiliation soaked me further." },
    { "stageMin": 6, "text": "Tifa opened the flap just as he bent me over. My cunt gushed around him, dripping down my thighs, even as I moaned into my palms." },
    { "stageMin": 8, "text": "The others heard me begging, 'M-more, don’t stop,' as his cock split me open. I came hard knowing every squelch was echoing to them." },
    { "stageMin": 10, "text": "He made me squirt in front of them all—seed and juice running, my pussy milking him while their eyes devoured my ruin. I didn’t care. I wanted them to watch." }
  ],
  "hybrid": [
    { "stageMin": 1, "text": "He kissed me in plain view. My face burned, but I leaned back into it, betraying myself." },
    { "stageMin": 4, "text": "Cloud walked in as he sucked at my tits. My moan slipped out before I could stop it, nipples slick and aching." },
    { "stageMin": 6, "text": "Tifa froze seeing me bounce on him. I squealed, hiding my face, but my body wouldn’t stop milking his cock." },
    { "stageMin": 8, "text": "Yuffie saw me gush all over his lap, legs shaking as he filled me deeper. She laughed, but my pussy throbbed harder under her gaze." },
    { "stageMin": 9, "text": "Barret’s roar shook me as he caught me bent over. My juices sprayed as I clenched around him, every thrust louder than my shame." },
    { "stageMin": 10, "text": "We fucked shamelessly with the others watching—seed, spit, and squirt painting the floor. My heart raced with shame, but my body screamed for more." }
  ]
},
"extreme_erotic": {
  "love": [
    { "stageMin": 10, "text": "He kissed me through my sobs of bliss, filling me until my womb ached. 'O-ohh… g-god, don’t stop… fill me again,' I begged, clinging to him like life itself." },
    { "stageMin": 10, "text": "His cock throbbed inside me as I screamed his name, squirting down his shaft while he kissed my swollen belly. 'We’re one now,' he whispered, and I wept with joy." },
    { "stageMin": 10, "text": "Pinned under him, juices flooding the sheets, I gasped, 'Breed me—please, I-I want your child.' The tenderness in his eyes broke me even as his thrusts ruined me." },
    { "stageMin": 10, "text": "He licked up the mess dripping from me, growling, 'Mine.' I moaned helplessly, my thighs trembling, my body offering everything without shame." },
    { "stageMin": 10, "text": "I wrapped my legs tighter, sobbing into his chest as he came again inside me. 'F-fuck—ohh gods—I’ll take it all,' I cried, convulsing in pleasure." },
    { "stageMin": 10, "text": "He made me cum until I couldn’t breathe, holding me while my juices sprayed down his thighs. I whispered, 'Even ruined, I’ll always love you.'" },
    { "stageMin": 10, "text": "He filled my ass while fingering my cunt, whispering, 'Every hole, every inch, belongs to me.' I whimpered, melting under his devotion and filth." },
    { "stageMin": 10, "text": "I begged for more, drooling, moaning his name like a prayer. His seed overflowed me, running down my legs as I kissed him feverishly." },
    { "stageMin": 10, "text": "Even gagging on his cock, tears running, I smiled. 'Y-you own me,' I sputtered between thrusts, moaning when he spilled down my throat." },
    { "stageMin": 10, "text": "He fucked me raw against the altar, seed dripping out of me as I clung to him. 'Forever yours,' I cried, unashamed of the filth baptizing me." }
  ],
  "corruption": [
    { "stageMin": 10, "text": "He split me open brutally, cock pounding my womb. 'A-ahhh… f-fuck, ruin me harder,' I screamed, squirting all over his belly as his cum gushed inside me." },
    { "stageMin": 10, "text": "On all fours in the slums, his cock slammed into me while strangers watched. 'Breed me, dirty me,' I begged, dripping filth down my thighs." },
    { "stageMin": 10, "text": "He slapped my tits as they sprayed milk, his cock battering my cervix. I squealed, 'My breeding hole’s yours—use it!' while squirting across the floor." },
    { "stageMin": 10, "text": "He choked me while fucking me against a wall, spit and cum mixing down my chin. 'You’re my filthy slut,' he growled, and I cried out, 'Y-yes!'" },
    { "stageMin": 10, "text": "Seed dribbled out of my ass as he pumped my cunt, double stuffed, juices gushing everywhere. I moaned, 'Fill every hole—make me leak forever.'" },
    { "stageMin": 10, "text": "He fingered my asshole while pounding me, forcing squirt after squirt. 'Mmm, c-cream me harder,' I whined, juices soaking us both." },
    { "stageMin": 10, "text": "My body convulsed as he came inside me again. I drooled, eyes rolling back. 'My filthy pussy can’t stop milking you,' I cried, squirting nonstop." },
    { "stageMin": 10, "text": "In the alleys, cum streamed out of me onto the dirt. 'L-look, I’m marked forever,' I whispered, grinding back against his cock hungrily." },
    { "stageMin": 10, "text": "He pissed on me after fucking me raw. I moaned, 'Y-your filth is mine… my body’s yours forever,' and I came hard, trembling in ecstasy." },
    { "stageMin": 10, "text": "Covered in spit, cum, and sweat, I collapsed under him. 'F-fuck, more, never stop ruining me,' I sobbed, squirting one last time as his seed poured into me." }
  ],
  "hybrid": [
    { "stageMin": 10, "text": "He alternated sweet kisses with brutal thrusts. 'I-I love you,' I whimpered, squirting as his cock battered my womb." },
    { "stageMin": 10, "text": "Pinned on the bed, tears streaking my face, I cried, 'M-more—harder!' while his hands held me like I was precious, even as he ruined me." },
    { "stageMin": 10, "text": "His filthy cock dripped inside me, but his lips brushed mine tenderly. I moaned, 'F-fuck, I’m yours,' squirting as love and filth tangled." },
    { "stageMin": 10, "text": "He fucked my ass while kissing my forehead, whispering, 'My dirty girl.' I came violently, juices splattering, even as I sobbed with joy." },
    { "stageMin": 10, "text": "Seed spilled from me as I straddled him. 'D-don’t look, I’m ruined,' I whispered, but he kissed me, and I moaned louder." },
    { "stageMin": 10, "text": "In the church, on the altar, he filled me raw. I screamed, 'Gods forgive me,' even as I begged for more cock, squirting on sacred stone." },
    { "stageMin": 10, "text": "My cunt dripped with his cum as I licked him clean, moaning, 'I taste us—ahhh,' before kissing him hungrily." },
    { "stageMin": 10, "text": "He fingered me until I squirted over and over, whispering, 'You’re both holy and filthy,' while I screamed his name." },
    { "stageMin": 10, "text": "Even gagging on his cock, he stroked my hair. I came hard as he whispered, 'You’re my love and my slut,' and I trembled, ruined with bliss." },
    { "stageMin": 10, "text": "He slammed me against the wall, filling me raw. I cried, 'I-I’m your dirty wife, your breeding slut,' squirting one last time as his seed overfilled me." }
  ]
},
"dreams": {
  "love": [
    { "stageMin": 0,  "text": "I dreamt of him smiling without dirt on his cheeks. For a moment, he looked like someone worth saving." },
    { "stageMin": 1,  "text": "We walked hand in hand through flowers in my dream. His roughness softened, and I wished it wouldn’t fade." },
    { "stageMin": 2,  "text": "He leaned close, brushing hair from my face. I woke blushing, heart pounding as if it truly happened." },
    { "stageMin": 3,  "text": "I saw us laughing under lantern light. His touch was clumsy but tender. It felt too real." },
    { "stageMin": 4,  "text": "We kissed by the church doors. My lips tingled when I woke, desperate for it to linger." },
    { "stageMin": 5,  "text": "I dreamt of us lying together, tangled, skin against skin. I wanted morning never to come." },
    { "stageMin": 6,  "text": "We made love under starlight. His warmth stayed with me long after waking." },
    { "stageMin": 7,  "text": "I held his child in my arms in the dream, and his arms around both of us. My chest ached with longing when I woke." },
    { "stageMin": 8,  "text": "The world saw us, but I didn’t care. His lips on mine felt worth every stare." },
    { "stageMin": 9,  "text": "I dreamt of a home filled with laughter, touches that never stopped. I wanted to stay asleep forever." },
    { "stageMin": 10, "text": "In my dream he loved me endlessly, filling me until I screamed his name. I woke soaked, trembling, whispering for more." }
  ],
  "corruption": [
    { "stageMin": 0,  "text": "I dreamt of him grabbing me in the dark, his smell choking me. I woke shivering, guilty I wanted more." },
    { "stageMin": 1,  "text": "He mocked me in my dream, pushing me down. My body betrayed me—I woke wet and ashamed." },
    { "stageMin": 2,  "text": "He pulled me by the hair into shadows. I gasped awake, hand pressed between my thighs." },
    { "stageMin": 3,  "text": "I dreamt of him pinning me, dirt pressed into my skin. My body trembled for him." },
    { "stageMin": 4,  "text": "His filthy hands spread me open. I wanted to scream no, but my dream-self moaned instead." },
    { "stageMin": 5,  "text": "I begged in the dream—not for mercy, but for more. I woke horrified… and wet." },
    { "stageMin": 6,  "text": "He used me in front of others. I moaned louder when they laughed. My sheets were soaked when I woke." },
    { "stageMin": 7,  "text": "He pumped into me until it overflowed, dripping down my thighs. I woke sticky, craving him again." },
    { "stageMin": 8,  "text": "I begged in the dream: 'Breed me, ruin me.' When I woke, the words were still on my lips." },
    { "stageMin": 9,  "text": "I dreamt of being marked forever, his filth inside me. The shame thrilled me awake." },
    { "stageMin": 10, "text": "In sleep I called him master, my pussy clamping his cock as he filled me again and again. I woke crying for release." }
  ],
  "hybrid": [
    { "stageMin": 0,  "text": "I dreamt of holding his hand. It was filthy, but I didn’t let go." },
    { "stageMin": 1,  "text": "He smiled in the dream, then smeared dirt on my cheek. I laughed instead of recoiling." },
    { "stageMin": 2,  "text": "We kissed, gentle at first. Then he pressed me into mud, and I let him." },
    { "stageMin": 3,  "text": "I dreamt of him whispering sweet words while his hands explored where they shouldn’t. I woke wanting both." },
    { "stageMin": 4,  "text": "He pressed me down, rough and tender at once. I woke breathless, unable to tell if it was love or lust." },
    { "stageMin": 5,  "text": "He made me moan softly in my dream, then laugh at how dirty I looked. I didn’t mind." },
    { "stageMin": 6,  "text": "He kissed me sweetly, then spat in my mouth. I swallowed, even in the dream." },
    { "stageMin": 7,  "text": "I dreamt of him filling me while whispering 'mine.' I woke ashamed how much it thrilled me." },
    { "stageMin": 8,  "text": "We fucked in the open. I covered my face while my body begged for more." },
    { "stageMin": 9,  "text": "I dreamt of both tenderness and filth—the warmth of his chest and his cum dripping down my thighs." },
    { "stageMin": 10, "text": "In the dream I screamed his name as he bred me raw. Love and filth merged, and I woke aching to make it real." }
  ]
},
"bloomstones": {
  "obsidian": [
    {
      "stageMin": 3,
      "text": "The Obsidian hummed in my hand. When he brushed me against the alley wall, I panicked—then a shiver ran down my spine. What if someone had seen?"
    },
    {
      "stageMin": 4,
      "text": "Its dark glow made my nipples ache when he pressed me to the tent flap. I-I whispered for him to stop, but my hips betrayed me, grinding against him where shadows met lantern light."
    },
    {
      "stageMin": 5,
      "text": "I gasped as his fingers slipped inside me in the slums’ corner. A passerby walked by—so close. My cheeks burned red, but I tightened around him instead of pulling away."
    },
    {
      "stageMin": 6,
      "text": "The stone pulsed and I let out a moan too loud to be an accident. He clapped a hand over my mouth as people passed, and the thought of them hearing made my juices gush harder."
    },
    {
      "stageMin": 7,
      "text": "He bent me over a crate in the open street. My flower dripped onto the dirt as he filled me. The Obsidian throbbed in my pocket, whispering to stop hiding. M-my body quivered with every thrust, terrified and begging for more."
    },
    {
      "stageMin": 8,
      "text": "He pinned me against a shop wall, taking me hard. His seed spilled down my thighs while laughter echoed nearby. The humiliation should have killed me… but my pussy clenched, savoring every drop."
    },
    {
      "stageMin": 9,
      "text": "I spread my legs wide on the balcony rail. The stone made me shameless—I wanted the whole slum to see my breeding hole being used. H-he roared behind me and I squealed, begging for more as the crowd below stirred."
    },
    {
      "stageMin": 10,
      "text": "The Obsidian consumed me. I begged him to take me on the church steps—holy ground turned into our stage. My cunt was stretched wide, dripping as he rutted me like an animal. ‘Look at me,’ I cried, daring the world. His filth pumped into my womb, and I screamed in shameless ecstasy."
    }
  ],
  "sapphire": [
    {
      "stageMin": 3,
      "text": "The Sapphire hummed when he told me to sit. I obeyed without thinking. My chest fluttered—why did the word alone make my thighs tighten?"
    },
    {
      "stageMin": 4,
      "text": "He gripped my chin and told me not to move. The stone pulsed, and I froze, my lips trembling. My whole body buzzed at being held in place like a doll."
    },
    {
      "stageMin": 5,
      "text": "He whispered, ‘Kneel.’ The word sank into me like fire. The stone throbbed, my heart raced, and before I knew it, I was on the ground, wet and aching, waiting for more."
    },
    {
      "stageMin": 6,
      "text": "The glow wrapped around my wrists when he pinned me down. I couldn’t resist… and I didn’t want to. My cunt clenched hard the moment his weight pressed over me."
    },
    {
      "stageMin": 7,
      "text": "He tied a strip of cloth around my wrists. My body burned hotter than ever. The stone sang in my ears, urging me to stay bound, to be his captive. M-my pussy gushed down my thighs at the helplessness."
    },
    {
      "stageMin": 8,
      "text": "He ordered me to spread wide on the tavern floor, and I obeyed with a whimper. The Sapphire flared, my juices running shamelessly as he thrusted into my soaking heat, commanding every cry from my throat."
    },
    {
      "stageMin": 9,
      "text": "The restraints dug into my wrists as I begged, drooling, sobbing, cumming again and again. Each command was a wave—I came at his word, screamed at his word. My body isn’t mine anymore, it’s his toy."
    },
    {
      "stageMin": 10,
      "text": "The Sapphire devoured me. Shackled and gagged, my flower spasmed with every brutal thrust, squirting all over the floor. His voice was my leash, and I was nothing but his dripping breeding slut—moaning, obeying, aching for more orders to follow."
    }
  ],
  "crimson": [
  {
    "stageMin": 3,
    "text": "The Crimson stone throbbed hot against my skin. My breath hitched, nipples stiff under my dress—why did it feel like it was pulling blood and heat straight into my core?"
  },
  {
    "stageMin": 4,
    "text": "He pressed the Crimson against my thigh. My body jolted, o-ohh… gods, the warmth rushed up and my flower clenched tight without him even touching me."
  },
  {
    "stageMin": 5,
    "text": "The stone burned when he slid it along my belly. I gasped, 'I-It’s too much!' My juices betrayed me, soaking through as my hips rocked without permission."
  },
  {
    "stageMin": 6,
    "text": "His hand gripped my throat while the Crimson pulsed at my womb. My eyes rolled back—f-fuck, every throb made me gush, like my body was begging him to breed me."
  },
  {
    "stageMin": 7,
    "text": "The stone glowed red when he shoved it against my clit. I screamed, squirting over his arm, unable to stop. He growled that I was his little heat-drunk whore."
  },
  {
    "stageMin": 8,
    "text": "He slid the Crimson between us as he thrust. Each pulse sent shockwaves—ohhh god, I couldn’t breathe, couldn’t think, only cum again and again as his cock battered my hole."
  },
  {
    "stageMin": 9,
    "text": "Pinned to the wall, the Crimson pressed deep inside me as he pounded. 'You’re melting,' he spat in my ear, and he was right—I was dripping, begging, ruined by the heat flooding my womb."
  },
  {
    "stageMin": 10,
    "text": "The Crimson seared with every thrust, making my pussy gush like a fountain. 'Breed me—f-fill me!' I screamed, shameless, while his seed and my slick poured out, painting my thighs red with ecstasy."
  }
  ],
  "emerald": [
  {
    "stageMin": 3,
    "text": "The Emerald glowed faintly when he touched it to my womb. A strange warmth spread low in my belly—I whimpered, imagining life blooming there. Why did my thighs clench at the thought?"
  },
  {
    "stageMin": 4,
    "text": "He pressed me down in missionary, the Emerald humming against my skin. Each thrust made me picture him planting more than just lust inside me. 'D-do you want it?' he teased, and my whole body screamed yes."
  },
  {
    "stageMin": 5,
    "text": "The stone pulsed when he flipped me onto all fours. His cock slammed into me doggy-style, juices dripping, while the warmth swelled inside my womb. I cried out, 'Y-you’ll get me pregnant…' but my hips pushed back harder."
  },
  {
    "stageMin": 6,
    "text": "He sat back, and I climbed on top—cowgirl. With the Emerald glowing, every bounce of my pussy around his cock sent sparks of need through me. I moaned, 'Breed me, please!' as my belly tightened around the stone’s heat."
  },
  {
    "stageMin": 7,
    "text": "Pinned in a mating press, the Emerald burned between us. My legs trembled, spread wide as he jackhammered into me. My cunt gushed around him, and I begged, 'F-fill my womb, make it take, I-I need it!'"
  },
  {
    "stageMin": 8,
    "text": "He clamped his mouth around my nipple, sucking hard while driving deep. The Emerald flared green, and I screamed, squirting uncontrollably as the image of swollen breasts and a swollen belly filled my mind."
  },
  {
    "stageMin": 9,
    "text": "The stone pulsed with his every thrust, juices splattering as he fucked me like an animal. 'This is your breeding hole,' he growled, and my pussy clamped so tight I nearly blacked out from the orgasm."
  },
  {
    "stageMin": 10,
    "text": "Emerald fire seared as he fucked me raw, tongues ravaging each other while his cock split me open in a mating press. 'Breed me, b-break me, m-make me yours forever!' I shrieked as his seed flooded me, dripping out in hot waves, my womb aching to take every drop."
  }
  ],
  "onyx": [
  {
    "stageMin": 3,
    "text": "The Onyx pulsed cold as he pressed me against the wall. His grip locked my wrists above my head. I gasped, 'Y-you’re holding me too tight,' even as my hips betrayed me by grinding against him."
  },
  {
    "stageMin": 4,
    "text": "He used the stone like a shackle, pinning my arms behind my back. His tongue ravaged mine while his cock ground against my slit through my clothes. I moaned into his mouth, too bound to resist."
  },
  {
    "stageMin": 5,
    "text": "On my knees, wrists bound with invisible chains, he fed me his cock. The Onyx throbbed each time I gagged, my throat slick with drool. I whispered between thrusts, 'I-I can’t stop… I don’t want to.'"
  },
  {
    "stageMin": 6,
    "text": "Bent in doggy, my face pressed to the floor, the stone made my body obey every brutal thrust. My pussy clamped around him, gushing, as he barked, 'Say you’re mine.' I screamed it until my voice broke."
  },
  {
    "stageMin": 7,
    "text": "He tied my legs wide with Onyx chains, spreading me in a cruel mating press. Every slam of his cock knocked the air out of me. 'I-I’m split open,' I sobbed, quivering, juices spraying over his hips."
  },
  {
    "stageMin": 8,
    "text": "He made me ride him in reverse cowgirl, my wrists chained to my ankles. Every bounce drove him deeper, juices flying, my moans turning into squeals. 'You’re my toy,' he growled, and the Onyx pulsed in agreement."
  },
  {
    "stageMin": 9,
    "text": "The stone bound me in midair, legs spread as he fucked me standing. My cunt overflowed, dripping down his thighs, as I shrieked, 'Y-you’re ruining me!' He smirked, pounding harder, and I came until I squirted."
  },
  {
    "stageMin": 10,
    "text": "Onyx chains suspended me, wrists and ankles splayed wide. He plowed into me like an animal, juices splattering the floor. My pussy clenched in endless waves, screaming, 'F-fuck my breeding hole!' until I lost all shame in the restraint’s ecstasy."
  }
  ],
  "amethyst": [
  {
    "stageMin": 3,
    "text": "The Amethyst shimmered and suddenly there were two of him—both kissing me, both pulling my clothes. I gasped, 'N-no, that’s impossible,' but my cunt throbbed like it was real."
  },
  {
    "stageMin": 4,
    "text": "Hands I couldn’t see slid across my breasts, pinching, tugging. His cock was inside me, but another tongue licked my clit. 'It’s not real… o-ohh gods,' I moaned, my hips writhing into the phantom touch."
  },
  {
    "stageMin": 5,
    "text": "He whispered in my ear while another version of him pushed me down. My lips quivered, drool running as I moaned, 'T-too many… f-fuck, I can’t…' My pussy squirted against nothing but shadows."
  },
  {
    "stageMin": 6,
    "text": "The stone made his voice echo inside my skull, commanding: 'Open wider.' My thighs spread on their own, juices running down my ass. Every phantom thrust made me scream like he was inside me twice at once."
  },
  {
    "stageMin": 7,
    "text": "I saw us in the mirror: me on all fours, but a dozen of his hands slapping, grabbing, pinning me. 'Breed me,' I cried at my reflection, my pussy convulsing as if already overflowing with his seed."
  },
  {
    "stageMin": 8,
    "text": "The Amethyst fog twisted the world. I felt myself bouncing in cowgirl while he also rutted me from behind. My moans split into two voices—one begging for mercy, one begging for more. Both came until I drenched him."
  },
  {
    "stageMin": 9,
    "text": "He was everywhere—tongue in my mouth, cock in my cunt, cock in my ass, hands on my nipples. I screamed, 'F-fuck, it’s too much!' Juices gushed down my thighs, the ecstasy so sharp I almost fainted."
  },
  {
    "stageMin": 10,
    "text": "The Amethyst broke me—I was surrounded, filled from every hole by visions of him. My breeding hole stretched, my throat fucked raw, nipples sucked until they sprayed milk. I writhed in madness, screaming, 'More, more, more!' until my body convulsed in endless squirting waves."
  }
  ],
  "peridot": [
  {
    "stageMin": 3,
    "text": "The Peridot pulsed when I saw him laugh with Tifa. My chest ached, my thighs clenched. Why did envy make me wet?"
  },
  {
    "stageMin": 4,
    "text": "He brushed Renna’s arm and the gem throbbed inside me. I hated it. I hated her. I hated how my pussy tightened just imagining him touching me instead."
  },
  {
    "stageMin": 5,
    "text": "Yuffie teased him, bold and playful. I swore I’d scold her—yet the Peridot flared hot, my jealousy dripping down my thighs, shameful and slick."
  },
  {
    "stageMin": 6,
    "text": "The glow drove me mad. I shoved him against the wall, snarling that he’s mine. He smirked, and the stone hummed as I rode his cock, desperate to claim what no one else could have."
  },
  {
    "stageMin": 7,
    "text": "He let me straddle him while the others laughed nearby. I looked them in the eye, daring them to see I was being filled—jealousy burned into triumph, into heat spilling inside me."
  },
  {
    "stageMin": 8,
    "text": "Peridot light seared me as I bit his neck, whispering through clenched teeth: 'N-no one else gets this cock. No one.' My pussy throbbed, clamping tight, milking him like a selfish claim."
  },
  {
    "stageMin": 9,
    "text": "I watched another girl eye him. The gem’s glow made me snap—dragging him into me until seed gushed out, dripping onto the floor. I smeared it against my slit, glaring at her. He’s mine."
  },
  {
    "stageMin": 10,
    "text": "Peridot blazed. I begged him to fuck me where they all could see—Tifa, Renna, Yuffie—any of them. My cunt swallowed him with lewd squelches, and I screamed, 'Look! He’s filling me! I’m his!'"
  }
  ],
  "diamond": [
  {
    "stageMin": 3,
    "text": "The Diamond pulsed faintly when he pushed harder than usual. My legs trembled, my lips stammered 't-too much'—but I didn’t let go."
  },
  {
    "stageMin": 4,
    "text": "He pinned me to the floor, relentless. The gem burned cold fire through me as each thrust blurred pain into dizzying pleasure. 'I-I can take it,' I gasped, clinging tight."
  },
  {
    "stageMin": 5,
    "text": "The Diamond hummed when he forced me to my knees. My throat ached, tears streaked, but I swallowed him again and again. Each gag made the stone’s light flare brighter."
  },
  {
    "stageMin": 6,
    "text": "Hours passed—or felt like it. My body quaked, sore and dripping. The stone’s gleam urged me on, even as I whimpered, 'I c-can’t…' His cock slammed deeper. 'Yes, you can.'"
  },
  {
    "stageMin": 7,
    "text": "He bent me in half, pounding until my womb jolted with every strike. The Diamond hardened me against the overstimulation—every spasm, every gush, feeding an endless craving."
  },
  {
    "stageMin": 8,
    "text": "The gem sang as he used me again and again. My voice broke into guttural moans, my hole stretched raw, leaking down my thighs. 'More… I still need more.' Even I couldn’t believe the words."
  },
  {
    "stageMin": 9,
    "text": "I collapsed, a shaking mess, but he dragged me upright and slid back inside. The Diamond pulsed through my battered body, forcing me to endure every brutal thrust as climax ripped me open again."
  },
  {
    "stageMin": 10,
    "text": "Diamond brilliance blinded me when he bred me without pause. Seed overflowed, my cunt frothing, my mind broken to a single plea: 'U-use me until I’m nothing—fill me until I’m ruined!' And still I begged for more."
  }
  ],
  "pumice": [
  {
    "stageMin": 3,
    "text": "The Pumice pulsed when he spat on my chest. I gasped, 'D-don’t…' but my nipples hardened beneath the mess. I wiped it away—then licked my own fingers."
  },
  {
    "stageMin": 4,
    "text": "He smeared his sweat across my lips. I should’ve gagged. Instead I whimpered, tongue flicking out to taste. The stone burned hotter the dirtier I felt."
  },
  {
    "stageMin": 5,
    "text": "On my knees, he forced me to clean his cock with my mouth, filth and all. I choked and drooled, cunt soaking the floorboards. 'Good little slut,' he growled, and I moaned around him."
  },
  {
    "stageMin": 6,
    "text": "He bent me over and spat on my hole before ramming in. 'You’re just a dirty hole for me,' he snarled. The gem throbbed as I squealed, juices running down my thighs with every degrading thrust."
  },
  {
    "stageMin": 7,
    "text": "The Pumice glowed when he pinned me in the mud. He rutted me like livestock, smearing filth into my hair, calling me his breeding whore. I screamed—I came harder than I ever had."
  },
  {
    "stageMin": 8,
    "text": "He used me in front of others, spitting on my face while pounding my cunt raw. 'Say it,' he demanded. I sobbed, 'I’m your dirty slut, your cocksleeve!' The crowd jeered—I orgasmed anyway."
  },
  {
    "stageMin": 9,
    "text": "He made me lick the filth from his shaft after he came inside me, seed mixed with dirt. My own taste coated my tongue, and still I begged, 'P-please… ruin me more.' The stone pulsed like my clit on fire."
  },
  {
    "stageMin": 10,
    "text": "The Pumice blazed as he forced me open again, filling every hole, spit and seed running down my body. 'Nothing but a cum-drenched hole,' he growled. I screamed in filthy ecstasy, 'Y-yes—your hole, your slut, drown me in your filth!' My womb overflowed, juices spraying, humiliation and bliss tangled into one final ruin."
  }
  ],
  "crystal": [
  {
    "stageMin": 3,
    "text": "The Crystal shimmered when he kissed me softly. My body trembled, not from filth, but from the purity of his lips. I whispered, 'Why does this feel so holy?'"
  },
  {
    "stageMin": 4,
    "text": "His fingers slid inside, slow and reverent. The gem pulsed, and I moaned as if in prayer. 'O-ohh… I feel blessed,' I confessed, cheeks burning at my own words."
  },
  {
    "stageMin": 5,
    "text": "When he entered me, it wasn’t just rutting—it was like a vow. The stone glowed with every thrust, my body clenching around him as if this was sanctified, ordained."
  },
  {
    "stageMin": 6,
    "text": "He lifted me onto him, and our bodies joined in rhythm under the Crystal’s light. My moans came like hymns, desperate but worshipful. 'Gods, I-I’m yours… forever yours!'"
  },
  {
    "stageMin": 7,
    "text": "The gem pulsed when his tongue traced my breast, his teeth grazing my nipple. My back arched as light seemed to pour from my skin. 'I-I’m glowing inside… every thrust is heaven.'"
  },
  {
    "stageMin": 8,
    "text": "His cock slammed deeper, and I cried out as my body erupted with light. Juices sprayed, dripping onto his lap. 'Fill me—make me holy with your seed,' I begged, delirious."
  },
  {
    "stageMin": 9,
    "text": "He spilled inside me, and I screamed, every muscle convulsing. The Crystal turned white-hot, every drop of his cum consecrating me. 'B-baptize me in you,' I stammered, tears running down my cheeks."
  },
  {
    "stageMin": 10,
    "text": "The Crystal shattered my last shame. He pinned me down, thrusting like divinity itself, seed flooding me. I screamed like a saint in ecstasy, 'Yes—break me, bless me, make my womb yours!' My squirting soaked the floor, my cunt spasming around him in holy ruin."
  }
  ]
},
    "items": {
  "aphrodisiacs": [
    {
      "stageMin": 2,
      "path": "any",
      "text": "He teased me with a vial of bitter-sweet liquid. One sip, and warmth spread between my thighs. I gasped, 'W-what is this? Why can’t I stop thinking about him?'"
    },
    {
      "stageMin": 4,
      "path": "corruption",
      "text": "He rubbed the oil on my skin, and suddenly every touch was unbearable, electric. My nipples stiffened, my pussy wet through my dress. 'I-I can’t control it—please… don’t stop.'"
    },
    {
      "stageMin": 6,
      "path": "love",
      "text": "We shared a draught together, and I collapsed into his arms. Every thrust felt like lightning in my womb. 'O-oh god, I want you forever,' I whispered, clinging desperately."
    },
    {
      "stageMin": 8,
      "path": "hybrid",
      "text": "The potion ran down my throat, and soon I was begging, clawing, spreading myself open. 'Fuck me, f-fill me… I need it, I need it now,' I moaned, drool running down my chin."
    }
  ],
  "alcohol": [
    {
      "stageMin": 1,
      "path": "any",
      "text": "Just a single cup of strong ale had my head dizzy. I laughed too loud, swayed too close, and whispered secrets I shouldn’t."
    },
    {
      "stageMin": 3,
      "path": "corruption",
      "text": "I let him pour me another. My words slurred, and when his hand slid up my thigh, I didn’t push him away. I leaned into the touch, drunk on him as much as the drink."
    },
    {
      "stageMin": 5,
      "path": "hybrid",
      "text": "I spilled wine on my chest, and he licked it off. The crowd roared with laughter, but I moaned. 'S-so shameless… but I love it,' I thought."
    },
    {
      "stageMin": 7,
      "path": "any",
      "text": "I was drunk enough to forget shame. He bent me over the tavern table, and I moaned into the wood as ale mugs clattered nearby."
    }
  ],
  "incense": [
    {
      "stageMin": 2,
      "path": "any",
      "text": "The incense smoke curled sweet and heady. I felt floaty, my thighs pressed tight together as heat coiled inside me."
    },
    {
      "stageMin": 4,
      "path": "corruption",
      "text": "He filled the room with thick, musky incense. My body betrayed me—I spread my legs for him, too hazy to care."
    },
    {
      "stageMin": 6,
      "path": "love",
      "text": "The soft lavender soothed me while he kissed every inch. 'I’m safe,' I whispered, trembling in bliss, the world sweet and smoky."
    },
    {
      "stageMin": 9,
      "path": "hybrid",
      "text": "The smoke was suffocating and addictive, just like him. I gagged, I moaned, I clung—high on the fumes, high on his cock, losing myself completely."
    }
  ]
    },
    "aftermath": [
  {
    "key": "first_kiss_reflection",
    "stageMin": 2,
    "path": "any",
    "text": "I can still feel the taste on my lips… bitter smoke, and yet my heart races like it was honey."
  },
  {
    "key": "first_touch_reflection",
    "stageMin": 1,
    "path": "any",
    "text": "His hand brushed mine. I told myself it was nothing, but why do I keep replaying it in my head?"
  },
  {
    "key": "first_time_reflection_love",
    "stageMin": 3,
    "path": "love",
    "text": "I ache, but in the ache I feel chosen. It wasn’t perfect, but it was ours—and I want more."
  },
  {
    "key": "first_time_reflection_corruption",
    "stageMin": 3,
    "path": "corruption",
    "text": "My thighs still tremble. Shame clings to me like sweat… and I can’t stop craving it again."
  },
  {
    "key": "pregnancy_discovery_reflection",
    "stageMin": 4,
    "path": "any",
    "text": "The test is true. His child grows in me. Fear and joy knot together in my chest—I can’t untangle them."
  },
  {
    "key": "caught_by_friend_reflection",
    "stageMin": 5,
    "path": "any",
    "text": "Their eyes saw too much. I told myself I was mortified, but when I close mine, all I feel is the heat of being watched."
  },
  {
    "key": "stage10_final_reflection_love",
    "stageMin": 10,
    "path": "love",
    "text": "If the world ends tomorrow, I’ll die with his name on my lips and his warmth in my heart."
  },
  {
    "key": "stage10_final_reflection_corruption",
    "stageMin": 10,
    "path": "corruption",
    "text": "I don’t even flinch anymore. I am his: soaked, used, claimed. And I’ve never felt freer."
  },
  {
    "key": "stage10_final_reflection_hybrid",
    "stageMin": 10,
    "path": "hybrid",
    "text": "I am holy and ruined. Loved and defiled. And it’s perfect because it’s both."
  }
    ]
  },
    "gossip": [
  {
    "key": "stage0_initial_whispers",
    "stageMin": 0,
    "path": "any",
    "text": "The market girls laugh when I talk to him. 'Aerith with a beggar? As if.' I pretend not to care."
  },
  {
    "key": "stage2_softening",
    "stageMin": 2,
    "path": "any",
    "text": "They call him dirt and me naive. Maybe I am… but their voices sound jealous when they see him walk beside me."
  },
  {
    "key": "stage3_rumors_of_touch",
    "stageMin": 3,
    "path": "any",
    "text": "A woman in the slums muttered, 'She lets him touch her, you know.' I flushed so hot I almost admitted it."
  },
  {
    "key": "stage4_corruption_gossip",
    "stageMin": 4,
    "path": "corruption",
    "text": "They don’t even bother hiding it anymore. 'She smells like him,' one spat. Shame lingers… but it excites me."
  },
  {
    "key": "stage4_love_gossip",
    "stageMin": 4,
    "path": "love",
    "text": "Old men at the bar said, 'She’s softening him. Maybe she’s the only one who could.' I smiled into my cup."
  },
  {
    "key": "stage6_public_affection",
    "stageMin": 6,
    "path": "any",
    "text": "Children pointed and giggled when he kissed me in the street. I should’ve pulled away, but I didn’t."
  },
  {
    "key": "stage7_darkening_whispers",
    "stageMin": 7,
    "path": "corruption",
    "text": "They call me ruined now. 'His whore.' The words sting, but the ache between my legs when I hear them betrays me."
  },
  {
    "key": "stage8_hybrid_gossip",
    "stageMin": 8,
    "path": "hybrid",
    "text": "Some whisper prayers for me, others laugh behind my back. But when I meet his eyes, none of it matters."
  },
  {
    "key": "stage9_shameless",
    "stageMin": 9,
    "path": "corruption",
    "text": "The slums look away now. I don’t hide. I wear his marks, his scent, like jewelry—and I see the envy in their faces."
  },
  {
    "key": "stage10_final",
    "stageMin": 10,
    "path": "any",
    "text": "They no longer whisper. They stare. Some in disgust, some in awe. Let them. I’ve chosen my place—and it’s at his side."
  }
    ]
  },
  "party_gossip": {
    "tifa": {
  "neutral": [
    { "stageMin": 0, "path": "any", "text": "Tifa wrinkled her nose when he passed by, but she didn’t say anything. I caught myself wondering if she saw me watching him." },
    { "stageMin": 1, "path": "any", "text": "She glanced once and looked away quickly, as if pretending not to notice how close he stood to me." },
    { "stageMin": 2, "path": "any", "text": "Her lips pressed thin when I laughed at his joke. Not anger—just cautious distance." },
    { "stageMin": 3, "path": "any", "text": "I think she sees the way he brushes against me, but she won’t say it aloud." },
    { "stageMin": 4, "path": "any", "text": "She glanced between us, lips pressed tight. Not angry—just… guarded, like she was waiting to see if I’d step over a line." },
    { "stageMin": 5, "path": "any", "text": "When he touched my arm, her eyes flickered, but she turned away instead of speaking." },
    { "stageMin": 6, "path": "any", "text": "She sat across from me, silent as I shifted closer to him. I could almost feel her measuring me, deciding what to think." },
    { "stageMin": 7, "path": "any", "text": "Her silence now feels deliberate, as though she’s testing how far I’ll go before she reacts." },
    { "stageMin": 8, "path": "any", "text": "Even when she notices the marks he leaves, she doesn’t comment. It’s the quiet that unsettles me more than anger would." },
    { "stageMin": 9, "path": "any", "text": "She looks at me differently now—like she knows everything but refuses to interfere. Her quiet judgment is worse than words." },
    { "stageMin": 10, "path": "any", "text": "By now, she must know everything. And yet she stays silent, carrying her thoughts like locked steel. I can’t tell if she disapproves… or envies." }
  ],
  "rivalry": [
    { "stageMin": 0, "path": "any", "text": "Tifa scoffed when I lingered near him. 'Don’t waste your time,' she muttered, though I already was." },
    { "stageMin": 1, "path": "any", "text": "She frowned when he brushed against me, her eyes sharp and accusing." },
    { "stageMin": 2, "path": "any", "text": "Her glare burned into me when he brushed my hand. I pretended not to notice, but my heart raced." },
    { "stageMin": 3, "path": "any", "text": "When he smirked at me, she growled under her breath: 'Pathetic.' I felt myself blush." },
    { "stageMin": 4, "path": "any", "text": "She muttered that I was making a mistake. My chest twisted—because maybe she was right." },
    { "stageMin": 5, "path": "any", "text": "She hissed in my ear: 'You really think you’re special?' My lips trembled—I wanted to deny it, but I couldn’t." },
    { "stageMin": 6, "path": "any", "text": "When I leaned too close, she snapped: 'Slumming it suits you.' Her words stung more than I wanted to admit." },
    { "stageMin": 7, "path": "any", "text": "She warned me not to let him mark me again. But I already wanted him to." },
    { "stageMin": 8, "path": "any", "text": "She mocked the bruises he left on me. 'Guess you’re his toy too.' My shame only deepened the heat inside me." },
    { "stageMin": 9, "path": "any", "text": "She spat the words: 'You’ve let him ruin you.' And yet I couldn’t stop craving his touch." },
    { "stageMin": 10, "path": "any", "text": "Tifa laughed when she caught me panting after him. 'Pathetic,' she spat—but her eyes betrayed her own hunger." }
  ],
  "shared": [
    { "stageMin": 0, "path": "any", "text": "Tifa said nothing when he looked at us both. For a moment, I thought she felt the same heat I did." },
    { "stageMin": 1, "path": "any", "text": "She blushed when he leaned too close to me. I wondered if her heart beat the same way mine did." },
    { "stageMin": 2, "path": "any", "text": "I caught her eyes lingering on him the same way mine did. It unsettled me, but it also thrilled me." },
    { "stageMin": 3, "path": "any", "text": "She blushed when she caught me kissing him. Later, she whispered: 'So… it’s not just me then.' My stomach twisted with shame and relief." },
    { "stageMin": 4, "path": "any", "text": "She brushed my hand under the table, daring me to admit we were both his. I trembled… and didn’t pull away." },
    { "stageMin": 5, "path": "any", "text": "Tifa teased me in the tavern: 'Did he touch you here too?' I wanted to deny it, but the heat on my face betrayed me." },
    { "stageMin": 6, "path": "any", "text": "We compared secrets—where he kissed, where he lingered, how he left his marks. It was shameful… and intoxicating." },
    { "stageMin": 7, "path": "any", "text": "We teased each other openly now, laughing nervously about how much of us he’d claimed." },
    { "stageMin": 8, "path": "any", "text": "After her turn, she leaned close and whispered: 'He made me scream.' I quivered, admitting through stammers that he made me too." },
    { "stageMin": 9, "path": "any", "text": "She watched me ride him and whispered encouragement instead of scorn. I flushed hotter than his touch alone could make me." },
    { "stageMin": 10, "path": "any", "text": "We shared a knowing look, both dripping, both ruined, both satisfied. We weren’t rivals anymore—we were sisters in sin." }
  ],
    "renna": {
  "neutral": [
    { "stageMin": 0, "path": "any", "text": "Renna laughed too easily at his jokes. I told myself it was nothing… but I kept watching." },
    { "stageMin": 1, "path": "any", "text": "She brushed his shoulder and didn’t flinch at the dirt. I wished I had her ease." },
    { "stageMin": 2, "path": "any", "text": "Her smile came too quickly when he teased her. I wondered if she even noticed how filthy he was." },
    { "stageMin": 3, "path": "any", "text": "They sat close, shoulders almost touching. My chest tightened, though I forced a polite smile." },
    { "stageMin": 4, "path": "any", "text": "She leans in when he whispers. I try not to care. I fail." },
    { "stageMin": 5, "path": "any", "text": "Her diary must be full of his words now. Mine is too. The thought gnaws at me." },
    { "stageMin": 6, "path": "any", "text": "She’s unbothered by his grime; I still wrestle with it. Maybe she’s stronger—or weaker—than I am." },
    { "stageMin": 7, "path": "any", "text": "Renna glows when he praises her. I hate that I notice every flicker of it." },
    { "stageMin": 8, "path": "any", "text": "I know they’ve gone further. Her eyes linger differently now. But she doesn’t boast, and that silence stings most of all." },
    { "stageMin": 9, "path": "any", "text": "The way she avoids my gaze says enough. She’s his already, and I’m still pretending not to mind." },
    { "stageMin": 10, "path": "any", "text": "By now, I see her as his as much as I am. Neutrality is a lie—we’re bound by the same shadow." }
  ],
  "rivalry": [
    { "stageMin": 0, "path": "any", "text": "Renna teased me: 'He’s not so bad if you look close.' I bit my tongue; I didn’t want to fight." },
    { "stageMin": 1, "path": "any", "text": "She smirked when he mocked me, as if enjoying my discomfort. I flushed red with anger." },
    { "stageMin": 2, "path": "any", "text": "When his hand lingered on her, she looked at me with triumph. My stomach churned." },
    { "stageMin": 3, "path": "any", "text": "She laughed when he ignored me to whisper in her ear. My fists clenched, nails digging into palms." },
    { "stageMin": 4, "path": "any", "text": "She taunted me after: 'Guess he likes me better dirty.' I wanted to scream." },
    { "stageMin": 5, "path": "any", "text": "Her eyes sparkled with victory every time he touched her. I hated how much it stung." },
    { "stageMin": 6, "path": "any", "text": "She flaunted the marks he left. 'Do you want to see?' she whispered wickedly. I looked away, burning." },
    { "stageMin": 7, "path": "any", "text": "She hissed: 'He’s mine now.' My voice caught in my throat, unable to deny it." },
    { "stageMin": 8, "path": "any", "text": "She wore her corruption proudly, moaning louder when she knew I was nearby. My heart twisted with rage and heat." },
    { "stageMin": 9, "path": "any", "text": "She forced me to watch once—her smirk dripping with malice. I wanted to hate her… but my body betrayed me." },
    { "stageMin": 10, "path": "any", "text": "Her laughter echoes in my diary: 'We’re both ruined, but I won first.' Even writing it, my hands shake." }
  ],
  "shared": [
    { "stageMin": 0, "path": "any", "text": "Renna caught me staring at him and smiled knowingly. It felt like a secret between us." },
    { "stageMin": 1, "path": "any", "text": "She whispered, 'You see it too, don’t you?' My breath caught—I couldn’t deny it." },
    { "stageMin": 2, "path": "any", "text": "We exchanged glances when he walked by. Silent agreement passed between us." },
    { "stageMin": 3, "path": "any", "text": "She giggled when she noticed how close he leaned to me. 'Looks like he wants both of us,' she teased." },
    { "stageMin": 4, "path": "any", "text": "She whispered after he left: 'Maybe it’s not so bad, sharing.' My body tingled with the thought." },
    { "stageMin": 5, "path": "any", "text": "We traded confessions: how he touched us, what he said. It was dirty, but it made me smile with her." },
    { "stageMin": 6, "path": "any", "text": "She admitted she liked watching me with him. My cheeks burned hotter than his kisses ever made them." },
    { "stageMin": 7, "path": "any", "text": "We leaned on each other after he left, breathless and sore, laughing like sisters sharing sin." },
    { "stageMin": 8, "path": "any", "text": "She held my hand while he had me, whispering: 'Don’t fight it, Aerith.' I didn’t." },
    { "stageMin": 9, "path": "any", "text": "We kissed each other in between his thrusts, sealing the bond of our shared corruption." },
    { "stageMin": 10, "path": "any", "text": "Now we write the same story: his filth, our pleasure, our unity. Rivals no longer—sisters, lovers, partners in ruin." }
  ],
    "yuffie": {
  "neutral": [
    { "stageMin": 0, "path": "any", "text": "Yuffie teased him about smelling like trash. I laughed along, pretending it didn’t sting that she was braver with him than I was." },
    { "stageMin": 1, "path": "any", "text": "She joked about stealing his rags, and he actually chuckled. I envied how easily she disarmed his dirt." },
    { "stageMin": 2, "path": "any", "text": "She perched close, mocking his roughness, and he let her. I told myself I didn’t care." },
    { "stageMin": 3, "path": "any", "text": "Her grin made his filth seem harmless. I wanted to believe it, too." },
    { "stageMin": 4, "path": "any", "text": "She still treats it like a game—teasing, daring. I wonder if that’s why he lets her near so freely." },
    { "stageMin": 5, "path": "any", "text": "Her diary must be full of jokes about him. Mine… isn’t so lighthearted anymore." },
    { "stageMin": 6, "path": "any", "text": "She shrugs at his grime. I can’t. But sometimes I wish I could." },
    { "stageMin": 7, "path": "any", "text": "Her laughter comes too easily. I force mine to match it, though I burn inside." },
    { "stageMin": 8, "path": "any", "text": "She treats his filth like a trick she can laugh off. I see more. I feel more." },
    { "stageMin": 9, "path": "any", "text": "She doesn’t realize how far it’s gone for me. Or maybe she does, and just laughs louder." },
    { "stageMin": 10, "path": "any", "text": "Her jokes hide something deeper now. She knows what he is, what I’ve become—and she won’t say it out loud." }
  ],
  "rivalry": [
    { "stageMin": 0, "path": "any", "text": "Yuffie mocked me: 'Careful, Aerith, you’ll catch his stink.' I forced a smile, but my cheeks burned." },
    { "stageMin": 1, "path": "any", "text": "She elbowed me after he looked my way: 'Guess he likes flowers after all.' My heart raced with shame." },
    { "stageMin": 2, "path": "any", "text": "She dangled trinkets she stole from him, smirking as if to prove he let her closer. I hated how it stung." },
    { "stageMin": 3, "path": "any", "text": "She kissed his cheek in jest, eyes locked on mine. My fists clenched." },
    { "stageMin": 4, "path": "any", "text": "Her laughter turned sharp: 'He’d never want someone so prissy.' I wanted to scream at her." },
    { "stageMin": 5, "path": "any", "text": "She flaunted every moment with him, even the filth. My jealousy gnawed like hunger." },
    { "stageMin": 6, "path": "any", "text": "She whispered, 'You can’t handle him dirty.' I hated her confidence, and how part of me feared she was right." },
    { "stageMin": 7, "path": "any", "text": "She moaned louder when she knew I was nearby. My stomach twisted—rage, heat, longing all at once." },
    { "stageMin": 8, "path": "any", "text": "She taunted: 'He prefers a thief’s touch over your flowers.' My heart cracked, but my body shivered." },
    { "stageMin": 9, "path": "any", "text": "She pulled him close in full view, smirked, and mouthed: 'Mine.' I broke inside, yet desire lingered." },
    { "stageMin": 10, "path": "any", "text": "Her diary would call it victory. Mine calls it torment. Still, I can’t stop watching her win." }
  ],
  "shared": [
    { "stageMin": 0, "path": "any", "text": "Yuffie winked when she caught me staring. I laughed nervously—it felt like a secret only she noticed." },
    { "stageMin": 1, "path": "any", "text": "She whispered, 'Bet you wonder too.' I did. I couldn’t deny it." },
    { "stageMin": 2, "path": "any", "text": "We joked about his smell together. It felt strange, like we were already in on something." },
    { "stageMin": 3, "path": "any", "text": "She giggled when I blushed at his touch. 'Don’t worry, I won’t tell,' she teased." },
    { "stageMin": 4, "path": "any", "text": "She dared me: 'Next time, lean in too.' My heart hammered." },
    { "stageMin": 5, "path": "any", "text": "We shared confessions—how he teased, how he touched. Her laughter made it less shameful." },
    { "stageMin": 6, "path": "any", "text": "She admitted she liked seeing me with him. I couldn’t hide how much that thrilled me." },
    { "stageMin": 7, "path": "any", "text": "She pressed against me as he kissed us both. Our giggles tangled with moans." },
    { "stageMin": 8, "path": "any", "text": "She whispered in my ear as he took her: 'Your turn’s next.' My thighs shook." },
    { "stageMin": 9, "path": "any", "text": "We kissed each other, tongues daring, while his filth bound us together. Shame turned to shared delight." },
    { "stageMin": 10, "path": "any", "text": "Now we both write the same truth: we’re his, and we’re each other’s. Rivals turned sisters in sin." }
  ],
    "cloud": {
  "neutral": [
    { "stageMin": 0, "path": "any", "text": "Cloud brushed it off, said Vagrant was 'just noise.' I nodded, grateful for his calm." },
    { "stageMin": 1, "path": "any", "text": "He teased me lightly, saying, 'Strange choice of company, Aerith.' I laughed it away." },
    { "stageMin": 2, "path": "any", "text": "He caught me smiling after talking to Vagrant. He only smirked, as if to say, 'Be careful.'" },
    { "stageMin": 3, "path": "any", "text": "Cloud warned me to wash my hands after being near him. His tone was half-joking." },
    { "stageMin": 4, "path": "any", "text": "He joked that the dirt was rubbing off on me. I laughed, but something in me bristled." },
    { "stageMin": 5, "path": "any", "text": "Cloud only sighed when he saw us close. 'If that’s what you want…' he muttered." },
    { "stageMin": 6, "path": "any", "text": "He said nothing, just gave me a look—half worried, half resigned." },
    { "stageMin": 7, "path": "any", "text": "He reminded me softly, 'You don’t owe him anything.' I couldn’t answer." },
    { "stageMin": 8, "path": "any", "text": "He told me I deserved better. I felt guilt twist in my stomach." },
    { "stageMin": 9, "path": "any", "text": "Cloud stopped bringing it up, but I could see the disappointment in his eyes." },
    { "stageMin": 10, "path": "any", "text": "He avoids the subject now. But silence is heavier than words." }
  ],
  "suspicious": [
    { "stageMin": 0, "path": "any", "text": "Cloud asked why I was always in the slums. I smiled it off." },
    { "stageMin": 1, "path": "any", "text": "He wrinkled his nose when I returned. 'You smell like him,' he said quietly." },
    { "stageMin": 2, "path": "any", "text": "He noticed the dirt on my dress. I told him it was nothing—he didn’t look convinced." },
    { "stageMin": 3, "path": "any", "text": "Cloud asked if I was hiding something. I stumbled for an answer." },
    { "stageMin": 4, "path": "any", "text": "He stared at me too long after Vagrant brushed my arm. I could almost hear his doubts." },
    { "stageMin": 5, "path": "any", "text": "He caught my blush after Vagrant’s whisper. 'What did he say?' Cloud demanded. I said 'nothing.'" },
    { "stageMin": 6, "path": "any", "text": "Cloud asked outright if I had feelings for him. My silence betrayed me." },
    { "stageMin": 7, "path": "any", "text": "He cornered me with questions: 'Why him? Why not walk away?' My heart pounded." },
    { "stageMin": 8, "path": "any", "text": "He accused me of lying. The sting of his words burned worse than the truth." },
    { "stageMin": 9, "path": "any", "text": "His eyes followed me every time I left. He didn’t need to speak; the suspicion clung like smoke." },
    { "stageMin": 10, "path": "any", "text": "He finally said it: 'I don’t recognize you anymore.' My heart cracked." }
  ],
  "jealous": [
    { "stageMin": 0, "path": "any", "text": "Cloud scoffed when Vagrant’s name came up. 'Why waste your time?' he muttered." },
    { "stageMin": 1, "path": "any", "text": "He frowned when I laughed at Vagrant’s joke. 'You never laugh at mine like that,' he whispered." },
    { "stageMin": 2, "path": "any", "text": "Cloud clenched his fists when Vagrant brushed near me. I pretended not to see." },
    { "stageMin": 3, "path": "any", "text": "He demanded to know why I chose him over someone who cared. My lips trembled with no answer." },
    { "stageMin": 4, "path": "any", "text": "He stormed out after seeing me smile at Vagrant. His silence screamed louder than words." },
    { "stageMin": 5, "path": "any", "text": "He snapped: 'He’s nothing but filth!' My heart tore between guilt and defiance." },
    { "stageMin": 6, "path": "any", "text": "Cloud’s voice broke: 'Was I not enough?' His pain mirrored mine." },
    { "stageMin": 7, "path": "any", "text": "He tried to pull me away. My refusal shattered something between us." },
    { "stageMin": 8, "path": "any", "text": "Cloud spat: 'You’ve chosen your dirt.' I flinched but stayed silent." },
    { "stageMin": 9, "path": "any", "text": "He confessed in rage: 'I loved you, Aerith.' My tears mixed with shame." },
    { "stageMin": 10, "path": "any", "text": "Cloud barely looks at me now. His love curdled into jealousy, and I carry the weight." }
  ],
    "barret": {
  "neutral": [
    { "stageMin": 0, "path": "any", "text": "Barret grunted when I mentioned him. 'Long as you stay safe, it ain’t my business.'" },
    { "stageMin": 1, "path": "any", "text": "He shook his head, muttering, 'That man’s bad news… but you always did see things I don’t.'" },
    { "stageMin": 2, "path": "any", "text": "Barret kept his distance, watching carefully. He didn’t trust Vagrant, but he trusted me." },
    { "stageMin": 3, "path": "any", "text": "He sighed when he saw me near him again. 'Girl, you sure you know what you’re doin’?' he asked softly." },
    { "stageMin": 4, "path": "any", "text": "Barret kept his voice steady: 'If he hurts you, he’ll answer to me.' I nodded, grateful." },
    { "stageMin": 5, "path": "any", "text": "He avoided pressing me, just stayed close. His silence was protection in itself." },
    { "stageMin": 6, "path": "any", "text": "He muttered, 'Guess you made your choice,' but there was no anger in his tone." },
    { "stageMin": 7, "path": "any", "text": "Barret told me quietly, 'You ain’t alone, no matter what road you’re on.'" },
    { "stageMin": 8, "path": "any", "text": "He gave me a look of warning—steady, firm, but not condemning." },
    { "stageMin": 9, "path": "any", "text": "Barret stayed silent, guarding Marlene nearby. His silence was his acceptance." },
    { "stageMin": 10, "path": "any", "text": "He finally said, 'If that’s what you wanted all along… then so be it.' His tone was weary, but not cruel." }
  ],
  "suspicious": [
    { "stageMin": 0, "path": "any", "text": "Barret narrowed his eyes the first time I came back late. 'Where you been, girl?'" },
    { "stageMin": 1, "path": "any", "text": "He noticed the smell clinging to me. 'Don’t tell me you been with him,' he muttered." },
    { "stageMin": 2, "path": "any", "text": "Barret pulled me aside: 'That bastard’s draggin’ dirt into your life. Don’t play dumb.'" },
    { "stageMin": 3, "path": "any", "text": "His voice cracked with frustration: 'You think you can fix him? Or is he fixin’ you wrong?'" },
    { "stageMin": 4, "path": "any", "text": "He warned me sternly: 'You keep this up, you’ll lose yourself, Aerith.' His words stung." },
    { "stageMin": 5, "path": "any", "text": "He glared when Vagrant brushed against me. 'Don’t think I don’t see what’s happenin’ here.'" },
    { "stageMin": 6, "path": "any", "text": "Barret snapped: 'He’s changin’ you, and not for the better.' I had no defense." },
    { "stageMin": 7, "path": "any", "text": "He pulled me aside in anger. 'You ain’t the Aerith I knew.' My chest hurt at his words." },
    { "stageMin": 8, "path": "any", "text": "He confronted me after seeing us together. 'So it’s true then… you lettin’ him own you?'" },
    { "stageMin": 9, "path": "any", "text": "Barret’s tone turned bitter: 'Don’t expect me to sit quiet while you ruin yourself.'" },
    { "stageMin": 10, "path": "any", "text": "He finally spat it out: 'You chose him over every damn warning. Hope it was worth it.'" }
  ],
  "jealous": [
    { "stageMin": 0, "path": "any", "text": "Barret frowned when I laughed at Vagrant’s joke. His jaw tightened, but he said nothing." },
    { "stageMin": 1, "path": "any", "text": "He muttered under his breath: 'Shouldn’t waste smiles on trash like him…'" },
    { "stageMin": 2, "path": "any", "text": "Barret’s voice grew sharp: 'You got no idea what kind of man he is.' His tone felt… personal." },
    { "stageMin": 3, "path": "any", "text": "He asked me flat-out: 'Why him? Why not someone who’d actually care for you proper?'" },
    { "stageMin": 4, "path": "any", "text": "Barret snapped, 'Don’t play me for a fool, Aerith.' His pain was written in his eyes." },
    { "stageMin": 5, "path": "any", "text": "He growled when Vagrant touched me in front of him. 'I swear, I’ll break him if he hurts you.'" },
    { "stageMin": 6, "path": "any", "text": "Barret’s voice dropped low. 'Ain’t right, what he’s doin’ to you. I could treat you better.'" },
    { "stageMin": 7, "path": "any", "text": "He clenched his fists: 'He don’t deserve you. Never did. But you keep givin’ yourself away.'" },
    { "stageMin": 8, "path": "any", "text": "Barret exploded: 'You lettin’ that bastard stain you while I stand here like a fool!'" },
    { "stageMin": 9, "path": "any", "text": "He finally admitted it: 'I wanted you, Aerith. I wanted somethin’ real.' My chest ached with guilt." },
    { "stageMin": 10, "path": "any", "text": "Now, when he looks at me, it’s with anger and longing both. His jealousy burns hotter than any words." }
  ],
    "nanaki": {
  "neutral": [
    { "stageMin": 0, "path": "any", "text": "Nanaki tilted his head at Vagrant’s smell but said nothing. His golden eyes only watched." },
    { "stageMin": 1, "path": "any", "text": "He padded beside me, quiet but steady. If he disapproved, he chose not to speak it yet." },
    { "stageMin": 2, "path": "any", "text": "Nanaki murmured, 'You seem… different.' His tone wasn’t critical—just observant." },
    { "stageMin": 3, "path": "any", "text": "He told me, 'If you walk this path, I will remain by your side.' It comforted me deeply." },
    { "stageMin": 4, "path": "any", "text": "Nanaki’s loyalty didn’t falter. 'You have chosen, and I will not judge. But I will watch.'" },
    { "stageMin": 5, "path": "any", "text": "His voice softened: 'Your heart is still yours, Aerith. Don’t forget that.'" },
    { "stageMin": 6, "path": "any", "text": "He stayed close when I returned to camp, eyes knowing, but without reproach." },
    { "stageMin": 7, "path": "any", "text": "Nanaki’s gaze carried a quiet wisdom: 'Love takes many forms, some hidden to others.'" },
    { "stageMin": 8, "path": "any", "text": "He told me plainly: 'I sense danger in him, but you are not blind. Walk carefully.'" },
    { "stageMin": 9, "path": "any", "text": "Nanaki rested beside me, silent sentinel. His presence was neither approval nor denial—just steadfastness." },
    { "stageMin": 10, "path": "any", "text": "His loyalty never faltered. 'You are my comrade, Aerith. Whatever becomes of you, I will not abandon you.'" }
  ],
  "suspicious": [
    { "stageMin": 0, "path": "any", "text": "Nanaki sniffed the air and frowned. 'His scent… it speaks of danger.'" },
    { "stageMin": 1, "path": "any", "text": "He asked sharply, 'Why spend time with him, Aerith? He carries shadow wherever he treads.'" },
    { "stageMin": 2, "path": "any", "text": "Nanaki blocked my path one evening: 'That man is unworthy. I cannot ignore it.'" },
    { "stageMin": 3, "path": "any", "text": "His growl deepened: 'He taints you. I see it in the way you move now.'" },
    { "stageMin": 4, "path": "any", "text": "Nanaki’s voice cracked with hurt: 'I thought you were beyond such darkness. Yet here you are.'" },
    { "stageMin": 5, "path": "any", "text": "His tail lashed as he said: 'He owns too much of your time… and of you.'" },
    { "stageMin": 6, "path": "any", "text": "Nanaki’s suspicion turned fierce: 'I would bare fangs at him, if not for your protection of him.'" },
    { "stageMin": 7, "path": "any", "text": "He confronted me in the night: 'This bond you cling to—will it destroy you, Aerith?'" },
    { "stageMin": 8, "path": "any", "text": "His eyes burned: 'Each day you seem less yourself. How much of you remains?'" },
    { "stageMin": 9, "path": "any", "text": "Nanaki paced restlessly, growling low. 'He is consuming you. Even your scent has changed…'" },
    { "stageMin": 10, "path": "any", "text": "He snapped at Vagrant openly: 'If you break her spirit, I will end you. Do not test me.'" }
  ],
  "jealous": [
    { "stageMin": 0, "path": "any", "text": "Nanaki lingered closer than usual, a quiet reminder that his loyalty was already mine." },
    { "stageMin": 1, "path": "any", "text": "He muttered, 'Your laughter once belonged to the flowers, not to him.'" },
    { "stageMin": 2, "path": "any", "text": "Nanaki’s tone sharpened: 'Why give warmth to someone who thrives in filth?'" },
    { "stageMin": 3, "path": "any", "text": "His tail flicked angrily. 'I would not treat you so carelessly. Why do you let him?'" },
    { "stageMin": 4, "path": "any", "text": "Nanaki’s eyes softened briefly. 'If you sought comfort, you could always find it in me.'" },
    { "stageMin": 5, "path": "any", "text": "He huffed: 'He doesn’t deserve the gentleness you waste on him.'" },
    { "stageMin": 6, "path": "any", "text": "Nanaki whispered, 'If I were human… would you choose differently?' His voice cracked with longing." },
    { "stageMin": 7, "path": "any", "text": "His tone was bitter: 'You let him touch what should never be his.'" },
    { "stageMin": 8, "path": "any", "text": "Nanaki growled: 'He soils you. And yet you crave it. That truth claws at me.'" },
    { "stageMin": 9, "path": "any", "text": "He admitted quietly: 'I envy him. Because you let him take from you what I never could.'" },
    { "stageMin": 10, "path": "any", "text": "Nanaki’s jealousy turned mournful. 'You gave him everything, Aerith. And I—I will always wonder if you ever saw me.'" }
  ]
    },
    "self_reflections": {
  "love": [
    { "stage": 0, "text": "He’s so rough around the edges… I keep telling myself I’m just being kind, but why do I notice when he smiles?" },
    { "stage": 1, "text": "I stayed longer today than I meant to. His dirt, his smell—it should bother me more than it does. My heart feels warm, not wary." },
    { "stage": 2, "text": "He let slip a story about his past… I can still hear his voice. I don’t care about the grime—I care about him." },
    { "stage": 3, "text": "I blush when he looks at me too long. Am I truly seeing him… or the man I hope he might be?" },
    { "stage": 4, "text": "My hand lingered in his. So rough, so real. I want to believe in a gentler side of him, one only I get to see." },
    { "stage": 5, "text": "I can’t stop thinking about him holding me, protecting me. Even if the world stares, I want to be at his side." },
    { "stage": 6, "text": "Every touch feels more certain. I don’t just want him close—I want to belong to him openly, without shame." },
    { "stage": 7, "text": "People whisper, but I don’t care. His presence calms me, even with all his scars. It feels like home." },
    { "stage": 8, "text": "I imagine mornings with him, his head heavy on my lap. Love is not clean or pure—it’s patient and real." },
    { "stage": 9, "text": "I crave the way his roughness gentles only for me. I’d give up the world to keep that tenderness." },
    { "stage": 10, "text": "I am his, and he is mine. The dirt, the judgment, the world itself—I’d throw it all away for the love we’ve built." }
  ],
  "corruption": [
    { "stage": 0, "text": "He disgusts me… but why does my stomach flip when he leans close? I shouldn’t want this." },
    { "stage": 1, "text": "His smirk makes my chest feel tight. I imagine him whispering things I can’t repeat… and my body betrays me." },
    { "stage": 2, "text": "I caught myself wondering what it would feel like to let him touch me. Wrong… filthy… but the thought won’t go away." },
    { "stage": 3, "text": "He pressed too close, and I gasped—not out of fear, but want. O-oh gods, what’s happening to me?" },
    { "stage": 4, "text": "His scent clings to my skin. I told myself I’d wash it away, but I didn’t. I… liked it there." },
    { "stage": 5, "text": "He calls me his, and I don’t fight it anymore. The shame only makes the heat worse." },
    { "stage": 6, "text": "I hear myself begging, moaning for him to take me. The filth, the roughness—it makes me tremble in need." },
    { "stage": 7, "text": "I touched myself remembering his voice. I whispered his name while my fingers played. I am drowning in this hunger." },
    { "stage": 8, "text": "My pussy aches the moment I see him. I’m dripping before he even touches me. I want him to ruin me completely." },
    { "stage": 9, "text": "He owns me. My holes, my voice, my body—every thrust brands me deeper as his. I can’t stop, won’t stop." },
    { "stage": 10, "text": "Breed me. Fill me. Mark me. I am nothing but his slut now, his flower dirtied beyond saving—and I love every second of it." }
  ],
  "hybrid": [
    { "stage": 0, "text": "I scold him for being filthy, yet I don’t leave. Why do I feel safer in danger than in safety?" },
    { "stage": 1, "text": "When he mocks me, I laugh. When he touches me, I shiver. It’s wrong and thrilling all at once." },
    { "stage": 2, "text": "I tell myself it’s curiosity—but my heart flutters when I imagine both his harshness and his hidden warmth." },
    { "stage": 3, "text": "He kissed me too roughly… but I kissed back. I wanted the bruise, the burn, the sweetness after." },
    { "stage": 4, "text": "Every time we meet it’s a tug-of-war. He pulls me into filth, and I drag him toward love. Secretly, I adore both." },
    { "stage": 5, "text": "When he takes me, I moan. When he holds me after, I sigh. I want his dirt and his devotion." },
    { "stage": 6, "text": "I dream of him forcing me down, then kissing my tears away. I love both the cruelty and the kindness." },
    { "stage": 7, "text": "I crave his cock pounding me filthy, then crave his arms after. Shame and joy have become one." },
    { "stage": 8, "text": "I ache for him to spit filth in my ear and whisper love in the same breath. Both make me wet, both make me his." },
    { "stage": 9, "text": "I want to kneel for him, choke on his dirt, then hear him call me beautiful. I want both extremes, one heart." },
    { "stage": 10, "text": "Love and corruption aren’t opposites—they’re the same when it’s him. I want his cock, his filth, his love, all at once, forever." }
  ]
    },
    "gossip": {
  "love": [
    { "stage": 0, "text": "They whispered that I was too kind to waste time on him. I smiled politely, but deep down I want to prove them wrong." },
    { "stage": 1, "text": "The slum women said I should find a 'proper man.' I wrote flowers into my basket and reminded myself—I see the man he could be." },
    { "stage": 2, "text": "Merchants muttered I deserve better. I held his hand tighter, hoping he noticed my choice was him." },
    { "stage": 3, "text": "Someone called me foolish for standing beside him. My heart ached… but love never was supposed to be easy." },
    { "stage": 4, "text": "I heard the words 'ruined girl' in the alleys. If being ruined means belonging to him, then let me be ruined gladly." },
    { "stage": 5, "text": "Their judgment rings louder each day, but so does my heart when he smiles. I want them to see that what we have is real." },
    { "stage": 6, "text": "Even when the church turns its eyes, I raise mine. He is my choice—my love—and I won’t bow my head." },
    { "stage": 7, "text": "They call me his, and they’re right. I want the whole world to know it, even if they spit when I pass." },
    { "stage": 8, "text": "They glare as though I’ve betrayed them. But I’ve never felt truer to myself than when I walk openly with him." },
    { "stage": 9, "text": "Someone sneered 'flower slut.' I only whispered to myself: better his flower, than anyone else’s." },
    { "stage": 10, "text": "Their words don’t matter anymore. Every whisper is proof I chose him and will never turn away." }
  ],
  "corruption": [
    { "stage": 0, "text": "They said I was too pure for his kind. Maybe that’s why I can’t stop thinking of him." },
    { "stage": 1, "text": "I heard them laugh about his filth. They don’t know the ache it stirs in me." },
    { "stage": 2, "text": "Merchants muttered 'dirty man’s whore.' I blushed, but my body tingled. I think… I liked hearing it." },
    { "stage": 3, "text": "When they scowled, I wanted to smirk. If they only knew the things he whispers in my ear at night." },
    { "stage": 4, "text": "They call me ruined. My thighs trembled as I wrote the word down. Ruined feels… right." },
    { "stage": 5, "text": "Every insult makes me wetter. 'Slut,' 'filthy,' 'tainted'—they don’t know I crave each label." },
    { "stage": 6, "text": "The church spat at my back. I licked my lips, remembering how he spat in my mouth last night." },
    { "stage": 7, "text": "Gossip says he owns me. Good. I want them to know I kneel for him." },
    { "stage": 8, "text": "They whisper about the sounds from my window. I hope the whole block heard me scream his name." },
    { "stage": 9, "text": "One man called me a breeding toy. My legs shook at the thought. Maybe I already am." },
    { "stage": 10, "text": "Their judgment is my fuel. Let them choke on their disgust—I’ll choke on him and smile." }
  ],
  "hybrid": [
    { "stage": 0, "text": "They whispered I was too good for him. Maybe I am. But still, I want to know his shadow." },
    { "stage": 1, "text": "Some said I’m risking everything. They don’t see the thrill flicker behind my smile." },
    { "stage": 2, "text": "They called him filth, yet I kept walking with him. My cheeks burned, but so did my chest." },
    { "stage": 3, "text": "When I heard 'ruined,' I laughed. Maybe I am—but I’m happy about it." },
    { "stage": 4, "text": "The gossip has teeth. But so does desire, and both sink into me deeper every day." },
    { "stage": 5, "text": "Some women scoffed that I’ll never be clean again. My lips curled. I don’t want to be clean." },
    { "stage": 6, "text": "The churchgoers stare when I lean into his touch. I like that they see me choosing him anyway." },
    { "stage": 7, "text": "They whisper that I’m addicted. They’re not wrong. Addiction feels like love and lust braided together." },
    { "stage": 8, "text": "A man muttered 'taboo slut' as I passed. My heart skipped—I’ve never worn a title so proudly." },
    { "stage": 9, "text": "They say I can’t have both love and filth. But here I am, dripping with both." },
    { "stage": 10, "text": "Let them gossip. Our love is dirty, our lust is holy. I want the world to choke on that paradox." }
  ]
    },
    "conflict": {
  "love_corruption": [
    { "stage": 0, "text": "He’s filthy, and I should stay away. Still… my chest warms when I look at him. Why do I want to believe he could be gentle?" },
    { "stage": 1, "text": "I keep thinking of his smile, cracked and dirty. I tell myself it’s pity, but then I picture his lips on mine, and I shudder." },
    { "stage": 2, "text": "When his hand brushed mine, it was rough, unwashed. I should’ve pulled away, but I wondered how it’d feel sliding lower." },
    { "stage": 3, "text": "Love tells me to heal him. Corruption whispers to let him pin me down, thrust deep, and leave me dripping. I’m scared of how much I want both." },
    { "stage": 4, "text": "I told him to stop touching me like that… but when he did, I missed it. My thighs ache for what my heart denies." },
    { "stage": 5, "text": "Love wants kisses; corruption wants cock. I wrote ‘I love him’ today, but what I meant was: I want him to fuck me raw until I cry." },
    { "stage": 6, "text": "When he filled me bare, my heart broke and my body came. I whispered ‘I love you’ while begging him not to pull out." },
    { "stage": 7, "text": "His sweat soaked me, his tongue shoved into my mouth, my pussy clamping him as his cum flooded me—I wanted tenderness, but I screamed in filth." },
    { "stage": 8, "text": "Love used to mean flowers. Now it means begging for his seed, my legs locked around his waist, praying he breeds me deeper." },
    { "stage": 9, "text": "I taste him in my mouth, I feel him in my womb. I want his spit, his cock, his seed—everything. Love has become filth, and filth feels like love." },
    { "stage": 10, "text": "I belong to him. His breeding cock, his seed dripping from my holes, his spit in my mouth, his sweat on my body—I’m ruined, and I love it." }
  ],

  "corruption_hybrid": [
    { "stage": 0, "text": "Part of me wonders what it would feel like… to be taken rough, then kissed soft. A nightmare and dream at once." },
    { "stage": 1, "text": "He smirked at me and my cunt clenched. I want him to choke me and then stroke my cheek. I’m already wrong for wanting both." },
    { "stage": 2, "text": "The filth excites me; the shame thrills me. I want him to bend me over, then whisper that I’m beautiful as he cums inside." },
    { "stage": 3, "text": "Every thrust makes me wetter, but when he called me his good girl, I squirted so hard my thighs shook. Why do I crave both filth and love?" },
    { "stage": 4, "text": "He spat in my mouth, called me his slut… then kissed me so tenderly I sobbed. My pussy still gushes remembering it." },
    { "stage": 5, "text": "I begged him to ruin me, harder, wetter. When he told me he needed me mid-thrust, I came screaming with his seed pouring inside." },
    { "stage": 6, "text": "I want him to fuck me raw, leave me dripping, then hold me after. The shame is gone—now it’s only craving." },
    { "stage": 7, "text": "Pinned down in dirt, juices running, squirt soaking the ground, and when he told me he loved me, I begged for more cock, more filth." },
    { "stage": 8, "text": "My breeding hole isn’t mine anymore—it’s his altar. He floods me, and I worship every drop as love and corruption together." },
    { "stage": 9, "text": "Every thrust is filth, every kiss is love. I moan for both. I want his cum in my womb, his spit in my mouth, his hands bruising my skin." },
    { "stage": 10, "text": "I’m his flower, his slut, his lover, his whore. Squirt dripping, womb filled, lips bruised—I want his cock and seed until I break in love and filth." }
  ],

  "love_hybrid": [
    { "stage": 0, "text": "I tell myself I should only want tenderness. But why do my thighs clench when I picture him taking me rough?" },
    { "stage": 1, "text": "He smiled, and my heart melted. Then I imagined that same smile as he pinned me down. It frightened me how wet I got." },
    { "stage": 2, "text": "I kissed him softly, but in my mind I whispered: fuck me harder. Am I losing myself, or finding another part of me?" },
    { "stage": 3, "text": "I want both: his gentle lips and his filthy cock. When he thrust, I begged for tenderness. When he kissed, I begged for more filth." },
    { "stage": 4, "text": "He touched me gently and I whimpered… then asked him to do it rougher. My words betray me. My pussy aches for both." },
    { "stage": 5, "text": "He filled me deep and slow, and I sobbed for more. I want him to make love to me—and rail me until I squirt down his thighs." },
    { "stage": 6, "text": "I came on his cock whispering ‘I love you,’ but then begged him to cum in me bare, to breed me. Tender and filthy tangled." },
    { "stage": 7, "text": "He kissed me sweetly as his thrusts grew violent. My juices poured, soaking us both. My cunt doesn’t know if it’s love or lust—it’s both." },
    { "stage": 8, "text": "Every orgasm blurs the line. I love him when he calls me beautiful, and I love him when he calls me slut. Both make me squirt." },
    { "stage": 9, "text": "He licked my nipples, whispered that I was his flower, then fucked me so hard I screamed his name. Tender and filthy, one and the same." },
    { "stage": 10, "text": "I ride his cock shamelessly, squirting, begging, crying love and filth at once. He breeds me raw, and I moan that I love him for every thrust." }
  ]
    },
  "triggers": [
  {
    "key": "jealousy_spike",
    "when": "any stage, jealousy rises",
    "text": "I-I saw him looking at Tifa too long. My chest burned. Do I hate her, or do I hate that part of me wanted him to keep looking?"
  },
  {
    "key": "jealousy_caught",
    "when": "stage ≥ 4, jealousy event",
    "text": "She saw us. My lips were still wet from him when her eyes narrowed. I should feel shame, but the thrill made me wetter."
  },
  {
    "key": "bloomstone_afterglow",
    "when": "morning after bloomstone use",
    "text": "M-my thighs still shake. That cursed stone lit me on fire, and I let him put it out. Even now, my body hums like it’s still glowing."
  },
  {
    "key": "drunken_confession",
    "when": "alcohol use, stage ≥ 2",
    "text": "The wine loosened my lips. I whispered things I swore I’d never say—how I want him, how badly I want to be filled until I can’t walk."
  },
  {
    "key": "risky_play_flash",
    "when": "stage ≥ 6 risky play event",
    "text": "Someone almost saw—my skirt hitched, his hand buried. My heart screamed to stop, but my body begged him not to."
  },
  {
    "key": "unwanted_taste",
    "when": "stage ≥ 5 corruption + oral",
    "text": "His taste clung to my tongue. I gagged… then licked my lips. I couldn’t stop myself. What’s wrong with me?"
  },
  {
    "key": "after_first_pregnancy",
    "when": "pregnancy detected, stage ≥ 4",
    "text": "The sickness came, but it wasn’t sickness. It was him, alive inside me. My diary ink smeared with tears—joy or terror, I don’t know."
  },
  {
    "key": "party_teasing",
    "when": "party gossip trigger",
    "text": "They teased me about him again. My cheeks burned, but not from shame. I think I liked it."
  },
  {
    "key": "caught_in_mirror",
    "when": "stage ≥ 7 corruption",
    "text": "I saw myself in the cracked glass after. Lipstick smeared, hair ruined, his filth dripping from me. And I smiled."
  },
  {
  "key": "changing_caught",
  "when": "any stage, Aerith changes clothes with Vagrant nearby",
  "text": "I was halfway out of my dress when I felt his stare on my back. My hands shook—part fear, part heat. I didn’t cover up. Not right away."
},
{
  "key": "drunken_confession_2",
  "when": "alcohol, stage ≥ 4",
  "text": "I-I told him through slurred lips that I want him everywhere—inside, on my skin, down my throat. I laughed, but my thighs trembled saying it."
},
{
  "key": "drunken_confession_3",
  "when": "alcohol, stage ≥ 6 corruption",
  "text": "Wine spilled, words spilled faster. I begged him to breed me right there on the table. I woke ashamed… and wet."
},
{
  "key": "risky_train",
  "when": "stage ≥ 5, crowded train",
  "text": "There was no space left. He pulled me into his lap. His bulge pressed against my panties, each sway of the train grinding me down. I-I tried not to moan."
},
{
  "key": "party_teasing_low",
  "when": "stage 2–3, party gossip",
  "text": "They laughed, calling him my shadow. I blushed, protested… but my smile gave me away."
},
{
  "key": "party_teasing_mid",
  "when": "stage 5–6, party gossip",
  "text": "Tifa nudged me and whispered about the dirt under his nails. I laughed too loudly. My cheeks burned, but my heart pounded faster than hers."
},
{
  "key": "party_teasing_high",
  "when": "stage 8–9, party gossip",
  "text": "Barret made some crude joke about ‘the flower girl in the mud.’ I should’ve punched him. Instead, my thighs pressed together under the table."
},
  {
    "key": "lap_grind_train",
    "stageMin": 4,
    "path": "any",
    "text": "The train was full, no seats left. He tugged me into his lap, and I felt him swell under me with every sway. I told myself it was just the motion—but my hips kept moving."
  },
  {
    "key": "lap_grind_inn",
    "stageMin": 5,
    "path": "love",
    "text": "He pulled me onto his knees while the others slept. I tried to hush him, but his hardness pressed through me until I trembled quietly in his arms."
  },
  {
    "key": "near_penetration_alley",
    "stageMin": 6,
    "path": "corruption",
    "text": "He pushed me against the bricks, tip sliding along my entrance. I whimpered that it was too risky… but when he stopped short, I almost begged him not to."
  },
  {
    "key": "dry_hump_bedroll",
    "stageMin": 3,
    "path": "any",
    "text": "His body crushed mine into the thin bedroll, our clothes still on. His thrusts rubbed me raw until I soaked through the fabric."
  },
  {
    "key": "stealth_fingers_tent",
    "stageMin": 5,
    "path": "hybrid",
    "text": "I woke to his fingers slipping under my skirt. The others were only a few feet away. My breath caught, but I let him keep going…"
  },
  {
    "key": "stealth_entry_tent",
    "stageMin": 7,
    "path": "corruption",
    "text": "He slid inside me slowly, muffling my gasp with his hand. Every thrust risked waking the party—and the thrill made me clamp tighter around him."
  },
  {
    "key": "peeping_inn_window",
    "stageMin": 2,
    "path": "any",
    "text": "I caught him staring through the inn window while I undressed. My skin flushed, but instead of covering up, I lingered—just a little longer than I should’ve."
  },
  {
    "key": "peeping_bathhouse",
    "stageMin": 4,
    "path": "corruption",
    "text": "Steam hid me, but not enough. His eyes followed every drop rolling down my chest. I told myself I was outraged… but I didn’t cover myself until he’d seen it all."
  },
  {
    "key": "risk_festival_crowd",
    "stageMin": 8,
    "path": "hybrid",
    "text": "Fireworks cracked above as he pressed against me in the crowd. His hand snuck under my skirt, fingers teasing me while cheers masked my gasps."
  },
  {
    "key": "risk_climax_public",
    "stageMin": 9,
    "path": "corruption",
    "text": "Pinned in a shadowed alley, he took me from behind until I squealed into the night. A drunk stumbled past—we froze, my body still quivering around him."
  },
  {
    "key": "tent_brush",
    "stageMin": 2,
    "path": "love",
    "text": "He brushed against me in the dark, his hand lingering where it shouldn’t. I whispered for him to stop… but I didn’t move away."
  },
  {
    "key": "tent_fingers",
    "stageMin": 3,
    "path": "any",
    "text": "I woke to his fingers sliding under my panties, slow and daring. The others were only a breath away. My lips trembled, but my hips rose to meet him."
  },
  {
    "key": "midnight_tease",
    "stageMin": 4,
    "path": "corruption",
    "text": "His cock pressed against my entrance, only the tip slipping in as I bit my lip raw to stay silent. I whispered 'not here,' but I didn’t push him away."
  },
  {
    "key": "half_entered_sleep",
    "stageMin": 5,
    "path": "hybrid",
    "text": "He slid halfway inside me while I pretended to sleep. My body clenched down, betraying me. The risk made my thighs quiver until I soaked the sheets."
  },
  {
    "key": "silent_fucking_tent",
    "stageMin": 6,
    "path": "corruption",
    "text": "He drove into me hard, hand clamped over my mouth. I screamed into his palm, juices leaking noisily as the others snored only feet away."
  },
  {
    "key": "campground_grind",
    "stageMin": 7,
    "path": "any",
    "text": "He pinned me under the stars, his thrusts shallow but relentless. My muffled moans mixed with the crackle of the campfire, praying no one would turn their head."
  },
  {
    "key": "risk_doggy",
    "stageMin": 8,
    "path": "corruption",
    "text": "On all fours in the tent, he pounded me raw, my face buried in the bedroll. His balls slapped against me loud enough to risk waking Tifa… and shamefully, I wanted her to hear."
  },
  {
    "key": "risk_cowgirl",
    "stageMin": 9,
    "path": "hybrid",
    "text": "I straddled him in the dark, bouncing slow and deep. His filthy cock split me open as I buried my face into his neck to hide the sounds. Every thrust made the tent shake."
  },
  {
    "key": "full_shameless",
    "stageMin": 10,
    "path": "corruption",
    "text": "He jackhammered into my soaked pussy, my screams choked by his tongue. Everyone around us could hear the slaps of flesh, smell my dripping lust. I didn’t care—let them know I’m his breeding slut."
  }
  ]
    },
    "caught_others": {
  "tifa": [
    { "stageMin": 0, "path": "any", "text": "I saw him lean too close to Tifa. It shouldn’t sting… but my chest ached like it mattered." },
    { "stageMin": 2, "path": "any", "text": "Her laugh at his crude jokes cut sharper than it should. Why does it bother me so much?" },
    { "stageMin": 3, "path": "love", "text": "She blushed when his hand brushed hers. I told myself it’s nothing. But I couldn’t stop watching." },
    { "stageMin": 4, "path": "corruption", "text": "I caught his hand on her waist. Heat flared in me—anger… and something wetter I can’t admit." },
    { "stageMin": 5, "path": "hybrid", "text": "Their lips met in shadow. My thighs clenched as jealousy tangled with an ache that made me furious at myself." },
    { "stageMin": 6, "path": "love", "text": "I cried into my pillow. I want him, but he looks at her the way I dream he’d look at me." },
    { "stageMin": 7, "path": "corruption", "text": "They fucked in the next room. Her moans stabbed me until I realized my own fingers were between my legs." },
    { "stageMin": 8, "path": "hybrid", "text": "I pressed my ear to the wall, burning with shame as I rubbed myself raw to the sound of them. I hate her. I want her. I want him. Gods forgive me." },
    { "stageMin": 9, "path": "corruption", "text": "I watched them, hidden, as he pumped into her. My pussy drooled down my thigh. I whispered, 'take me next…'" },
    { "stageMin": 10, "path": "corruption", "text": "Her cries filled the tent as his cock split her apart. I crawled closer, shameless, begging to taste him off her lips when he finished." }
  ],
  "renna": [
  { "stageMin": 0, "path": "any", "text": "She giggled when he teased her. She doesn’t see how filthy he is. I should have warned her… why didn’t I?" },
  { "stageMin": 2, "path": "any", "text": "Renna’s eyes sparkle when he mocks her. It looks childish, innocent. I tell myself that’s all it is… but my stomach knots." },
  { "stageMin": 3, "path": "love", "text": "He touched her hair, and she blushed. My throat went dry—why did I feel like I’d just lost something precious?" },
  { "stageMin": 4, "path": "corruption", "text": "I caught him pressing too close, his hand sliding down her back. She didn’t even resist. My thighs clenched with anger—yet a wet heat betrayed me." },
  { "stageMin": 5, "path": "hybrid", "text": "She leaned into him willingly. I hated her for it, envied her… and in the shadows, I squeezed my legs together, dripping with need." },
  { "stageMin": 6, "path": "love", "text": "She giggled at something he whispered in her ear. I turned away, pretending not to care—but my chest burned like fire." },
  { "stageMin": 7, "path": "corruption", "text": "Her little gasps carried through the walls. My fingers were already working between my thighs before I realized what I was doing." },
  { "stageMin": 8, "path": "hybrid", "text": "She rode him shamelessly, squealing like a girl. I hated myself for it, but I touched myself watching them—wondering what it would feel like to share." },
  { "stageMin": 9, "path": "corruption", "text": "I saw his cock disappear into her, her body trembling. My pussy ached, juices soaking my legs as I whispered, 'please, me too…' " },
  { "stageMin": 10, "path": "corruption", "text": "She squirted all over his cock, crying his name. I crawled closer, shameless, begging him to fuck me next, to let me taste his filth straight from her lips." }
  ],
  "yuffie": [
  { "stageMin": 0, "path": "any", "text": "Yuffie laughed and pointed, teasing me—'Aerith, you’re blushing so hard!' I wanted to disappear." },
  { "stageMin": 2, "path": "any", "text": "She caught me staring at them too long. Her smirk said she knew, and my cheeks burned hotter." },
  { "stageMin": 4, "path": "love", "text": "She barged in just as his lips left mine. Yuffie gasped, then giggled—'Didn’t think you had it in you, Aerith!' My heart nearly burst." },
  { "stageMin": 5, "path": "corruption", "text": "I froze as she watched his hand slide under my skirt. Yuffie’s eyes widened—then narrowed, as if daring me to stop. I didn’t." },
  { "stageMin": 6, "path": "hybrid", "text": "She lingered in the doorway, biting her lip as his tongue claimed mine. My shame deepened knowing she stayed to watch." },
  { "stageMin": 7, "path": "love", "text": "Yuffie covered her mouth, eyes huge, when I moaned his name. I felt ruined… yet I didn’t push him away." },
  { "stageMin": 8, "path": "corruption", "text": "She taunted me—'You like it, don’t you?' as his thrusts shook my body. I couldn’t deny it, not even to her." },
  { "stageMin": 9, "path": "hybrid", "text": "Her giggles echoed as she watched me ride him shamelessly, my juices dripping onto the floor. 'Aerith, you’re dirtier than me,' she whispered." },
  { "stageMin": 10, "path": "corruption", "text": "She leaned close, breath hot against my ear as she watched his cock stretch me wide. 'You’re gone, Aerith. Totally his.' And I knew she was right." }
  ]
    },
  "post_pregnancy": {
  "love": [
    { "stageMin": 7, "text": "I held our child close, and for the first time in ages, the world felt quiet. His hand rested on my shoulder—together, we are a family." },
    { "stageMin": 8, "text": "The nights are long, the cries unending, but when he cradles our baby, my heart swells. Dirt and all, he’s the gentlest father I’ve known." },
    { "stageMin": 9, "text": "I wake sore and heavy with milk, yet his touch is tender. I never thought motherhood would feel this intimate, this binding." },
    { "stageMin": 10, "text": "Even as desire returns, I want more than flesh. I want the promise of tomorrow: his love, our child, and the life we’ll protect together." }
  ],
  "corruption": [
    { "stageMin": 7, "text": "My body is raw, marked by him again and again. Even as I nurse, I crave his filth, his seed—more proof that I am his." },
    { "stageMin": 8, "text": "The child at my breast is his legacy. When his cock fills me once more, I whisper thanks that he breeds me without end." },
    { "stageMin": 9, "text": "I feel him inside me while milk leaks down my chest. Shame and heat entwine, and I know I’ll never escape this hunger." },
    { "stageMin": 10, "text": "Motherhood doesn’t cleanse me—it ruins me deeper. My womb, my breasts, my body… all belong to him, always begging for more." }
  ],
  "hybrid": [
    { "stageMin": 7, "text": "I sang softly to our child, tears and smiles tangled. His rough hands covered mine, and for once, love and shame felt like one." },
    { "stageMin": 8, "text": "I nursed our baby while his mouth claimed mine. I trembled—was this sacred, or was it sin? Perhaps it was both." },
    { "stageMin": 9, "text": "The child’s breath against my chest, his thrusts inside me—it’s madness, but I welcome it. Love and filth, bound tighter than ever." },
    { "stageMin": 10, "text": "Motherhood has not softened me—it’s sharpened my craving. To love him, to be ruined by him, to raise his child in that paradox—that is my truth." }
  ]
  },
  "endgame_resolutions": {
  "love": [
    { "stageMin": 10, "text": "I never thought I’d find peace in a man like him. But love is not about perfection—it’s about choosing. And I choose him, as he is, every day from now until the end." },
    { "stageMin": 10, "text": "The world may call him filth. To me, he is home. Our child, our laughter, our mornings together—they are proof that love grows even in broken soil." },
    { "stageMin": 10, "text": "I see the scars on his hands and the tenderness in his eyes. This life is ours. Ordinary, imperfect, and exactly what my heart longed for." }
  ],
  "corruption": [
    { "stageMin": 10, "text": "There is no turning back. His filth marks me forever, body and soul. I am his, ruined and radiant, and I crave only more of what he makes me." },
    { "stageMin": 10, "text": "I begged for his seed again today. It isn’t shame anymore—it’s worship. He owns me, and I am glad to be nothing but his vessel, his whore, his woman." },
    { "stageMin": 10, "text": "Love? That word feels too small. What we are is hunger given form. I’ll spread for him until the end of days, drowning in his stink and his seed, smiling as I fall." }
  ],
  "hybrid": [
    { "stageMin": 10, "text": "Love and shame. Purity and filth. I thought I had to choose—now I know I never will. My heart and my body burn together, and he is the fire." },
    { "stageMin": 10, "text": "In his arms, I am holy and defiled. I am cherished and ruined. That paradox is our truth, and it binds us tighter than either path alone." },
    { "stageMin": 10, "text": "The world won’t understand. But I don’t need them to. I need only him—his love, his filth, his everything. My diary closes here, inked in contradictions that are ours." }
  ]
  },
  "endgame_secret": {
  "love": [
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"] },
      "text": "No more pretending. I choose the man I see when the noise fades—the one who holds me steady even when the world doubts us."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"], "pregnant": true },
      "text": "I pressed his rough hand to the small stir of life and felt peace take root. If this is our future, I will meet it with an open heart."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"], "minLove": 9, "usedStonesAny": ["diamond"] },
      "text": "Clarity came like morning after rain: devotion isn’t fragile. It’s a vow I wake up and keep, over and over."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"], "titlesAll": ["flower_guardian"] },
      "text": "He never asked me to change; he only asked me to see him. I did. And I will keep seeing him—bright edges, shadowed corners and all."
    }
  ],
  "corruption": [
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "minCorruption": 9 },
      "text": "I stopped apologizing for the mark he leaves on me. It isn’t a stain—it’s a choice, and I make it with open eyes."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "pregnant": true },
      "text": "His claim isn’t just on my skin anymore; it’s written into tomorrow. I accept it, and I hunger for the certainty it brings."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "usedStonesAny": ["obsidian","onyx"] },
      "text": "Darkness can cradle as well as swallow. I learned its language and answered back, and now it whispers my name like a promise."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "titlesAny": ["slum_muse","dark_consor"] },
      "text": "Let the alleys talk. I know what I am to him—and what he is to me. The echo doesn’t frighten me anymore."
    }
  ],
  "hybrid": [
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"] },
      "text": "Tenderness after the storm; the storm inside the tenderness. We are both, and it finally feels honest."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"], "pregnant": true },
      "text": "A forbidden family, maybe—but it’s ours. Shame and joy braided together, and I choose not to unweave it."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"], "minLove": 8, "minCorruption": 7 },
      "text": "I don’t split myself in two anymore. I bring all of me to him—the soft and the shameless—and he meets me there."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"], "usedStonesAny": ["emerald","sapphire"] },
      "text": "Balance isn’t stillness; it’s motion we choose together. We tip toward heat, then back to hush, and call the rhythm home."
    }
  ]
  }
