{
  "version": "1.0",
  "characterId": "aerith",
  "desires": {
    "vagrant": {
      "love": [
        "Stage 0 — I met him among the alleys; beneath the filth I sense a loneliness I can’t turn away from.",
        "Stage 1 — If he’d let me close, I’d show him he’s more than the dirt the world sees.",
        "Stage 2 — His rough smile is cracked, but when it’s for me I feel warm all the way through.",
        "Stage 3 — I want to be the person who coaxes gentleness out of him, even if my hands come away stained.",
        "Stage 4 — Love can hold contradictions: I can cherish him as he is and still wish to heal what hurts.",
        "Stage 5 — No matter what others smell or say, I choose him; I want a future woven from tenderness and grit."
      ],
      "corruption": [
        "Stage 0 — He is unwashed and shameless; the wrongness lingers on my skin… and it won’t leave my thoughts.",
        "Stage 1 — The weight of his presence clings like smoke; fear mixes with a heat I don’t understand.",
        "Stage 2 — When he leans close, the filth feels like a claim; my breath catches and I don’t pull away.",
        "Stage 3 — I want him to mark me so the world knows I’m his—terrible and thrilling in the same breath.",
        "Stage 4 — The more he tests my limits, the more I find new ones to surrender; I ache for the surrender itself.",
        "Stage 5 — Let me be his without pretense; stain me with him until even my doubts carry his scent."
      ],
      "hybrid": [
        "Stage 0 — He’s everything I should refuse, yet part of me leans closer just to see what happens.",
        "Stage 1 — Sin and softness together tempt me: his filth, my care; my blush, his smirk.",
        "Stage 2 — If loving him means touching what’s forbidden, then let my hands be honest and my heart be brave.",
        "Stage 3 — Shame turns to thrill when it’s ours; I want the secret and the sweetness in the same heartbeat.",
        "Stage 4 — This feels like choosing fire and rain at once; I want both the scorch and the bloom.",
        "Stage 5 — I accept the paradox: tender devotion wrapped in taboo—our own kind of pure."
      ]
    }
  },
  "witnessed": {
    "vagrant": {
      "tifa": [
        { "stage": 0, "path": "love",       "text": "Tifa’s nose wrinkled at his smell; still, her eyes lingered a second too long. I felt a pinch of something I won’t name." },
        { "stage": 1, "path": "corruption", "text": "He stood too close to Tifa; the air turned heavy. My pulse stuttered—disgust, envy, and a spark I shouldn’t feel." },
        { "stage": 2, "path": "hybrid",     "text": "She didn’t flinch this time. I hated that I noticed… and that part of me wished it was me instead." },
        { "stage": 3, "path": "love",       "text": "They spoke in low tones; his roughness softened. It hurt—and yet I smiled for both of them." },
        { "stage": 4, "path": "corruption", "text": "Her breath hitched when he leaned in. The alley felt too warm; jealousy braided with a darker want." },
        { "stage": 5, "path": "hybrid",     "text": "Filth and closeness and something tender—between them, and inside me. I’m frightened by how much I understand." }
      ],
      "renna": [
        { "stage": 0, "path": "love",       "text": "Renna laughed off his mockery, unbothered by the grime. I wish I could be so light." },
        { "stage": 1, "path": "corruption", "text": "She let him crowd her space—reckless, smiling. I felt heat rise in my cheeks for reasons I won’t write twice." },
        { "stage": 2, "path": "hybrid",     "text": "Her ease with him pricked me; I envied her boldness and feared where it leads." },
        { "stage": 3, "path": "love",       "text": "She teased him into a softer mood. I caught myself rooting for them—and then for myself." },
        { "stage": 4, "path": "corruption", "text": "He tested her with a daring touch; she didn’t pull away. My heart pounded in something like approval." },
        { "stage": 5, "path": "hybrid",     "text": "Watching them felt like watching a secret I already share: danger, laughter, and a choice to keep wanting." }
      ],
      "yuffie": [
        { "stage": 0, "path": "love",       "text": "Yuffie joked about his stink and made even him laugh. I laughed, too—traitorously." },
        { "stage": 1, "path": "corruption", "text": "She tossed him a grin that said: your dirt doesn’t scare me. The thrill in my chest startled me." },
        { "stage": 2, "path": "hybrid",     "text": "She turned grime into a game. I wondered what it would be like to play along." },
        { "stage": 3, "path": "love",       "text": "He softened around her mischief; I understood the charm—and felt my own grow sharper." },
        { "stage": 4, "path": "corruption", "text": "Her teasing let him be bolder. My breath quickened, jealous and fascinated in equal measure." },
        { "stage": 5, "path": "hybrid",     "text": "This triangle of jokes and heat felt inevitable; I wrote the truth: I want what she has, and what I have, too." }
      ]
    }
  },
  "events": {
    "intro": [
      { "key": "first_meeting",      "stageMin": 0, "path": "any", "text": "I met him in the slums—rags, smoke, and eyes that dared me to care. I did." },
      { "key": "first_conversation", "stageMin": 0, "path": "any", "text": "He called me too clean for these alleys. I stayed anyway; something in me wanted to prove him wrong." }
    ],
    "intimacy": [
      { "key": "first_touch", "stageMin": 1, "path": "any", "text": "His fingers grazed mine—rough and unwashed—and my skin lit like a match." },
      { "key": "first_kiss",  "stageMin": 2, "path": "any", "text": "He tasted of ash and sweat; it should have repelled me. I leaned in instead." },
      { "key": "quiet_hold",  "stageMin": 3, "path": "love", "text": "We said nothing. His weight, his warmth, the grime—somehow it felt like safety." },
      { "key": "claimed_whisper", "stageMin": 4, "path": "corruption", "text": "He murmured at my ear that I’m his. The word sank deep; I didn’t fight it." }
  { "key": "shared_blanket", "stageMin": 1, "path": "any", "text": "It was freezing, and he pulled the blanket over both of us. His chest brushed my back—hard, rough, but I didn’t pull away." },

  { "key": "accidental_straddle", "stageMin": 2, "path": "any", "text": "I tripped while reaching for my bag, and ended up straddling him. His hands held me steady a moment too long. My cheeks burned." },

  { "key": "neck_kiss", "stageMin": 2, "path": "corruption", "text": "His lips grazed my neck—filthy breath and all. I gasped before I could stop myself, shame flooding through me." },

  { "key": "forehead_kiss", "stageMin": 2, "path": "love", "text": "He pressed a rough kiss against my forehead. Such a small gesture, but my heart felt full." },

  { "key": "lap_rest", "stageMin": 3, "path": "any", "text": "I fell asleep with my head in his lap. His scent clung to my hair; I dreamed of him." },

  { "key": "wall_pin", "stageMin": 3, "path": "corruption", "text": "He cornered me against the wall, his body trapping mine. I should’ve screamed, but my lips parted instead." },

  { "key": "slow_undress", "stageMin": 3, "path": "hybrid", "text": "He tugged at my clothes gently, almost playfully. I laughed nervously, then let him continue." },

  { "key": "bite_mark", "stageMin": 4, "path": "corruption", "text": "His teeth sank into my shoulder. It hurt. I moaned anyway." },

  { "key": "afterglow_whisper", "stageMin": 4, "path": "love", "text": "Afterwards, his arms were tight around me. He whispered my name like it meant something. I wanted to believe it." },

  { "key": "mirror_play", "stageMin": 5, "path": "corruption", "text": "He made me look into the cracked mirror while he moved against me. My face was flushed, filthy… his." }
      
      { "key": "tent_caught_cloud", "stageMin": 3, "path": "love", "text": "He pressed me down in the tent, lips trailing lower—when Cloud’s voice called from outside. I shoved Vagrant back, cheeks burning. Cloud peeked in just as we scrambled apart." },

{ "key": "inn_tifa_walkin", "stageMin": 3, "path": "any", "text": "At the inn he kissed me hard against the bedpost. Tifa opened the door suddenly. My hair was a mess, lips swollen—I pretended we were just talking, but her eyes lingered too long." },

{ "key": "cave_whisper_barret", "stageMin": 4, "path": "any", "text": "In the cave shadows he whispered filth against my ear, his hand wandering. Barret’s torchlight flickered close, his heavy steps echoing. We stilled, breathless, until he passed." },

{ "key": "market_yuffie_spot", "stageMin": 4, "path": "corruption", "text": "He cornered me in the market stalls, mouth on mine. When I opened my eyes Yuffie was there—grinning, watching. I shoved him away, but the heat in me refused to fade." },

{ "key": "campfire_nanaki", "stageMin": 5, "path": "hybrid", "text": "We lay too close by the campfire, his hand beneath my clothes. Nanaki lifted his head, ears twitching. He didn’t speak, but I know he saw—and still I didn’t stop." },
      [
  { "key": "shared_cup", "stageMin": 1, "path": "any", "text": "He handed me a drink without wiping the rim. I hesitated, then sipped anyway. His eyes caught mine when I did." },
  { "key": "brushed_cheek", "stageMin": 1, "path": "any", "text": "His rough fingers brushed dirt from my cheek. I told myself it was only kindness, but my heart jumped." },
  { "key": "shoulder_rest", "stageMin": 2, "path": "any", "text": "I nodded off leaning on his shoulder. He didn’t move away, and I pretended not to notice." },
  { "key": "midnight_confession", "stageMin": 2, "path": "love", "text": "By lantern light he admitted he dreamed of leaving the slums. I touched his hand. Maybe he meant leaving with me." },
  { "key": "accidental_brush", "stageMin": 2, "path": "hybrid", "text": "Our hands brushed too many times to be accidents. He smirked; I swallowed my scolding." },
  { "key": "neck_whisper", "stageMin": 3, "path": "corruption", "text": "He leaned close, lips almost grazing my neck, and whispered something I can’t repeat. My body shivered anyway." },
  { "key": "hidden_laughter", "stageMin": 3, "path": "any", "text": "We shared a laugh too loud for the shadows we hid in. His arm lingered around me longer than the joke required." },
  { "key": "bandage_care", "stageMin": 3, "path": "love", "text": "I wrapped his hand in cloth after a fight. He watched me too closely for someone bleeding." },
  { "key": "back_hold", "stageMin": 4, "path": "any", "text": "He slipped behind me, arms around my waist. I told him to let go, but stayed in his hold a moment longer." },
  { "key": "ear_breath", "stageMin": 4, "path": "hybrid", "text": "He breathed against my ear, not kissing—just hovering. The restraint was worse than the act itself." },
  { "key": "trembling_kiss", "stageMin": 4, "path": "love", "text": "When our lips finally met, I was trembling. He kissed me slowly, as if afraid I’d vanish." },
  { "key": "dirty_tease", "stageMin": 4, "path": "corruption", "text": "He tugged my skirt in public, just enough to make me panic. He laughed when I gasped—and I hated how warm it made me feel." },
  { "key": "shelter_embrace", "stageMin": 5, "path": "any", "text": "We sheltered from the rain, pressed close under one roof. I barely noticed the storm over my heartbeat." },
  { "key": "slow_dance", "stageMin": 5, "path": "love", "text": "There was no music. He still pulled me into a slow dance, whispering that I was his song." },
  { "key": "possessive_kiss", "stageMin": 5, "path": "corruption", "text": "He kissed me rough enough to leave marks. Later, I traced them in the mirror and shivered." }
    ],
"erotic": [
  { "key": "ass_grab", "stageMin": 0, "path": "any", "text": "His huge hands squeezed my behind, a small yelp left my lips. I was quick to scold him. I hope that never happens again." },

  { "key": "nipple_tease", "stageMin": 1, "path": "any", "text": "I felt his fingers run down my chest and linger where I'm most sensitive. I promised myself I won't let it happen again." },

  { "key": "bath_play", "stageMin": 2, "path": "love", "text": "He convinced me to help him wash the other day. He just seems so helpless, how could I refuse. While bathing, I couldn't help but notice how big he was... S-s-stop thinking about it Aerith." },

 { "key": "first_tent_oral", "stageMin": 2, "path": "corruption", "text": "I-I-I couldn't hold back my curiosity, he slowly unzipped and unleashed his monster. Stench dripping off it ... I felt my thighs heat up. The smell was so intoxicating, my lips quivered but were soon engulfed in his stench" },

  { "key": "first_time_corruption", "stageMin": 3, "path": "corruption", "text": "One minute he was whispering in my ear. The next... I lost control. He finally made me his. I can still feel his filth all over me, marking me as his." },

  { "key": "first_time_love", "stageMin": 3, "path": "love", "text": "The night was soft, and even with his rough edges, he touched me like I mattered. It hurt, but I wanted him close. I wanted all of him." },

  { "key": "first_time_hybrid", "stageMin": 3, "path": "hybrid", "text": "I told myself I hated how dirty he was, but when he pressed me down and kissed me with that smirk, I melted. Shame and thrill mixed, and I gave in." },

   { "key": "first_tongue_kissing", "stageMin": 3, "path": "corruption", "text": "He leaned in for a kiss and before I knew it our tongues were dancing together. I just can't get enough of this taste" },

  { "key": "morning_aftermath", "stageMin": 4, "path": "any", "text": "I woke sore and flushed, his smell still clinging to me. I should have bathed immediately, but part of me wanted to keep it—like proof of last night." },

  { "key": "rough_claim", "stageMin": 4, "path": "corruption", "text": "He pushed me hard against the wall, and I didn’t resist. The sting, the filth—it made me tremble in ways I never imagined I’d crave." },

  { "key": "tender_bed", "stageMin": 4, "path": "love", "text": "He lay beside me, unwashed and raw, yet he touched me so gently. I buried my face in his chest, choosing to see past the dirt to the man inside." },

   { "key": "tent_caught",     "stageMin": 3, "path": "love", "text": "I--I-I was lost in the moment with him. Every inch slid deeper but then Cloud started calling for me. As he peeked into the tent I've never felt so ashamed. We covered up in time, Vagrant still teased me from behind. I made up some excuse but Cloud definitely suspects something..." },

  { "key": "stained_flower", "stageMin": 4, "path": "corruption", "text": "He'd always use protection... Up until now. He kept teasing me, pushing my limits. I finally caved in and accepted." },

  { "key": "dirtied_inside", "stageMin": 4, "path": "corruption", "text": "I shouldn't want it, but I kept clinging to him. I locked my legs around him preventing any escape. Feeling his filthy seed inside me. I've never felt more conflicted." },

  { "key": "tainted_blossom", "stageMin": 5, "path": "corruption", "text": "Every inch of me feels claimed. I can’t wash away his touch anymore—his dirt lives inside me now, and shamefully, I don’t want to." },

  { "key": "forbidden_bond", "stageMin": 5, "path": "hybrid", "text": "We kissed with filth still on our skin. It should feel wrong, but instead it felt sacred. Like a secret only we’re allowed to share." },

  { "key": "pregnant_touch", "stageMin": 5, "path": "any", "text": "His hand lingered on my belly today, possessive and heavy. Whether love or corruption, I know now—my body belongs to him." }
  { "key": "bathhouse_cloud", "stageMin": 3, "path": "any", "text": "Steam wrapped around us in the bathhouse when he pulled me onto his lap. Just as his hands slid lower, Cloud’s silhouette appeared through the mist. My pulse thundered—if he took one more step, he'd see everything." },

{ "key": "tent_tifa", "stageMin": 3, "path": "corruption", "text": "His mouth was on me, shameless in the tent, when I heard Tifa’s boots crunching outside. Her voice called my name. I should have pushed him off, but instead I clutched his head tighter, praying she wouldn’t open the flap." },

{ "key": "inn_barret", "stageMin": 4, "path": "any", "text": "We were tangled on the bed, his filth heavy inside me, when Barret’s knock rattled the door. I froze—he didn’t. Each thrust muffled against my bitten lip while Barret cursed and moved on." },

{ "key": "slums_yuffie", "stageMin": 4, "path": "hybrid", "text": "In the shadows of the slums, his hand shoved beneath my skirt. I gasped too loud. Yuffie turned the corner with a grin, eyes flashing like she knew exactly what she’d caught. He only pressed harder, daring me to keep quiet." },

{ "key": "campfire_nanaki", "stageMin": 5, "path": "corruption", "text": "By the fire he entered me rough, not caring about the others nearby. Nanaki lifted his head, ears twitching, gaze fixed on us. I should’ve begged him to stop—but I arched instead, letting the beast inside and outside of me witness it." }
],
    "extreme_erotic": [
  { "key": "alley_taken", "stageMin": 4, "path": "corruption", "text": "He pressed me against a slum wall in broad daylight. I heard voices passing—didn’t care. I wanted them to know I was his." },
  { "key": "public_whisper", "stageMin": 4, "path": "hybrid", "text": "He whispered the filthiest things into my ear at the market stalls. People glanced, but I only leaned closer, aching for more." },
  { "key": "caught_by_cloud", "stageMin": 5, "path": "corruption", "text": "Cloud barged in while he had me pinned. My face burned with humiliation, yet my hips never stopped moving. Cloud’s eyes—his shock—only made me cling harder." },
  { "key": "tent_exposed", "stageMin": 5, "path": "any", "text": "The tent flap opened mid-thrust. I should’ve screamed, should’ve covered myself. Instead I arched louder, forcing the intruder to watch." },
  { "key": "inn_scandal", "stageMin": 5, "path": "corruption", "text": "The innkeeper knocked—told us to quiet down. Vagrant growled, pushed harder, and I cried his name loud enough for the whole hall." },
  { "key": "bathhouse_claim", "stageMin": 5, "path": "hybrid", "text": "Steam hid nothing. I let him take me in the bathhouse while others soaked nearby. I wanted them to hear my moans echo through the tiles." },
  { "key": "slum_stage", "stageMin": 5, "path": "corruption", "text": "He pulled me onto a crate in the slums like a throne. His hand between my thighs, his smirk daring the crowd to stare. And I spread wider, letting them." },
  { "key": "open_air_possession", "stageMin": 5, "path": "corruption", "text": "He bent me over under the open sky. Passersby gasped, muttered—my body still welcomed him. Shame was long gone." },
  { "key": "shared_look", "stageMin": 5, "path": "hybrid", "text": "Tifa saw. Her eyes locked with mine as he claimed me. I didn’t look away. I wanted her to know how far I’d fallen… or risen." },
  { "key": "filthy_family", "stageMin": 5, "path": "corruption", "text": "I stroked my swollen belly as he used me, groaning loud enough for the neighbors. Let them all hear—this child is proof I’m his." }
      ],
    "exploration": [
      { "key": "slum_walk",     "stageMin": 0, "path": "any", "text": "We walked alleys that smelled of rust and rain. He mocked the world; I laughed despite myself." },
      { "key": "church_visit",  "stageMin": 1, "path": "any", "text": "He stepped into the church with mud on his boots. I should’ve scolded him. I asked him to stay." },
      { "key": "night_market",  "stageMin": 2, "path": "any", "text": "Lanterns flickered on his cheekbones; the dirt didn’t look so ugly in the warm light." }
      { "key": "slum_walk_marked",     "stageMin": 5, "path": "corruption", "text": "We walked the dark alleys together. His hands clinging to my body in front of everyone. Everyone looks disgusted, but it makes me even more excited." },
      [
  { "key": "rooftop_view", "stageMin": 1, "path": "any", "text": "We climbed a rickety ladder to the rooftops. From up there the slums looked almost peaceful. He laughed when I held his arm too tightly." },
  { "key": "sewer_shortcut", "stageMin": 1, "path": "any", "text": "He led me through a sewer shortcut. The smell was unbearable, yet I followed. His torchlight was the only thing I could cling to." },
  { "key": "junkyard_stumble", "stageMin": 2, "path": "any", "text": "We wandered the junkyard together. He kicked rusted metal; I found a flower poking through. He smirked at me like I was ridiculous." },
  { "key": "outskirts_field", "stageMin": 2, "path": "any", "text": "Past the edge of the slums, wildflowers still grew. I picked one and tucked it in his pocket. He didn’t throw it away." },
  { "key": "collapsed_bridge", "stageMin": 2, "path": "any", "text": "We crossed a broken bridge, boards groaning beneath us. He teased me for hesitating. I teased him for smelling worse than the river below." },
  { "key": "hidden_alcove", "stageMin": 3, "path": "any", "text": "He pulled me into a shadowed alcove to avoid a patrol. His breath was close, his eyes darker than the night. My heart didn’t slow even after they passed." },
  { "key": "trainyard_rest", "stageMin": 3, "path": "any", "text": "We rested near the trainyard, leaning against cold steel. The way he lit a cigarette made me stare longer than I should have." },
  { "key": "riverbank_stop", "stageMin": 3, "path": "any", "text": "We stopped by the riverbank. His boots muddied the water; I lifted my skirt from the dirt. He told me I looked better when I wasn’t so careful." },
  { "key": "slum_rooftop_night", "stageMin": 4, "path": "any", "text": "At night on the rooftop, lanterns flickered in the slums below. He sat close, shoulder to shoulder, and I pretended it was just for the view." },
  { "key": "abandoned_market", "stageMin": 4, "path": "any", "text": "The old market stalls stood empty. He stole a kiss between the shadows. My protest never made it past my lips." },
  { "key": "windy_cliffside", "stageMin": 4, "path": "any", "text": "The wind nearly swept me off the cliffside path. He caught my wrist, holding too tight. I felt his grip long after." },
  { "key": "watchtower_top", "stageMin": 5, "path": "any", "text": "We reached the old watchtower. He leaned against me with no shame. The city stretched below, but all I saw was him." },
  { "key": "slum_walk_bold", "stageMin": 5, "path": "corruption", "text": "He pressed his hand against me boldly as we walked. People saw. I flushed with shame, but I didn’t pull away." },
  { "key": "hidden_garden", "stageMin": 5, "path": "love", "text": "He followed me into a hidden garden I thought only I knew. Dirt under his boots, flowers at my back. I realized I didn’t mind them mixing." },
  { "key": "forbidden_wall", "stageMin": 5, "path": "hybrid", "text": "We leaned against the wall outside Don Corneo’s estate. Wrong place, wrong time… but I liked the danger almost as much as his smirk." }
    ],
    "haunted_mansion": [
      { "key": "threshold",   "stageMin": 2, "path": "any", "text": "At the mansion doors, the air went cold. I took his arm and told myself it was the wind." },
      { "key": "whispers",    "stageMin": 3, "path": "any", "text": "Floorboards sighed; I held his sleeve. He smirked at my grip—and I didn’t let go." },
      { "key": "shadow_nook", "stageMin": 4, "path": "hybrid", "text": "Hidden in a shadowed room, I pressed close, heart racing at danger and desire braided together." }
    ],
    "tent": [
  { "key": "tent_camp_setup", "stageMin": 0, "path": "any", "text": "We struggled with the canvas. His hands were clumsy, filthy, but I found myself smiling anyway." },
  { "key": "tent_lantern", "stageMin": 1, "path": "any", "text": "Inside the tent, the lantern light made shadows of his grin. I tried not to stare." },
  { "key": "tent_rain", "stageMin": 2, "path": "any", "text": "The rain drummed above us. We sat shoulder to shoulder, the closeness harder to ignore." },
  { "key": "tent_sleep_shift", "stageMin": 3, "path": "any", "text": "I woke to find him shifted closer. His heat pressed against me. I didn’t move away." },
  { "key": "tent_midnight", "stageMin": 4, "path": "any", "text": "He whispered my name in the dark. The air grew heavy with things we shouldn’t want." },
      "tent": [
  { "key": "tent_rain_refuge", "stageMin": 1, "path": "any", "tags": ["tent"], "text": "Rain poured outside while we huddled close. The sound of water masked the silence between us… until I realized how close our faces were." },

  { "key": "tent_lantern_glow", "stageMin": 2, "path": "love", "tags": ["tent"], "text": "The lantern flickered, casting his rough edges in gold. For the first time, I thought he looked almost… handsome." },

  { "key": "tent_secret_kiss", "stageMin": 2, "path": "any", "tags": ["tent","intimacy"], "text": "The world outside felt far away. In the tent’s dim light, he leaned in, and I didn’t turn away." },

  { "key": "tent_sleeping_close", "stageMin": 2, "path": "any", "tags": ["tent","intimacy"], "text": "He pulled his bedroll closer than necessary. Our shoulders brushed, and neither of us moved away." },

  { "key": "tent_touch_bold", "stageMin": 3, "path": "corruption", "tags": ["tent","erotic"], "text": "In the dark, his hand slid across my thigh, deliberate and heavy. I pretended to sleep, but my body betrayed me." },

  { "key": "tent_caught_peek", "stageMin": 3, "path": "risky", "tags": ["tent","caught"], "text": "Cloud’s voice called outside the tent as Vagrant pressed against me. My heart pounded—half in fear, half in thrill of being found out." },

  { "key": "tent_tease_whisper", "stageMin": 3, "path": "hybrid", "tags": ["tent","erotic"], "text": "His filthy breath tickled my ear as he whispered promises of what he’d do if no one else were near. I shivered, ashamed at how much I wanted him to." },

  { "key": "tent_taken", "stageMin": 4, "path": "corruption", "tags": ["tent","extreme"], "text": "Pinned beneath him in the narrow space, I couldn’t hide the sounds I made. The tent walls shook, and I knew others could hear… but I didn’t care anymore." },

  { "key": "tent_shared_secret", "stageMin": 4, "path": "love", "tags": ["tent"], "text": "He kissed my forehead after, murmuring words only I could hear. For a fleeting moment, the tent felt like home." },

  { "key": "tent_open_flap", "stageMin": 5, "path": "corruption", "tags": ["tent","caught","extreme"], "text": "The flap slipped open and I swore I saw someone glance in. Still, I clung tighter to him, daring the world to see what we had become." }
],

"beach": [
  { "key": "beach_arrival", "stageMin": 0, "path": "any", "text": "The sea air tangled with the grime on him. I told myself I only noticed the view." },
  { "key": "beach_waves", "stageMin": 1, "path": "any", "text": "We let the waves lap at our feet. His laugh was rough, but it felt alive here." },
  { "key": "beach_fire", "stageMin": 2, "path": "any", "text": "We built a small fire. He stretched out in the sand, looking almost human." },
  { "key": "beach_secluded", "stageMin": 3, "path": "any", "text": "He led me past the rocks where no one else walked. The sound of waves masked my racing heart." },
  { "key": "beach_microbikini", "stageMin": 4, "path": "any", "text": "His eyes burned on my body as the tide rolled in. I pretended I didn’t notice… but I did." },
        { "key": "secluded_rocks_microbikini",   "stageMin": 3, "path": "any", "text": "We went on a secluded excursion, just the two of us. His eyes lingered on my body. What possessed me to wear this... I couldn't help but wonder what he was thinking as his eyes devoured my body." },
  
  { "key": "beach_midnight_swim", "stageMin": 2, "path": "love", "tags": ["beach","intimacy"], "text": "We slipped into the water at midnight, waves licking my skin. His hand brushed mine under the surface and I couldn’t tell if it was the tide or him pulling me closer." },

  { "key": "beach_sand_kiss", "stageMin": 2, "path": "any", "tags": ["beach","intimacy"], "text": "The sand stuck to our lips as he kissed me under the stars. Rough, salty, messy—and I loved it." },

  { "key": "beach_wave_pin", "stageMin": 3, "path": "corruption", "tags": ["beach","risky"], "text": "He pinned me in the shallows, waves splashing over us as I gasped. The sting of salt mixed with his roughness made me ache in ways I shouldn’t admit." },

  { "key": "beach_towel_tease", "stageMin": 3, "path": "any", "tags": ["beach","erotic"], "text": "He pulled me onto the towel, his hands sliding under wet fabric. Every flicker of torchlight from the pier made my heart pound faster." },

  { "key": "beach_hidden_dunes", "stageMin": 3, "path": "love", "tags": ["beach","intimacy"], "text": "We hid behind the dunes, laughter muffled by the crashing waves. I felt safe there, like it was our little secret world." },

  { "key": "beach_caught_glimpse", "stageMin": 3, "path": "risky", "tags": ["beach","caught"], "text": "I swear someone saw us. His mouth was still on my neck, but over his shoulder I caught a lantern flicker—and a figure froze before vanishing into the night." },

  { "key": "beach_bikini_pull", "stageMin": 4, "path": "corruption", "tags": ["beach","erotic"], "text": "He tugged at the strings of my bikini until I was bare under the moonlight. The air was cool, but his body burned against mine." },

  { "key": "beach_public_dare", "stageMin": 4, "path": "corruption", "tags": ["beach","extreme"], "text": "He dared me to straddle him on the sand where anyone could wander by. My cheeks burned, but I obeyed. I think I wanted to be seen." },

  { "key": "beach_wave_claim", "stageMin": 4, "path": "hybrid", "tags": ["beach","intimacy","erotic"], "text": "The tide rushed over us as he pressed deeper. Saltwater stung my lips; his kiss numbed everything else. Shame and love crashed together like the waves." },

  { "key": "beach_sand_inside", "stageMin": 5, "path": "corruption", "tags": ["beach","extreme"], "text": "Sand clung to my thighs, grinding with every movement. It was messy, raw, and I still begged for more." },

  { "key": "beach_daylight_risk", "stageMin": 5, "path": "corruption", "tags": ["beach","caught","extreme"], "text": "We didn’t wait for night. In broad daylight he pulled me close under a tattered parasol. Laughter and voices were only a few feet away… I couldn’t stop myself." },

  { "key": "beach_full_exhibition", "stageMin": 5, "path": "corruption", "tags": ["beach","extreme","caught"], "text": "He made me ride him against the rocks, the ocean crashing around us. I screamed his name, not caring who heard. In that moment, shame didn’t exist." }
],

"cave": [
  { "key": "cave_entry", "stageMin": 0, "path": "any", "text": "The cave smelled of earth and damp. His shadow loomed larger than life against the walls." },
  { "key": "cave_echo", "stageMin": 1, "path": "any", "text": "Every sound echoed. His laugh, his steps—it felt like there was no escape from him." },
  { "key": "cave_torchlight", "stageMin": 2, "path": "any", "text": "In the torchlight, his eyes seemed brighter. I couldn’t look away." },
  { "key": "cave_close", "stageMin": 3, "path": "any", "text": "He guided me through a narrow pass. His chest brushed my back, and I shivered." },
  { "key": "cave_hidden_pool", "stageMin": 4, "path": "any", "text": "We stumbled into a hidden pool. He dipped his filthy hands into the water, then touched my cheek. I let him." }
],

"inn": [
  { "key": "inn_entry", "stageMin": 0, "path": "any", "text": "The innkeeper frowned at his smell. I quickly booked a room before anyone could complain." },
  { "key": "inn_smallroom", "stageMin": 1, "path": "any", "text": "The room was tiny—one bed, no space between us. My heart skipped." },
  { "key": "inn_window", "stageMin": 2, "path": "any", "text": "Moonlight slipped through the shutters. I caught his reflection beside mine." },
  { "key": "inn_bedshift", "stageMin": 3, "path": "any", "text": "The bed dipped under his weight. Our arms brushed, and neither of us pulled back." },
  { "key": "inn_whispers", "stageMin": 4, "path": "any", "text": "He leaned close, voice low, daring me to admit I wanted this." },
  "inn": [
  { "key": "inn_first_room", "stageMin": 1, "path": "any", "tags": ["inn"], "text": "We rented a room. Just one bed. I told myself it was practical, but my chest tightened the moment the door shut." },

  { "key": "inn_candlelight", "stageMin": 2, "path": "love", "tags": ["inn","intimacy"], "text": "The single candle softened his dirt and shadowed his scars. I stared too long and blushed when he noticed." },

  { "key": "inn_silent_sleep", "stageMin": 2, "path": "any", "tags": ["inn","intimacy"], "text": "He lay beside me, breathing heavy. I pretended to be asleep… but all I could think of was the warmth of his arm brushing mine." },

  { "key": "inn_listening_walls", "stageMin": 2, "path": "any", "tags": ["inn","risky"], "text": "The walls were thin. I could hear laughter and footsteps outside as his hand slid under the blanket. Every sound felt too loud, too close." },

  { "key": "inn_kiss_against_wall", "stageMin": 3, "path": "love", "tags": ["inn","intimacy"], "text": "He kissed me and pressed me against the wall. The plaster felt cold; his body felt like fire. I didn’t want it to stop." },

  { "key": "inn_hand_over_mouth", "stageMin": 3, "path": "corruption", "tags": ["inn","erotic","risky"], "text": "He clamped his dirty hand over my mouth to stifle my gasp. The thrill of being silenced made my heart race." },

  { "key": "inn_overheard", "stageMin": 3, "path": "risky", "tags": ["inn","caught"], "text": "I heard footsteps pause outside our door as he pressed into me harder. Whoever it was lingered—listening. I should have panicked. Instead, I melted." },

  { "key": "inn_sheets_claim", "stageMin": 4, "path": "corruption", "tags": ["inn","extreme"], "text": "The sheets were already stained, and now they’re mine too. I let him mark me without hesitation, not caring if the innkeeper noticed later." },

  { "key": "inn_tender_after", "stageMin": 4, "path": "love", "tags": ["inn","intimacy"], "text": "Afterwards, he pulled the blanket around me, kissed my temple, and whispered that I was safe. The bed never felt so warm." },

  { "key": "inn_knock_on_door", "stageMin": 5, "path": "corruption", "tags": ["inn","caught","extreme"], "text": "Someone knocked at the door, calling my name. I was pinned beneath him, too lost in the moment to respond. He only grinned, daring me to answer while he stayed inside me." }
],

"slums": [
  { "key": "slum_gossip", "stageMin": 0, "path": "any", "text": "People whispered as I walked beside him. I pretended not to hear." },
  { "key": "slum_shack", "stageMin": 1, "path": "any", "text": "We ducked into an abandoned shack. His laughter echoed off the rotten walls." },
  { "key": "slum_market", "stageMin": 2, "path": "any", "text": "Vendors turned up their noses when he passed. I wanted to defend him, but I said nothing." },
  { "key": "slum_guard", "stageMin": 3, "path": "any", "text": "A guard shoved him for loitering. I stepped in before it turned ugly, shaking with fear—and something else." },
  { "key": "slum_midnight", "stageMin": 4, "path": "any", "text": "The alleys at midnight were ours alone. His hand brushed mine, bold, unashamed." }
]  
  { "key": "river_bridge", "stageMin": 1, "path": "any", "text": "We lingered on a creaking bridge over the river. He leaned close; the stink of the water matched his own. I still stayed." },
  { "key": "abandoned_trolley", "stageMin": 2, "path": "any", "text": "He pulled me into a broken trolley car. I laughed at the dust; he grinned, daring me to sit beside him." },
  { "key": "train_tunnel", "stageMin": 2, "path": "any", "text": "The dark swallowed us whole. I clung to his arm, telling myself it was just the cold." },
  { "key": "old_rooftop", "stageMin": 3, "path": "any", "text": "We climbed high above the slums. The stars made him look different—softer. I almost forgot the grime." },
  { "key": "market_fight", "stageMin": 3, "path": "any", "text": "Someone insulted him at the market. He snarled, fists ready. I held him back, shaking, thrilled by the danger." },
  { "key": "junkyard_rest", "stageMin": 4, "path": "any", "text": "We sat on a mountain of rust. He leaned back like he owned the world; I lay beside him, not caring about the dirt." },
  { "key": "rain_hideout", "stageMin": 4, "path": "any", "text": "The storm drove us under an old canopy. My clothes clung to me, his warmth pressed close—it felt too much like temptation." },
  { "key": "lantern_field", "stageMin": 5, "path": "any", "text": "The slums lit lanterns that night. They flickered on his face, shadows and smoke. I touched his cheek without thinking." }
    ],
    "pregnancy": [
      { "key": "scare",      "stageMin": 3, "path": "any", "text": "I felt lightheaded today. Fear pricked at me… and a strange, secret joy." },
      { "key": "confirmed",  "stageMin": 4, "path": "any", "text": "It’s real. His life grows inside me. The future smells like smoke and roses." },
      { "key": "protective", "stageMin": 5, "path": "love", "text": "I rested my hand against a new heartbeat and prayed the world would be kind." },
       { "key": "Excitement",      "stageMin": 5, "path": "Corruption", "text": "I've been marked again by his seed. Another child of his grows inside me and I will welcome it." },
      { "key": "possessive", "stageMin": 5, "path": "corruption", "text": "When another girl touched his arm, I felt a growl rise; he is mine, and everyone should know." }
    ],
    "confession": [
      { "key": "why_stay",     "stageMin": 2, "path": "any", "text": "He asked why I stay. I told him the truth: I want him exactly as he is." },
      { "key": "own_words",    "stageMin": 4, "path": "hybrid", "text": "I said it out loud: I love the tenderness and the taboo. It’s ours." },
      { "key": "forever_hint", "stageMin": 5, "path": "any", "text": "I pictured a small home that smells like tea and rain—and a little smoke that never quite leaves." }
    ],
"risky_play": [
  { "key": "market_glance", "stageMin": 1, "path": "any", "text": "In the middle of the market, his eyes lingered far too long on me. I flushed—terrified someone else saw." },
  { "key": "alley_whisper", "stageMin": 1, "path": "any", "text": "He pulled me into an alley just to whisper something filthy. My cheeks burned until we stepped back out." },
  { "key": "accidental_flash", "stageMin": 1, "path": "corruption", "text": "His hand tugged my skirt too high as I sat. Someone might have seen—my breath caught at the thought." },

  { "key": "crowded_hand", "stageMin": 2, "path": "any", "text": "His fingers brushed mine under the table. We stayed like that, unseen but not innocent." },
  { "key": "wall_press", "stageMin": 2, "path": "corruption", "text": "He pinned me against a wall, half-hidden in shadow. My gasp echoed down the alleyway." },
  { "key": "temple_dare", "stageMin": 2, "path": "hybrid", "text": "He dared me to kiss him in the church’s shadow. I did—heart racing at the sacred shame." },
  { "key": "public_joke", "stageMin": 2, "path": "any", "text": "He teased me loudly, so others laughed without knowing the truth behind his words." },

  { "key": "lap_tease_inn", "stageMin": 3, "path": "any", "text": "No seat left again. I sat on his lap, praying no one noticed how still I suddenly went." },
  { "key": "stairwell_touch", "stageMin": 3, "path": "corruption", "text": "On the inn’s stairwell, his hand crept higher. Voices were close. I didn’t stop him." },
  { "key": "window_shadow", "stageMin": 3, "path": "hybrid", "text": "We kissed by the window, backlit so anyone outside could see the silhouette. A thrill shot through me." },
  { "key": "slum_corner", "stageMin": 3, "path": "corruption", "text": "In the slum alleys, he shoved me close, hands wandering. A passerby coughed but didn’t stop us." },
  { "key": "flowerbed_kiss", "stageMin": 3, "path": "love", "text": "In the church garden, he kissed me roughly against the flowerbeds. The thought of someone walking in made it dizzying." },

  { "key": "tent_whisper", "stageMin": 4, "path": "any", "text": "In the tent, he whispered obscene promises. The others were only a few feet away." },
  { "key": "inn_moans", "stageMin": 4, "path": "corruption", "text": "I tried to stifle my voice while he had me in the inn bed. Every creak of the walls felt like exposure." },
  { "key": "balcony_brazen", "stageMin": 4, "path": "hybrid", "text": "He kissed me deeply on the balcony, lights flickering in the street below. We wanted someone to see." },
  { "key": "public_fingers", "stageMin": 4, "path": "corruption", "text": "His fingers slid under my clothes while we stood in line. I could barely breathe for fear of discovery." },

  { "key": "rooftop_dare", "stageMin": 5, "path": "hybrid", "text": "On a rooftop, the city beneath us, he dared me to strip bare for him. I did, trembling in the open air." },
  { "key": "marketplace_take", "stageMin": 5, "path": "corruption", "text": "In a shadowed market stall, he pushed inside me—people only steps away. Shame bled into rapture." },
  { "key": "inn_door_open", "stageMin": 5, "path": "corruption", "text": "He left the inn door ajar as he claimed me. Anyone could’ve walked by and seen." },
  { "key": "altar_blasphemy", "stageMin": 5, "path": "corruption", "text": "He pressed me against the altar itself. Sin and desire blurred until I couldn’t tell them apart." },
  { "key": "cloud_tent", "stageMin": 3, "path": "love", "text": "He slid against me in the tent, and just as I moaned, Cloud called my name outside. My heart nearly stopped—Vagrant smirked like he planned it." },

  { "key": "tifa_stairwell", "stageMin": 3, "path": "corruption", "text": "On the inn stairwell he pinned me, lips on my neck. The creak of a board above—Tifa passing by. I froze, but he didn’t stop." },

  { "key": "barret_market", "stageMin": 2, "path": "any", "text": "He brushed his hand across me in the crowded market. Barret was haggling just a few stalls away. I prayed he wouldn’t turn around." },

  { "key": "yuffie_bathhouse", "stageMin": 4, "path": "corruption", "text": "Steam hid us poorly. His hands roamed under the water when Yuffie’s voice echoed from the next room. I bit my lip to silence the cry." },

  { "key": "renna_shadow", "stageMin": 4, "path": "hybrid", "text": "In the mansion’s shadowed hall, he pressed close. Renna’s laugh rang down the corridor—I stiffened, but he only held me tighter." },

  { "key": "inn_knock", "stageMin": 5, "path": "corruption", "text": "The door rattled—someone knocked while he was still inside me. I covered my mouth, trembling, as he whispered not to stop." },

  { "key": "flowerbed_caught", "stageMin": 2, "path": "any", "text": "His kiss pushed me into the flowerbed. The church doors opened, voices spilling out. We broke apart in a panic, dirt on my dress." },

  { "key": "nanaki_watch", "stageMin": 3, "path": "corruption", "text": "In the campfire glow, his hand slipped too high under my skirt. Nanaki’s golden eyes flickered toward us—I don’t know if he saw." },

  { "key": "barmaid_inn", "stageMin": 4, "path": "any", "text": "He kissed me rough against the inn wall. A barmaid’s tray clattered nearby—I don’t know if she caught a glimpse before scurrying off." },

  { "key": "caught_together", "stageMin": 5, "path": "corruption", "text": "We were reckless, half-dressed in the slum alley. A group passed by, gasping. He only laughed, pulling me tighter as my shame burned hotter." },
  
  { "key": "flower_field_barret", "stageMin": 1, "path": "love", "text": "He brushed a kiss against my neck among the flowers. Barret stomped past and grunted. I froze, cheeks aflame, pretending nothing happened." },

  { "key": "training_yuffie", "stageMin": 2, "path": "hybrid", "text": "He pinned me against the post during Yuffie’s training. She turned mid-spin, eyes narrowing, but I forced a laugh as if it were nothing." },

  { "key": "church_cloud_confession", "stageMin": 3, "path": "love", "text": "He pulled me close in the church, lips brushing mine. Cloud opened the door, his eyes dark with hurt. My chest burned hotter than his kiss." },

  { "key": "inn_corridor_renna", "stageMin": 3, "path": "corruption", "text": "He had me pressed against the inn wall when Renna walked by, humming. Her eyes flickered, but she kept going. I shivered at the thought she knew." },

  { "key": "slum_market_crowd", "stageMin": 4, "path": "hybrid", "text": "His hand slid beneath my skirt in the crowded slum market. Someone bumped into us, I stifled a gasp, but he only pressed deeper, daring me not to cry out." },

  { "key": "camp_shadow_nanaki", "stageMin": 4, "path": "corruption", "text": "Under the camp’s lantern light, he took liberties with me. Nanaki’s golden eyes lingered too long before turning away. Shame and thrill tangled in my chest." },

  { "key": "dockside_tifa", "stageMin": 5, "path": "corruption", "text": "At the docks, he bent me over the railing. Tifa’s footsteps echoed nearby. I moaned too loud; her pace quickened, and I couldn’t tell if it was disgust—or envy." },

  { "key": "inn_window_exposure", "stageMin": 5, "path": "hybrid", "text": "He pushed me against the open window. Voices drifted from below. The danger of being seen only made me cling to him harder." },
],
  "erotic_caught": [
  { "key": "garden_peek", "stageMin": 1, "path": "love", "text": "He kissed me between the hedges. A child peeked through the leaves before being pulled away by their mother. My heart pounded like a guilty hymn." },

  { "key": "inn_door_knock", "stageMin": 1, "path": "any", "text": "He slipped his hands under my dress just as someone knocked on the door. I nearly screamed—he whispered for me to stay quiet until they left." },

  { "key": "tavern_shadow", "stageMin": 2, "path": "corruption", "text": "He pressed me against the tavern wall, mouths locked. Footsteps passed by, laughter echoing, and still he wouldn’t let me go." },

  { "key": "training_ground_barret", "stageMin": 2, "path": "any", "text": "We lingered too close at the training ground. Barret barked at us from across the yard. I jumped, cheeks aflame, his hand still on my hip." },

  { "key": "haunted_room_yuffie", "stageMin": 2, "path": "hybrid", "text": "He tugged me into a haunted corridor. Yuffie stumbled in behind us, flashlight catching our tangled hands. Her giggle made me shiver." },

  { "key": "dockside_moonlight", "stageMin": 3, "path": "love", "text": "The moonlight glittered on the water while he kissed me. Tifa’s voice carried nearby. I pulled back, but he only smiled and kissed me harder." },

  { "key": "market_corner_cloud", "stageMin": 3, "path": "corruption", "text": "He pinned me behind a vendor’s stall. Cloud’s silhouette walked by, his voice calling my name. I pressed my face into Vagrant’s chest and stayed silent." },

  { "key": "tent_lantern", "stageMin": 3, "path": "any", "text": "He slipped beneath my blankets. The lantern outside flickered as Nanaki passed. I swore he could smell what we were doing." },

  { "key": "church_statue", "stageMin": 4, "path": "hybrid", "text": "He laid me against the statue’s base, lips on my throat. Candles burned all around. Anyone could’ve walked in—I almost wanted them to." },

  { "key": "alley_gang", "stageMin": 4, "path": "corruption", "text": "In a dark alley, he lifted me onto a crate. Voices of thugs drifted closer. He only held me tighter, daring them to hear my muffled gasps." },

  { "key": "slum_window", "stageMin": 4, "path": "any", "text": "His hand crept beneath my skirt as I leaned on the window sill. I bit my lip as neighbors argued below, oblivious to what was happening above." },

  { "key": "inn_corridor_cloud", "stageMin": 4, "path": "corruption", "text": "He kissed me rough against the corridor wall. Cloud turned the corner. I shoved Vagrant away, but Cloud’s eyes had already seen too much." },

  { "key": "campfire_circle", "stageMin": 5, "path": "any", "text": "He touched me under the blanket by the fire. The others laughed and sang, unaware—or pretending not to be. My pulse thundered in my ears." },

  { "key": "dockside_barret", "stageMin": 5, "path": "corruption", "text": "He bent me low at the dock’s edge. Barret’s shadow fell across us. He cursed under his breath and left, but the shame only made me shiver harder." },

  { "key": "inn_balcony_tifa", "stageMin": 5, "path": "hybrid", "text": "On the inn balcony, he pressed me against the railing. Tifa’s door opened just beside us. I hid my face against his chest as she looked into the night." },
],
"daily_moments": [
  { "key": "flower_water", "stageMin": 0, "path": "any", "text": "Watering flowers, I caught myself humming the tune he whistled yesterday." },
  { "key": "sleepless", "stageMin": 1, "path": "any", "text": "I couldn’t sleep; the night felt too quiet without the rasp of his laugh in it." },
  { "key": "scarf_smell", "stageMin": 2, "path": "any", "text": "My scarf picked up his scent. I should wash it. I didn’t." },
  { "key": "laundry_smell", "stageMin": 1, "path": "any", "text": "I washed his shirt today. Even clean, the smell lingered. I held it longer than I should have." },
  { "key": "market_gossip", "stageMin": 2, "path": "any", "text": "They whispered about us at the stalls. I pretended not to hear, but my chest tightened with a strange pride." },
  { "key": "shared_drink", "stageMin": 0, "path": "any", "text": "He offered me his flask. It smelled awful, but I still took a sip—our lips touched the same edge." },
  { "key": "cooking_meal", "stageMin": 0, "path": "any", "text": "We cooked together in the slums. He burned the pan, I laughed harder than I should have." },
  { "key": "scarf_fix", "stageMin": 1, "path": "any", "text": "He tugged my scarf straight. His fingers lingered at my collar longer than necessary." },
  { "key": "accidental_brush", "stageMin": 1, "path": "any", "text": "Our hands brushed reaching for the same basket. I pretended not to notice, but my heart raced." },
  { "key": "hair_touch", "stageMin": 1, "path": "any", "text": "He touched a strand of my hair, saying it looked 'too clean for here.' I couldn’t tell if it was mockery or praise." },

  { "key": "shoulder_bump", "stageMin": 2, "path": "any", "text": "Walking side by side, he bumped my shoulder playfully. I bumped back, smiling." },
  { "key": "arm_grab", "stageMin": 2, "path": "any", "text": "He caught my arm suddenly as I slipped. His grip was rough, grounding… I didn’t want him to let go." },
  { "key": "feeding_bite", "stageMin": 2, "path": "any", "text": "He stole food off my plate, then offered me his half. I leaned in, our mouths too close." },
  { "key": "lap_sit", "stageMin": 2, "path": "corruption", "text": "No chairs left, he patted his lap. I sat, flushed, pretending it was nothing." },
  { "key": "back_rub", "stageMin": 2, "path": "love", "text": "My shoulders ached. He pressed his palms into me. His touch was clumsy, but sweet." },

  { "key": "hand_holding", "stageMin": 3, "path": "any", "text": "Without asking, he laced his fingers with mine. I squeezed back before I realized." },
  { "key": "whisper_joke", "stageMin": 3, "path": "any", "text": "He leaned close to whisper something crude. His breath was hot at my ear—I laughed anyway." },
  { "key": "hip_grab", "stageMin": 3, "path": "corruption", "text": "His hand stayed on my hip long after guiding me aside. I didn’t push it away." },
  { "key": "chest_pillow", "stageMin": 3, "path": "love", "text": "I fell asleep against his chest. He smelled of smoke and sweat, but I found comfort there." },
  { "key": "neck_sniff", "stageMin": 3, "path": "hybrid", "text": "He leaned in, inhaling me, saying I smelled 'too clean.' I should’ve shoved him off—but my cheeks burned." },

  { "key": "waist_grip", "stageMin": 4, "path": "corruption", "text": "He grabbed me at the waist in front of others. Shame turned into something hotter." },
  { "key": "dirty_whisper", "stageMin": 4, "path": "hybrid", "text": "He whispered filth in my ear while others talked nearby. I nearly buckled." },
  { "key": "bath_together", "stageMin": 4, "path": "love", "text": "We shared a wash basin. I tried to keep it innocent, but I caught myself watching the water drip down him." },
  { "key": "public_touch", "stageMin": 4, "path": "corruption", "text": "His hand slid down my back in the market crowd. I froze, breath caught, afraid someone noticed." },
  { "key": "secret_smile", "stageMin": 5, "path": "any", "text": "We shared a glance across the room—everyone else blurred out. Only us, our filthy secret." }
  { "key": "shared_meal", "stageMin": 2, "path": "love", "text": "We shared bread in the alley. He tore it with dirty fingers and offered me half. I didn’t hesitate." },
  { "key": "hand_brush", "stageMin": 2, "path": "any", "text": "Our hands brushed reaching for the same basket. I pulled back quickly—too quickly." },
  { "key": "stare_too_long", "stageMin": 3, "path": "any", "text": "I caught myself staring at his jaw, his lips, even the grime. My chest burned when he caught me." },
  { "key": "neighbors_whisper", "stageMin": 3, "path": "corruption", "text": "A neighbor muttered 'filth clings to filth.' Instead of shame, I felt heat run through me." },
  { "key": "clothes_borrowed", "stageMin": 3, "path": "love", "text": "He gave me his jacket when the night turned cold. It smelled like him. I didn’t want to take it off." },

  { "key": "hair_smell", "stageMin": 4, "path": "hybrid", "text": "He pressed his nose into my hair, still dirty from the day. I shivered instead of pushing him away." },
  { "key": "public_joke", "stageMin": 4, "path": "any", "text": "He made a crude joke in front of others. I blushed hard, but secretly loved the way he made me feel claimed." },
  { "key": "comforted", "stageMin": 4, "path": "love", "text": "When I cried, he wiped my cheek with the back of his rough hand. I leaned into it." },
  { "key": "lingering_smell", "stageMin": 5, "path": "corruption", "text": "His smell clings to me everywhere I go. People look disgusted, but I wear it like perfume." },
  { "key": "daydreams", "stageMin": 5, "path": "any", "text": "I daydream of him while watering flowers, dirt under my nails, heat in my cheeks. He’s in me now." },
  { "key": "laundry_shared",      "stageMin": 0, "path": "any", "text": "I washed his shirt. Even clean, a hint of him stayed. I pressed it to my face and pretended it was the wind that made me smile." },
  { "key": "bread_bite",          "stageMin": 0, "path": "any", "text": "We split bread. Grease on his fingers, crumbs on mine. When he held a piece to my lips, I forgot to be proper." },
  { "key": "lantern_fix",         "stageMin": 1, "path": "any", "text": "He fixed a broken lantern outside the church. Soot on his jaw, stubborn light in his eyes. I wanted to wipe both away with my thumb." },
  { "key": "alley_rain",          "stageMin": 1, "path": "any", "text": "A sudden rain pinned us beneath a tin awning. Drips kept time while he stood too close. I didn’t step back." },
  { "key": "market_share",        "stageMin": 1, "path": "any", "text": "He haggled for fruit and handed me the ripest. Our fingers brushed; my cheeks burned warmer than the sun." },
  { "key": "scarf_scent_stronger","stageMin": 2, "path": "any", "text": "My scarf held his smell again. I should have washed it last night. I folded it instead, like hiding a secret." },
  { "key": "flowerbed_tumble",    "stageMin": 2, "path": "any", "text": "We tripped over a root and fell into the flowerbed. Dirt on my dress, laughter in my throat, his breath close enough to taste." },
  { "key": "window_watch",        "stageMin": 2, "path": "any", "text": "I watched him from the window as he joked with a shopkeep. When he glanced up, I ducked and laughed at myself." },
  { "key": "tea_pause",           "stageMin": 3, "path": "any", "text": "He took tea without complaint. Hands wrapped round the cup, eyes on me instead of the steam. I couldn’t hold his gaze for long." },
  { "key": "quiet_walk_home",     "stageMin": 3, "path": "any", "text": "We walked the long way home in silence. Our shoulders brushed now and then, like the night had its own ideas." },
  { "key": "bonfire_story",       "stageMin": 4, "path": "any", "text": "By a slum bonfire he told a story that wasn’t cruel. Ash turned his hair silver; for a moment he looked almost gentle." },
  { "key": "shared_blanket",      "stageMin": 4, "path": "any", "text": "One blanket between us. He pretended to sleep; I pretended not to notice when he shifted closer." },
  { "key": "morning_afterglow",   "stageMin": 5, "path": "any", "text": "Sunlight crept across the floorboards. I traced it with my toes, still warm from the way he’d held me through the night." },
  { "key": "public_handhold",     "stageMin": 5, "path": "any", "text": "He offered his hand in the market without words. I took it. Whispers followed; I walked taller." },
  { "key": "petal_press",         "stageMin": 5, "path": "any", "text": "I pressed a flower into his palm. He tucked it behind my ear with a roughness that somehow felt careful." }
],
  },
  "entries": [],
  "meta": {
    "notes": "Desires (path lanes 0–5), Witnessed (per stage & path), Events (category/key) ready for triggers. Timeline entries append into `entries` at runtime.",
    "updated": "2025-08-30"
  }
}
