{
  "version": "1.0",
  "characterId": "aerith",
  "desires": {
    "vagrant": {
      "love": [
        "Stage 0 — I met him among the alleys; beneath the grime I sense a loneliness I can’t turn away from.",
        "Stage 1 — If he’d let me close, I’d show him he’s more than the dirt the world sees.",
        "Stage 2 — His rough smile is cracked, but when it’s for me I feel warm all the way through.",
        "Stage 3 — I want to be the person who coaxes gentleness out of him, even if my hands come away stained.",
        "Stage 4 — Love can hold contradictions: I can cherish him as he is and still wish to heal what hurts.",
        "Stage 5 — No matter what others smell or say, I choose him; I want a future woven from tenderness and grit."
      ],
      "corruption": [
        "Stage 0 — He is unwashed and shameless; the wrongness lingers on my skin… and it won’t leave my thoughts.",
        "Stage 1 — The weight of his presence clings like smoke; fear mixes with a heat I don’t understand.",
        "Stage 2 — When he leans close, the filth feels like a claim; my breath catches and I don’t pull away.",
        "Stage 3 — I want him to mark me so the world knows I’m his—terrible and thrilling in the same breath.",
        "Stage 4 — The more he tests my limits, the more I find new ones to surrender; I ache for the surrender itself.",
        "Stage 5 — Let me be his without pretense; stain me with him until even my doubts carry his scent."
      ],
      "hybrid": [
        "Stage 0 — He’s everything I should refuse, yet part of me leans closer just to see what happens.",
        "Stage 1 — Sin and softness together tempt me: his filth, my care; my blush, his smirk.",
        "Stage 2 — If loving him means touching what’s forbidden, then let my hands be honest and my heart be brave.",
        "Stage 3 — Shame turns to thrill when it’s ours; I want the secret and the sweetness in the same heartbeat.",
        "Stage 4 — This feels like choosing fire and rain at once; I want both the scorch and the bloom.",
        "Stage 5 — I accept the paradox: tender devotion wrapped in taboo—our own kind of pure."
      ]
    }
  },
  "witnessed": {
    "vagrant": {
      "tifa": [
        { "stage": 0, "path": "love",       "text": "Tifa’s nose wrinkled at his smell; still, her eyes lingered a second too long. I felt a pinch of something I won’t name." },
        { "stage": 1, "path": "corruption", "text": "He stood too close to Tifa; the air turned heavy. My pulse stuttered—disgust, envy, and a spark I shouldn’t feel." },
        { "stage": 2, "path": "hybrid",     "text": "She didn’t flinch this time. I hated that I noticed… and that part of me wished it was me instead." },
        { "stage": 3, "path": "love",       "text": "They spoke in low tones; his roughness softened. It hurt—and yet I smiled for both of them." },
        { "stage": 4, "path": "corruption", "text": "Her breath hitched when he leaned in. The alley felt too warm; jealousy braided with a darker want." },
        { "stage": 5, "path": "hybrid",     "text": "Filth and closeness and something tender—between them, and inside me. I’m frightened by how much I understand." }
      ],
      "renna": [
        { "stage": 0, "path": "love",       "text": "Renna laughed off his mockery, unbothered by the grime. I wish I could be so light." },
        { "stage": 1, "path": "corruption", "text": "She let him crowd her space—reckless, smiling. I felt heat rise in my cheeks for reasons I won’t write twice." },
        { "stage": 2, "path": "hybrid",     "text": "Her ease with him pricked me; I envied her boldness and feared where it leads." },
        { "stage": 3, "path": "love",       "text": "She teased him into a softer mood. I caught myself rooting for them—and then for myself." },
        { "stage": 4, "path": "corruption", "text": "He tested her with a daring touch; she didn’t pull away. My heart pounded in something like approval." },
        { "stage": 5, "path": "hybrid",     "text": "Watching them felt like watching a secret I already share: danger, laughter, and a choice to keep wanting." }
      ],
      "yuffie": [
        { "stage": 0, "path": "love",       "text": "Yuffie joked about his stink and made even him laugh. I laughed, too—traitorously." },
        { "stage": 1, "path": "corruption", "text": "She tossed him a grin that said: your dirt doesn’t scare me. The thrill in my chest startled me." },
        { "stage": 2, "path": "hybrid",     "text": "She turned grime into a game. I wondered what it would be like to play along." },
        { "stage": 3, "path": "love",       "text": "He softened around her mischief; I understood the charm—and felt my own grow sharper." },
        { "stage": 4, "path": "corruption", "text": "Her teasing let him be bolder. My breath quickened, jealous and fascinated in equal measure." },
        { "stage": 5, "path": "hybrid",     "text": "This triangle of jokes and heat felt inevitable; I wrote the truth: I want what she has, and what I have, too." }
      ]
    }
  },
  "events": {
    "intro": [
      { "key": "first_meeting",      "stageMin": 0, "path": "any", "text": "I met him in the slums—rags, smoke, and eyes that dared me to care. I did." },
      { "key": "first_conversation", "stageMin": 0, "path": "any", "text": "He called me too clean for these alleys. I stayed anyway; something in me wanted to prove him wrong." }
    ],
    "intimacy": [
      { "key": "first_touch", "stageMin": 1, "path": "any", "text": "His fingers grazed mine—rough and unwashed—and my skin lit like a match." },
      { "key": "first_kiss",  "stageMin": 2, "path": "any", "text": "He tasted of ash and sweat; it should have repelled me. I leaned in instead." },
      { "key": "quiet_hold",  "stageMin": 3, "path": "love", "text": "We said nothing. His weight, his warmth, the grime—somehow it felt like safety." },
      { "key": "claimed_whisper", "stageMin": 4, "path": "corruption", "text": "He murmured at my ear that I’m his. The word sank deep; I didn’t fight it." }
    ],
    "exploration": [
      { "key": "slum_walk",     "stageMin": 0, "path": "any", "text": "We walked alleys that smelled of rust and rain. He mocked the world; I laughed despite myself." },
      { "key": "church_visit",  "stageMin": 1, "path": "any", "text": "He stepped into the church with mud on his boots. I should’ve scolded him. I asked him to stay." },
      { "key": "night_market",  "stageMin": 2, "path": "any", "text": "Lanterns flickered on his cheekbones; the dirt didn’t look so ugly in the warm light." }
    ],
    "haunted_mansion": [
      { "key": "threshold",   "stageMin": 2, "path": "any", "text": "At the mansion doors, the air went cold. I took his arm and told myself it was the wind." },
      { "key": "whispers",    "stageMin": 3, "path": "any", "text": "Floorboards sighed; I held his sleeve. He smirked at my grip—and I didn’t let go." },
      { "key": "shadow_nook", "stageMin": 4, "path": "hybrid", "text": "Hidden in a shadowed room, I pressed close, heart racing at danger and desire braided together." }
    ],
    "pregnancy": [
      { "key": "scare",      "stageMin": 3, "path": "any", "text": "I felt lightheaded today. Fear pricked at me… and a strange, secret joy." },
      { "key": "confirmed",  "stageMin": 4, "path": "any", "text": "It’s real. His life grows inside me. The future smells like smoke and roses." },
      { "key": "protective", "stageMin": 5, "path": "love", "text": "I rested my hand against a new heartbeat and prayed the world would be kind." },
      { "key": "possessive", "stageMin": 5, "path": "corruption", "text": "When another girl touched his arm, I felt a growl rise; he is mine, and everyone should know." }
    ],
    "confession": [
      { "key": "why_stay",     "stageMin": 2, "path": "any", "text": "He asked why I stay. I told him the truth: I want him exactly as he is." },
      { "key": "own_words",    "stageMin": 4, "path": "hybrid", "text": "I said it out loud: I love the tenderness and the taboo. It’s ours." },
      { "key": "forever_hint", "stageMin": 5, "path": "any", "text": "I pictured a small home that smells like tea and rain—and a little smoke that never quite leaves." }
    ],
    "daily_moments": [
      { "key": "flower_water", "stageMin": 0, "path": "any", "text": "Watering flowers, I caught myself humming the tune he whistled yesterday." },
      { "key": "sleepless",    "stageMin": 1, "path": "any", "text": "I couldn’t sleep; the night felt too quiet without the rasp of his laugh in it." },
      { "key": "scarf_smell",  "stageMin": 2, "path": "any", "text": "My scarf picked up his scent. I should wash it. I didn’t." }
    ]
  },
  "entries": [],
  "meta": {
    "notes": "Desires (path lanes 0–5), Witnessed (per stage & path), Events (category/key) ready for triggers. Timeline entries append into `entries` at runtime.",
    "updated": "2025-08-30"
  }
}
