  "endgame_resolutions": {
  "love": [
    { "stageMin": 10, "text": "I never thought I'd find peace in a man like him. But love is not about perfection—it's about choosing. And I choose him, as he is, every day from now until the end." },
    { "stageMin": 10, "text": "The world may call him filth. To me, he is home. Our child, our laughter, our mornings together—they are proof that love grows even in broken soil." },
    { "stageMin": 10, "text": "I see the scars on his hands and the tenderness in his eyes. This life is ours. Ordinary, imperfect, and exactly what my heart longed for." }
  ],
  "corruption": [
    { "stageMin": 10, "text": "There is no turning back. His filth marks me forever, body and soul. I am his, ruined and radiant, and I crave only more of what he makes me." },
    { "stageMin": 10, "text": "I begged for his seed again today. It isn't shame anymore—it's worship. He owns me, and I am glad to be nothing but his vessel, his whore, his woman." },
    { "stageMin": 10, "text": "Love? That word feels too small. What we are is hunger given form. I'll spread for him until the end of days, drowning in his stink and his seed, smiling as I fall." }
  ],
  "hybrid": [
    { "stageMin": 10, "text": "Love and shame. Purity and filth. I thought I had to choose—now I know I never will. My heart and my body burn together, and he is the fire." },
    { "stageMin": 10, "text": "In his arms, I am holy and defiled. I am cherished and ruined. That paradox is our truth, and it binds us tighter than either path alone." },
    { "stageMin": 10, "text": "The world won't understand. But I don't need them to. I need only him—his love, his filth, his everything. My diary closes here, inked in contradictions that are ours." }
  ]
  },
  "endgame_secret": {
  "love": [
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"] },
      "text": "No more pretending. I choose the man I see when the noise fades—the one who holds me steady even when the world doubts us."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"], "pregnant": true },
      "text": "I pressed his rough hand to the small stir of life and felt peace take root. If this is our future, I will meet it with an open heart."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"], "minLove": 9, "usedStonesAny": ["diamond"] },
      "text": "Clarity came like morning after rain: devotion isn't fragile. It's a vow I wake up and keep, over and over."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.love"], "titlesAll": ["flower_guardian"] },
      "text": "He never asked me to change; he only asked me to see him. I did. And I will keep seeing him—bright edges, shadowed corners and all."
    }
  ],
  "corruption": [
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "minCorruption": 9 },
      "text": "I stopped apologizing for the mark he leaves on me. It isn't a stain—it's a choice, and I make it with open eyes."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "pregnant": true },
      "text": "His claim isn't just on my skin anymore; it's etched into my womb. I accept it, and I hunger for the certainty it brings."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "usedStonesAny": ["obsidian","onyx"] },
      "text": "Darkness can cradle as well as swallow. I learned its language and answered back, and now it whispers my name like a promise."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.corruption"], "titlesAny": ["slum_muse","dark_consor"] },
      "text": "Let the alleys talk. I know what I am to him—and what he is to me. The echo doesn't frighten me anymore."
    }
  ],
  "hybrid": [
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"] },
      "text": "Tenderness after the storm; the storm inside the tenderness. We are both, and it finally feels honest."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"], "pregnant": true },
      "text": "A forbidden family, maybe—but it's ours. Shame and joy braided together, and I choose not to unweave it."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"], "minLove": 8, "minCorruption": 7 },
      "text": "I don't split myself in two anymore. I bring all of me to him—the soft and the shameless—and he meets me there."
    },
    {
      "require": { "stageMin": 10, "flagsAll": ["ending.hybrid"], "usedStonesAny": ["emerald","sapphire"] },
      "text": "Balance isn't stillness; it's motion we choose together. We tip toward heat, then back to hush, and call the rhythm home."
    },
  ]
  }
