{
  "version": "1.0",
  "characterId": "aerith",
  "desires": {
  "vagrant": {
    "love": [
      "I shouldn’t look twice at a man like him… yet something gentle flickers beneath the grime, and I want to see it again.",
      "When he lets the mask slip, I feel warmth. If I stay patient, maybe he’ll trust me with more of himself.",
      "His rough edges don’t scare me anymore. I find myself wishing he’d stay a little longer each time.",
      "When he’s near, my chest settles. I want to be the place he can rest without pretending.",
      "I don’t mind the dirt if the smile is real. I want to be the reason it is.",
      "I want quiet mornings and honest evenings—no bravado, just us breathing the same air.",
      "I want to stand beside him in the open, unashamed, and call what we have by its name.",
      "I choose him, not a cleaned-up fantasy—him, as he is, and I’ll meet the world’s doubts with my certainty.",
      "I want a life woven with his: shared work, shared laughter, shared burdens, and a key that fits both our doors.",
      "Let them whisper. I know what I feel. My heart doesn’t want a savior or a project—it wants him.",
      "This love is a vow I make daily: to see him clearly, to be seen in return, and to keep choosing us."
    ],
    "corruption": [
      "Something about him feels like a dare I shouldn’t take—and I keep stepping closer anyway.",
      "His grin makes rules feel flimsy. Part of me wonders how far I’d go just to keep it aimed at me.",
      "I’m learning how temptation sounds when it uses my name. It’s reckless… and thrilling.",
      "He tilts the world off its axis and I don’t rush to set it straight. I like the tilt.",
      "If I cross one more line, will I still recognize myself? The thought doesn’t scare me as much as it should.",
      "I catch my reflection and see someone braver—or is it hungrier? Either way, I don’t look away.",
      "The shame fades faster now, replaced by heat that lingers. I invite it to stay.",
      "I crave the power of surrender, the rush of being chosen and claimed—no excuses, no masks.",
      "It’s not that I’ve lost myself; it’s that I’ve discovered a self that reaches back when darkness reaches for me.",
      "I don’t ask permission from the world anymore. Desire writes its own rules, and I sign my name.",
      "Whatever we are, it’s undeniable—and I accept the mark it leaves on me."
    ],
    "hybrid": [
      "He’s everything I should avoid and everything I can’t ignore—dangerous and oddly tender.",
      "I’m split between scolding him and staying close. The truth: I like being near the storm.",
      "If he is the shadow and I’m the light, then maybe we’re meant to blur at the edges.",
      "I want the forbidden and the sincere at once—hands that take and then hold.",
      "It’s a secret I carry gladly: I love him when he’s rough and when he’s real.",
      "I don’t need to choose between pure and profane if what we have is honest.",
      "Let sweetness follow the burn; I want both and I won’t apologize.",
      "We can be soft after we’re bold; we can be bold because we’re soft. That paradox feels like us.",
      "I’m done pretending the thrill isn’t part of the love. It is—and it makes the love brighter.",
      "Our story is messy and true. I’ll write it with ink that doesn’t wash off.",
      "If love is a sanctuary and desire a wildfire, then our home is a hearth built from both."}
    ],
    "reflections": {
  "vagrant": {
    "tifa": [
      "Stage 0 — She scowls when he draws near. I pretend I agree, but my heart beats faster than it should.",
      "Stage 1 — Tifa wrinkles her nose at his smell. I should too… but the way she looks at him makes me wonder what she sees beyond it.",
      "Stage 2 — She holds herself tall, but I catch her eyes flickering. Why does it sting that she notices him?",
      "Stage 3 — Watching him test her patience twists my stomach. Disgust… and something hotter I don’t want to name.",
      "Stage 4 — I saw her lean just a little closer. I shouldn’t care, but I do. My cheeks burned hotter than hers.",
      "Stage 5 — They shared a silence too heavy. I imagined breaking it—throwing myself between them.",
      "Stage 6 — Tifa doesn’t flinch anymore. She’s used to his filth, and that unsettles me most—I wish I were.",
      "Stage 7 — When she let him touch her shoulder, my whole body jolted. I wanted it to be me.",
      "Stage 8 — They looked almost natural together. I hated it… until I realized part of me wanted to join them.",
      "Stage 9 — Her breaths grew heavy as he teased. I bit my lip raw just watching.",
      "Stage 10 — I didn’t look away this time. I stared until he noticed—daring him to touch us both."
    ],
    "renna": [
      "Stage 0 — Renna laughs too easily at his mockery. She makes him sound harmless when I know he isn’t.",
      "Stage 1 — She shrugs at the grime like it’s nothing. I envy her blindness.",
      "Stage 2 — She let him sit close, dirt and all. I told myself it was foolish. Secretly, I wished it were me.",
      "Stage 3 — Their playfulness makes me feel left out… but also heated, like I’ve been challenged.",
      "Stage 4 — She leaned into him, bold and smiling. I felt jealousy coil around my ribs.",
      "Stage 5 — Her laughter sounded too intimate. I clenched my fists until my nails hurt.",
      "Stage 6 — He brushed her hair back. The tenderness startled me—it should’ve been mine.",
      "Stage 7 — Renna didn’t resist when he teased her waist. I wanted to scream—or beg to be touched the same.",
      "Stage 8 — She accepts him now without question. I’m sick with envy and sick with desire.",
      "Stage 9 — Watching them play at corruption set my body trembling. I couldn’t breathe until it ended.",
      "Stage 10 — They both turned to me, daring me to join. My shame dissolved. I wanted to."
    ],
    "yuffie": [
      "Stage 0 — Yuffie mocked his smell, loud and bold. I smiled when he laughed back. Why did I smile?",
      "Stage 1 — She calls him trash and he smirks anyway. I wish I could be so careless with him.",
      "Stage 2 — She teases, he indulges. Their ease makes me ache—why can’t I play like that?",
      "Stage 3 — When she shoved him playfully, my chest tightened. I wanted to feel his weight too.",
      "Stage 4 — She doesn’t mind the dirt. She laughs through it. I hate that I admire her for it.",
      "Stage 5 — They shared a grin I couldn’t break into. I went home restless and jealous.",
      "Stage 6 — She leaned close, whispering something. My ears burned imagining it was me.",
      "Stage 7 — Yuffie’s boldness scares me. She doesn’t flinch, even when he touches what should be private. My thighs pressed together as I watched.",
      "Stage 8 — They make filth look fun. My shame slips faster each time I witness it.",
      "Stage 9 — Her giggles as he pressed against her body left me breathless. I imagined myself between them.",
      "Stage 10 — They knew I was watching. Neither stopped. I stayed—wanting, burning, ready to step in."
    ]
  }
    },
    "events": {
    "locations": {
    "cave": [
  { "key": "drip_echoes",        "stageMin": 0,  "path": "any", "text": "Water dripped like a slow clock. I kept close for warmth, pretending I wasn’t using him as an excuse." },
  { "key": "torch_light",        "stageMin": 1,  "path": "any", "text": "Torchlight made his grime glow copper. I caught myself staring and looked away too slowly." },
  { "key": "hand_bridge",        "stageMin": 2,  "path": "any", "text": "A narrow ledge—he offered his hand. Rough, unwashed, steady. I took it and didn’t let go until long after." },
  { "key": "whisper_path",       "stageMin": 3,  "path": "any", "text": "He guided me by the small of my back. I shivered and blamed the cold, not his touch." },
  { "key": "hide_from_bats",     "stageMin": 4,  "path": "any", "text": "A flurry of bats—he covered me with his body. I breathed in smoke and earth and didn’t complain." },
  { "key": "kiss_in_dark",       "stageMin": 5,  "path": "love", "text": "The torch died; we were mouths and breath in the dark. His kiss tasted like ash and I wanted more." },
  { "key": "wall_press",         "stageMin": 5,  "path": "hybrid", "text": "Stone at my back, his palm at my waist. I said ‘careful’ and leaned into him anyway." },
  { "key": "echo_laughter",      "stageMin": 6,  "path": "any", "text": "Our laughter echoed too loud. I covered his mouth with my fingers; he kissed my knuckles, filthy and sweet." },
  { "key": "lap_warmth",         "stageMin": 7,  "path": "love", "text": "We sat to rest; he tugged me onto his lap. I stayed, pretending it was just to keep warm." },
  { "key": "rough_graze",        "stageMin": 7,  "path": "corruption", "text": "His unwashed jaw scraped my neck and I arched to meet it. I didn’t ask him to stop." },
  { "key": "hidden_pool",        "stageMin": 8,  "path": "hybrid", "text": "We found a subterranean pool. He waded in boots and all; I followed, dress clinging, heart racing." },
  { "key": "wet_mark",           "stageMin": 9,  "path": "corruption", "text": "Water beaded on my skin; he smeared it away with his hands, leaving dirt in its place. I shivered and let it stay." },
  { "key": "echoed_plea",        "stageMin": 9,  "path": "love", "text": "He asked if I was sure. I said yes, and the cave repeated it back to us—yes, yes, yes." },
  { "key": "altar_of_stone",     "stageMin": 10, "path": "hybrid", "text": "On a flat slab of rock, we made our own ritual—half prayer, half sin—our breaths the only hymns." },
  { "key": "claim_in_the_dark",  "stageMin": 10, "path": "corruption", "text": "He marked me where no light reached. I wore the cave’s silence like a veil and gave myself to it." }
    ],
  "tent": [
  { "key": "shared_blanket", "stageMin": 0, "path": "any", "text": "The night was cold. He tugged the blanket toward himself; I pulled it back. Somehow we both ended up beneath it." },
  { "key": "accidental_touch", "stageMin": 1, "path": "any", "text": "His hand brushed mine in the dark. I pulled away too quickly, but my heart wouldn’t slow." },
  { "key": "shoulder_rest", "stageMin": 2, "path": "any", "text": "Exhaustion won. I leaned against his shoulder. His smell filled my lungs and lulled me to uneasy sleep." },
  { "key": "close_whispers", "stageMin": 3, "path": "love", "text": "We whispered in the dark, secrets trading like promises. His words made the tent feel smaller, warmer." },
  { "key": "night_stir", "stageMin": 3, "path": "corruption", "text": "I woke to his hand lingering too low on my hip. I froze… but I didn’t push it away." },
  { "key": "tent_kiss", "stageMin": 4, "path": "any", "text": "Moonlight cut through the tent flap. He kissed me—rough, unwashed—and I kissed him back." },
  { "key": "caught_breaths", "stageMin": 5, "path": "hybrid", "text": "Cloud’s voice called from outside. Vagrant’s mouth was still on mine. I covered my lips and lied about my breathlessness." },
  { "key": "pressed_bodies", "stageMin": 6, "path": "love", "text": "The tent was too small for the way he pulled me against him. I felt caged—and safe." },
  { "key": "tent_claim", "stageMin": 7, "path": "corruption", "text": "He took me in the dark while others slept nearby. My shame and excitement tangled until I couldn’t tell them apart." },
  { "key": "whispered_dare", "stageMin": 8, "path": "hybrid", "text": "He dared me to moan louder, to risk being heard. Heat pooled in my chest as I almost did." },
  { "key": "overheard", "stageMin": 9, "path": "any", "text": "The canvas walls couldn’t hide our sounds. I knew others heard. I should’ve cared—I didn’t." },
  { "key": "tent_exposed", "stageMin": 10, "path": "corruption", "text": "The flap shifted; someone saw. I didn’t stop. I wanted them to know I was his." }
  ],
  "inn": [
  { "key": "late_checkin", "stageMin": 1, "path": "any", "text": "The innkeeper’s eyes lingered on the grime he tracked in. I ignored it, taking the key and pretending not to care." },
  { "key": "shared_room", "stageMin": 2, "path": "any", "text": "Only one bed. I told myself I’d sleep on the edge. By morning, I woke against his chest." },
  { "key": "bath_basin", "stageMin": 3, "path": "love", "text": "He coaxed me to help wash him in the basin. The water turned cloudy, but my cheeks burned hotter than the steam." },
  { "key": "door_whisper", "stageMin": 3, "path": "hybrid", "text": "The door was thin. Anyone could have heard. He pressed his lips to my ear anyway, daring me to hush him." },
  { "key": "rough_walls", "stageMin": 4, "path": "corruption", "text": "He shoved me against the inn’s wooden wall, the bed creaking nearby. I wanted to protest, but my body betrayed me." },
  { "key": "window_peek", "stageMin": 5, "path": "any", "text": "Curtains drawn, but I swore I saw shadows in the street. I didn’t care. I clutched him harder." },
  { "key": "creaking_bed", "stageMin": 6, "path": "love", "text": "The old bed squealed beneath us, every sound a warning. But we didn’t stop—we made it sing with our rhythm." },
  { "key": "midnight_knock", "stageMin": 7, "path": "any", "text": "A knock on the door froze me in place. He didn’t. I bit my hand to keep from crying out." },
  { "key": "innkeeper_suspicion", "stageMin": 8, "path": "corruption", "text": "The innkeeper smirked at breakfast, eyes on my swollen lips and tired body. I couldn’t meet her gaze." },
  { "key": "noisy_walls", "stageMin": 9, "path": "hybrid", "text": "I heard laughter from the next room—mocking or amused, I couldn’t tell. He only grinned and pulled me closer." },
  { "key": "claimed_room", "stageMin": 10, "path": "corruption", "text": "By the end of the night, the whole inn knew I belonged to him. The walls carried proof of it." }
  ],
  "beach": [
  { "key": "shore_walk", "stageMin": 0, "path": "any", "text": "We walked along the wet sand. He teased me for holding my skirt too high. I blushed and refused to drop it." },
  { "key": "shell_gift", "stageMin": 1, "path": "love", "text": "He picked up a chipped seashell and pressed it into my hand like it was treasure. I kept it hidden in my pocket." },
  { "key": "tide_splash", "stageMin": 2, "path": "any", "text": "The tide caught us. He laughed when I squealed, and before I knew it, his arms were around me, soaked together." },
  { "key": "hidden_cove", "stageMin": 3, "path": "hybrid", "text": "We slipped into a secluded cove. His lips found mine, tasting of salt and smoke. I swore the waves hid our moans." },
  { "key": "sandy_kiss", "stageMin": 4, "path": "love", "text": "He laid me back against the sand. It clung to our skin as our mouths tangled. Every kiss left grit, but I didn’t care." },
  { "key": "moonlit_bathing", "stageMin": 5, "path": "love", "text": "Under the moon, I stripped to the water. He followed, unashamed. Our naked bodies brushed, slick and shimmering in the tide." },
  { "key": "public_tease", "stageMin": 5, "path": "corruption", "text": "He pressed against me under a towel while others strolled nearby. My cheeks burned, but I couldn’t push him away." },
  { "key": "bikini_pull", "stageMin": 6, "path": "corruption", "text": "His fingers hooked beneath my straps, tugging just enough that I gasped. Anyone could’ve seen. The thrill made me shiver." },
  { "key": "rocky_throne", "stageMin": 7, "path": "any", "text": "He sat against a jagged rock and pulled me onto his lap. The sea roared as I sank down, every thrust daring the horizon to watch." },
  { "key": "ocean_claim", "stageMin": 8, "path": "corruption", "text": "He took me waist-deep in the surf, waves crashing over us. Salt stung my lips as I cried out into the night air, unafraid who heard." },
  { "key": "beachfire_shadow", "stageMin": 8, "path": "hybrid", "text": "Others laughed around the bonfire. In the shadows, his hands roamed under my dress. I bit my lip to keep quiet." },
  { "key": "daylight_dare", "stageMin": 9, "path": "corruption", "text": "In broad daylight he pushed me to my knees behind a dune. My heart pounded with terror—and need—of being caught." },
  { "key": "sandbound", "stageMin": 10, "path": "corruption", "text": "He pinned me to the wet sand, waves and sun beating down. I screamed his name like a challenge to the entire beach." },
  { "key": "open_worship", "stageMin": 10, "path": "hybrid", "text": "I let him strip me bare before the ocean, body worshipped in full view of the horizon. Love and filth collided in holy abandon." }
  ],
  "slums": [
  { "key": "alley_meet", "stageMin": 0, "path": "any", "text": "He dragged me through a narrow alley. The stink of trash and rust filled my nose. I should’ve pulled away, but I didn’t." },
  { "key": "market_stare", "stageMin": 1, "path": "any", "text": "Even surrounded by beggars and vendors, his eyes pinned me. I burned under his gaze, shifting uncomfortably in the dirt." },
  { "key": "corner_whisper", "stageMin": 2, "path": "hybrid", "text": "He pressed me against a stone wall and whispered filth in my ear. My legs shook, not from fear—because I wanted it." },
  { "key": "dirty_kiss", "stageMin": 3, "path": "corruption", "text": "Our tongues danced together, sloppy and heated. I wanted to taste every drop of saliva. My shame was drowned by the thrill." },
  { "key": "grimy_touch", "stageMin": 3, "path": "any", "text": "His filthy hands slipped under my skirt. I gasped when his fingers slid inside. People were walking by—I bit my lip to keep from squealing." },
  { "key": "wall_claim", "stageMin": 4, "path": "corruption", "text": "He pinned me down against the bricks, grinding until my juices mixed with his filth. The stench of sweat and rust filled the air, intoxicating me." },
  { "key": "public_fingers", "stageMin": 5, "path": "corruption", "text": "His fingers slipped inside with everyone around. My cheeks flushed crimson, a squeal left my lips. No one cared—no one stopped him." },
  { "key": "deep_claim", "stageMin": 6, "path": "corruption", "text": "He thrust into me hard, each motion sending shockwaves down my spine. My cries of ecstasy echoed in the alley, shameless." },
  { "key": "seeded", "stageMin": 7, "path": "corruption", "text": "His deep thrusts broke me open until he flooded my insides with his seed. I clenched around him, unwilling to let it drip away." },
  { "key": "straddle_show", "stageMin": 8, "path": "corruption", "text": "I seductively straddled him in a broken chair outside the tavern. Guiding him inside, I rode him, moaning while footsteps passed nearby." },
  { "key": "rough_rut", "stageMin": 9, "path": "corruption", "text": "He bent me over trash-strewn crates, taking me mercilessly. Every thrust made me squeal in raw pleasure, juices splattering the dirt beneath us." },
  { "key": "open_display", "stageMin": 10, "path": "corruption", "text": "Pinned against the wall of the slums, he ravaged me while a crowd gathered. Shame burned away as his seed spilled inside me—I begged for more even as they watched." }
  ],
  "church": [
  { "key": "sanctuary_peace", "stageMin": 0, "path": "any", "text": "I brought him here, hoping the quiet might soften him. He looked out of place, but I wanted to believe peace could reach him." },
  { "key": "pew_brush", "stageMin": 1, "path": "any", "text": "We sat side by side on the pews. His hand brushed mine—rough, dirty—and I pretended it was nothing." },
  { "key": "lingering_hand", "stageMin": 2, "path": "any", "text": "His hand stayed too long on my thigh during prayer. My heart raced. I told myself it was wrong, but my body didn’t move." },

  { "key": "confessional_whisper", "stageMin": 3, "path": "corruption", "text": "Inside the confessional, his voice was in my ear. He spoke filth like a sermon, and I listened as if it were scripture." },
  { "key": "altar_touch", "stageMin": 4, "path": "hybrid", "text": "He pinned me lightly against the altar, just a kiss. Sacred and profane clashed, and I burned with the mix of guilt and longing." },

  { "key": "stained_glass_embrace", "stageMin": 5, "path": "love", "text": "Colored light from the stained glass washed over us. He kissed me like I was the only one in the world, and for a moment, it felt holy." },
  { "key": "altar_kiss", "stageMin": 6, "path": "corruption", "text": "His mouth crashed against mine at the altar. My prayers turned to moans. The church held witness to my shame and desire." },
  { "key": "shadowed_corner", "stageMin": 7, "path": "hybrid", "text": "In the shadows, he pushed me close, his breath heavy. I wanted to resist, but instead I wrapped my arms around him. Desire felt stronger than faith." },

  { "key": "stained_glass_sin", "stageMin": 8, "path": "corruption", "text": "The church echoed with every thrust, my cries bouncing off sacred stone. His dirt stained me beneath the gaze of saints in glass." },
  { "key": "altar_possession", "stageMin": 9, "path": "corruption", "text": "Bent over the altar, I gave in fully. His filth poured into me while holy candles flickered. Desecration became devotion." },
  { "key": "sacred_ruin", "stageMin": 10, "path": "corruption", "text": "I no longer fear the church’s judgment. On sacred ground, with him inside me, I felt free. The house of God is now the house of our sin." }
  ],
  "forest": [
  { "key": "forest_path", "stageMin": 0, "path": "any", "text": "We walked the winding trail. Birds sang, leaves rustled… and still, I felt his presence louder than anything else." },
  { "key": "clearing_pause", "stageMin": 1, "path": "any", "text": "We stopped in a sunlit clearing. His eyes lingered on me longer than they should have, and I pretended not to notice." },
  { "key": "branch_brush", "stageMin": 2, "path": "any", "text": "A branch snapped underfoot, startling me. His hand steadied my waist, rough and dirty, and my heart skipped." },

  { "key": "tree_whisper", "stageMin": 3, "path": "love", "text": "Leaning close beneath the branches, he whispered something soft. I wanted to believe it was only for me." },
  { "key": "hidden_kiss", "stageMin": 4, "path": "hybrid", "text": "The trees hid us. His lips found mine—tender and unclean all at once. I kissed back, shame warming my cheeks." },

  { "key": "mossy_embrace", "stageMin": 5, "path": "love", "text": "We sank into the moss. His arms wrapped around me, and I swore the whole forest held its breath." },
  { "key": "rough_tree", "stageMin": 6, "path": "corruption", "text": "He pressed me against the rough bark, his dirt smearing onto me. I should have resisted. I didn’t." },
  { "key": "wild_gasp", "stageMin": 7, "path": "hybrid", "text": "Every sound in the woods felt louder—the rustle of leaves, my gasps, his laugh. Danger only made me cling tighter." },

  { "key": "forest_claim", "stageMin": 8, "path": "corruption", "text": "The forest floor became our bed. Every thrust shook me, leaves clung to my hair, and I didn’t care who heard." },
  { "key": "wild_throne", "stageMin": 9, "path": "corruption", "text": "He took me on the roots of an ancient tree, marking me as his in the open wild. I moaned like the forest itself was watching." },
  { "key": "nature_bound", "stageMin": 10, "path": "corruption", "text": "No shame left—I straddled him in the open air, birds overhead, earth beneath us. Nature itself bore witness to my ruin, and I reveled in it." }
  ],
  "cave": [
  { "key": "cave_entry", "stageMin": 0, "path": "any", "text": "The air turned damp and cool as we stepped inside. Shadows swallowed the walls, and his presence felt heavier here." },
  { "key": "echo_step", "stageMin": 1, "path": "any", "text": "Every step echoed, every breath carried. I worried someone might hear us—though no one was there." },
  { "key": "torch_glow", "stageMin": 2, "path": "any", "text": "In the torchlight, his features looked sharper, dirt and all. I caught myself staring too long." },

  { "key": "corner_touch", "stageMin": 3, "path": "love", "text": "He brushed my hand in the narrow passage. It felt like more than an accident, and I didn’t pull away." },
  { "key": "echo_kiss", "stageMin": 4, "path": "hybrid", "text": "The echo carried our kiss back to us, like the cave itself was taunting me. I kissed him harder." },

  { "key": "stone_embrace", "stageMin": 5, "path": "love", "text": "He held me close against the cool rock wall. The silence was broken only by our hearts pounding." },
  { "key": "rock_claim", "stageMin": 6, "path": "corruption", "text": "He pressed me into the stone, his dirt rubbing onto my dress. The thought of leaving a stain thrilled me." },
  { "key": "torch_flicker", "stageMin": 7, "path": "hybrid", "text": "In the flickering shadows, we became something secret and forbidden. I moaned louder than I meant to." },

  { "key": "cave_thrusts", "stageMin": 8, "path": "corruption", "text": "He drove into me with reckless force, every thrust echoing louder than my voice. I couldn’t hide it anymore." },
  { "key": "stalagmite_throne", "stageMin": 9, "path": "corruption", "text": "He sat me atop a cold stone and used me until I forgot myself. My cries bounced back at me from every wall." },
  { "key": "echo_ruin", "stageMin": 10, "path": "corruption", "text": "The cave rang with our frenzy—my screams, his grunts, the slap of flesh. I wanted the world to hear my ruin." }
  ],
  "warehouse": [
  { "key": "warehouse_entry", "stageMin": 0, "path": "any", "text": "The air reeked of rust and oil. He smirked, calling it our 'palace'. I shivered, not entirely from the cold." },
  { "key": "broken_glass", "stageMin": 1, "path": "any", "text": "Shards crunched under my boots. He leaned close, whispering something crude. My cheeks burned hotter than the metal walls." },
  { "key": "dirty_smirk", "stageMin": 2, "path": "any", "text": "He teased me about staining my dress in a place like this. Part of me wanted to prove him wrong. Another part… didn’t." },

  { "key": "wall_pin", "stageMin": 3, "path": "corruption", "text": "He shoved me against a rusted wall, his hands groping shamelessly. I gasped, torn between scolding and moaning." },
  { "key": "dirty_kiss", "stageMin": 4, "path": "corruption", "text": "His mouth tasted like smoke and grease. My lips moved anyway, greedy for more." },

  { "key": "oil_stains", "stageMin": 5, "path": "hybrid", "text": "He smeared oil across my neck with his filthy fingers, then kissed the mark like it was his signature." },
  { "key": "floor_claim", "stageMin": 6, "path": "corruption", "text": "He pushed me down on the filthy floor. Dust, grease, and his weight pressed into me all at once. I couldn’t resist." },
  { "key": "rough_take", "stageMin": 7, "path": "corruption", "text": "Every thrust made the loose boards groan beneath us. I clung to him, letting him ruin me with every filthy push." },

  { "key": "graffiti_shame", "stageMin": 8, "path": "hybrid", "text": "My back scraped against graffiti-scrawled walls while he pounded into me. I wondered if the words painted there applied to me now." },
  { "key": "grease_slick", "stageMin": 9, "path": "corruption", "text": "He dragged grease across my skin, marking me as his. I cried out shamelessly, the filth seeping into every inch of me." },
  { "key": "public_ruin", "stageMin": 10, "path": "corruption", "text": "The warehouse doors were wide open. I straddled him anyway, moaning loud enough for the slums to hear. I wanted everyone to know who owned me." }
  ],
  "sewers": [
  { "key": "sewer_entry", "stageMin": 0, "path": "any", "text": "The stench hit me instantly. I asked what we were doing here—he just grinned and kept walking." },
  { "key": "dripping_walls", "stageMin": 1, "path": "any", "text": "Water dripped from mossy walls. I told myself to focus on the path, not his hand brushing mine." },
  { "key": "mocking_smell", "stageMin": 2, "path": "any", "text": "He teased me about wrinkling my nose. I laughed, even though the stink made my eyes water." },

  { "key": "slime_pin", "stageMin": 3, "path": "corruption", "text": "He pressed me against a slime-slick wall. My gasp echoed in the tunnels, mixing with the stink of rot and his breath." },
  { "key": "wet_kiss", "stageMin": 4, "path": "corruption", "text": "His mouth crushed mine, filthy water dripping onto our skin. The taste of him mingled with the sewer’s foulness." },

  { "key": "knees_mud", "stageMin": 5, "path": "hybrid", "text": "I dropped to my knees in the muck, pretending to hate it. My lips betrayed me as they parted for him." },
  { "key": "sludge_claim", "stageMin": 6, "path": "corruption", "text": "He bent me over into the shallow sludge. The filth soaked my thighs as he drove into me harder than I thought I could bear." },
  { "key": "stench_thrill", "stageMin": 7, "path": "corruption", "text": "Every thrust splashed sewage up my legs. I didn’t care. The stench made my head spin, made me scream louder." },

  { "key": "filth_rush", "stageMin": 8, "path": "hybrid", "text": "I begged him not to stop, not even when rats scurried by. My voice echoed in the tunnels: desperate, ruined, hungry for more." },
  { "key": "owned_in_shadows", "stageMin": 9, "path": "corruption", "text": "He grabbed my hair, forcing me down into the slime while taking me mercilessly. I swallowed filth, my body begging for his seed." },
  { "key": "oblivion_surge", "stageMin": 10, "path": "corruption", "text": "The sewers shook with our cries. I straddled him in the filth, moaning as his seed spilled inside me, mixing with the slime. I screamed my surrender, uncaring who heard, desperate for the world to know I belonged to him." }
  ],
  "marketplace": [
  { "key": "morning_crowds", "stageMin": 0, "path": "any", "text": "The marketplace buzzed with chatter. I told myself I only followed him to shop… not to linger by his side." },
  { "key": "stolen_apple", "stageMin": 1, "path": "any", "text": "He tossed me an apple he’d lifted without paying. I wanted to scold him—why did it make me smile instead?" },
  { "key": "stall_brush", "stageMin": 2, "path": "any", "text": "Pressed close at a crowded stall, his hip brushed mine. I pretended not to notice how long he left it there." },

  { "key": "alley_whisper", "stageMin": 3, "path": "corruption", "text": "He yanked me into a narrow alley between stalls, whispering filth against my neck while merchants called only steps away." },
  { "key": "grip_beneath", "stageMin": 4, "path": "corruption", "text": "His hand slipped beneath my dress in broad daylight. The noise of haggling masked my gasp as his fingers explored me." },

  { "key": "fruit_stall", "stageMin": 5, "path": "hybrid", "text": "A peach burst in my hand as his hips ground into me against the stall. Juice and filth dripped down my fingers." },
  { "key": "displayed_touch", "stageMin": 6, "path": "corruption", "text": "He pinned me against sacks of grain. People passed only steps away, but his fingers were already inside me, pumping shamelessly." },
  { "key": "risked_kiss", "stageMin": 7, "path": "corruption", "text": "He kissed me hard in front of a vendor. Shame heated my cheeks, but I didn’t pull away. Their stare made me wetter." },

  { "key": "public_claim", "stageMin": 8, "path": "hybrid", "text": "Bent over the stall, I felt his length slide into me. The crowd roared in barter, unaware I was being filled in their midst." },
  { "key": "shameless_moan", "stageMin": 9, "path": "corruption", "text": "I moaned aloud, loud enough to draw stares. His thrusts didn’t falter; he smirked as if daring the world to watch." },
  { "key": "market_queen", "stageMin": 10, "path": "corruption", "text": "He took me atop crates under the sun, filling me while shoppers gasped. I threw my head back, uncaring, moaning his name as he spilled inside me for all to hear." }
  ],
  "nightclub_backroom": [
  { "key": "bass_pulse", "stageMin": 0, "path": "any", "text": "The bass rattled the floor. I told myself I only came to dance… not to follow him into the shadows." },
  { "key": "drink_in_hand", "stageMin": 1, "path": "any", "text": "He shoved a dirty glass into my hand. It tasted bitter, wrong. I drank it anyway." },
  { "key": "shoulder_grip", "stageMin": 2, "path": "any", "text": "His rough hand settled heavy on my shoulder, guiding me deeper into the backroom. My heart raced harder than the music." },

  { "key": "crowd_hide", "stageMin": 3, "path": "corruption", "text": "The crowd masked us, his palm pressed against my chest. Every thrum of the bass hid my gasp." },
  { "key": "wall_press", "stageMin": 4, "path": "corruption", "text": "He shoved me against a graffiti-smeared wall, lips devouring mine. The scent of smoke and sweat made me dizzy." },

  { "key": "lap_dance", "stageMin": 5, "path": "hybrid", "text": "He dropped into a chair, pulling me onto his lap. Music throbbed through us as I ground against his filth in time with the beat." },
  { "key": "finger_play", "stageMin": 6, "path": "corruption", "text": "The room reeked of alcohol and bodies when his fingers slipped beneath my skirt. No one could hear my moans over the music." },
  { "key": "public_tease", "stageMin": 7, "path": "corruption", "text": "Another girl stumbled past the doorway, catching a glimpse. He didn’t stop—he only pushed deeper, smirking as her eyes widened." },

  { "key": "dirty_dance", "stageMin": 8, "path": "hybrid", "text": "He bent me over the sticky table, pounding in time with the bass. Lights flashed across my flushed skin. I screamed into the music." },
  { "key": "club_claim", "stageMin": 9, "path": "corruption", "text": "He filled me against the wall while bodies writhed just outside. His seed dripped down my thighs as I staggered back to the dance floor." },
  { "key": "backroom_whore", "stageMin": 10, "path": "corruption", "text": "He took me raw on the back couch while strangers watched from the door. I begged for more, moaning loud enough to drown out the music—my shame long gone." }
  ],
  "rooftop": [
  { "key": "night_air", "stageMin": 0, "path": "any", "text": "He dragged me up the fire escape. The city stretched below, and I told myself it was just the view I wanted." },
  { "key": "edge_stand", "stageMin": 1, "path": "any", "text": "We stood at the edge. His arm brushed mine. The chill wasn’t just from the wind." },
  { "key": "graffiti_smile", "stageMin": 2, "path": "any", "text": "He laughed at the graffiti, smoke curling from his lips. I shouldn’t have smiled back… but I did." },

  { "key": "kiss_in_wind", "stageMin": 3, "path": "love", "text": "The night air tangled our hair as he kissed me. It was rough, clumsy, but I didn’t pull away." },
  { "key": "bend_rail", "stageMin": 4, "path": "corruption", "text": "He bent me over the rooftop rail. Below us, life moved on. No one knew my legs were trembling from more than the cold." },

  { "key": "skyline_hold", "stageMin": 5, "path": "hybrid", "text": "We lay against the rooftop tiles, staring at the skyline. His grime rubbed against my skin, but I held him closer anyway." },
  { "key": "grip_and_thrust", "stageMin": 6, "path": "corruption", "text": "He pushed inside me under the stars. My cries echoed into the open air, drowned only by the hum of the city below." },
  { "key": "moonlit_tongues", "stageMin": 7, "path": "hybrid", "text": "The moonlight caught his filthy grin as our tongues tangled. My shame slipped away with every sloppy kiss." },

  { "key": "public_dare", "stageMin": 8, "path": "corruption", "text": "He dared me to ride him where the whole slum could see if they only looked up. I did—moaning into the wind." },
  { "key": "seeded_above", "stageMin": 9, "path": "corruption", "text": "On the rooftop’s edge he filled me, his seed dripping down my thighs as I leaned over the city, legs quaking." },
  { "key": "queen_of_rooftop", "stageMin": 10, "path": "corruption", "text": "He fucked me raw under the stars until I screamed his name into the night sky. The rooftops carried my cries like a crown—I was his, high above the world." }
  ],
  "abandoned_factory": [
  { "key": "rust_steps", "stageMin": 0, "path": "any", "text": "The factory smelled of oil and iron. He walked ahead, boots loud, and I told myself I wasn’t following out of choice." },
  { "key": "grease_touch", "stageMin": 2, "path": "any", "text": "He smeared grease across my cheek with a smirk. I should have slapped him. I didn’t." },
  { "key": "kiss_against_machinery", "stageMin": 3, "path": "love", "text": "He pressed me against cold metal, lips rough and insistent. The machinery clanked like it disapproved." },
  { "key": "oil_stained_skin", "stageMin": 5, "path": "corruption", "text": "His filthy hands left black streaks across my thighs as he shoved them apart." },
  { "key": "taken_on_workbench", "stageMin": 8, "path": "corruption", "text": "He bent me over an old workbench. Each thrust rattled the bolts scattered beneath us." },
  { "key": "factory_echo", "stageMin": 10, "path": "corruption", "text": "My screams echoed through the empty hall. I was oil-stained, seed-soaked, and proud to let the whole factory hear." }
  ],
"bathhouse": [
  { "key": "bathhouse_entry", "stageMin": 0, "path": "any", "text": "The steam clung to my skin. He didn’t belong here—too filthy, too brazen. Still, my eyes followed him through the haze." },
  
  { "key": "shared_steam", "stageMin": 1, "path": "any", "text": "Our towels brushed as we passed. I scolded myself for staring, but heat flooded me anyway." },
  
  { "key": "accidental_splash", "stageMin": 2, "path": "any", "text": "He splashed water onto me playfully. I laughed, then froze as his gaze lingered too long on my chest through wet fabric." },
  
  { "key": "corner_kiss", "stageMin": 3, "path": "love", "text": "He pulled me into a quiet corner of steam, lips crashing into mine. My knees trembled with the warmth of it." },
  { "key": "rough_grab", "stageMin": 3, "path": "corruption", "text": "Hands grabbed under the water. His fingers were shameless, and I moaned despite knowing others were nearby." },
  { "key": "hidden_hand", "stageMin": 3, "path": "hybrid", "text": "He slid his hand between my thighs under the water. I gasped but leaned into it—thrill and tenderness clashing." },
  
  { "key": "body_wash", "stageMin": 4, "path": "love", "text": "I lathered his back. His sigh made me blush. I wanted to keep washing him forever." },
  { "key": "public_fondle", "stageMin": 4, "path": "corruption", "text": "He pressed me against the bath’s edge, hand groping openly. The thought of being caught made me drip with heat." },
  
  { "key": "steamy_lock", "stageMin": 5, "path": "any", "text": "He locked the small wash-room door behind us. My heart raced—whether from fear or excitement, I couldn’t say." },
  
  { "key": "slip_inside", "stageMin": 6, "path": "corruption", "text": "He slid inside me under the steaming water. I gripped the edge, moaning into the mist." },
  { "key": "waterfall_kiss", "stageMin": 6, "path": "love", "text": "We kissed beneath the pouring spout. It felt like the world disappeared, only his lips existed." },
  { "key": "steamy_moan", "stageMin": 6, "path": "hybrid", "text": "Steam clouded us, muffling my moans. I wanted the world to hear, yet prayed it didn’t." },
  
  { "key": "pool_straddle", "stageMin": 7, "path": "corruption", "text": "I straddled him in the shallow pool, water sloshing. My moans echoed shamelessly in the chamber." },
  { "key": "bath_slide", "stageMin": 7, "path": "hybrid", "text": "He lifted me up and slid me down onto him. I wrapped my arms tight, both scared and elated to lose myself here." },
  
  { "key": "moans_in_steam", "stageMin": 8, "path": "corruption", "text": "My cries bounced through the steamy chamber. I didn’t care who heard—the filth, the heat, it owned me." },
  
  { "key": "shared_soak", "stageMin": 8, "path": "love", "text": "We sank into the hot pool together. He held me in his lap, slow thrusts mixing tenderness and desire." },
  
  { "key": "caught_by_matron", "stageMin": 9, "path": "corruption", "text": "The bath matron pounded on the door, shouting. He didn’t stop. I screamed louder, drowning her out." },
  
  { "key": "steam_slave", "stageMin": 10, "path": "corruption", "text": "He used me against the tiled wall, pounding until I came undone, dripping down the stones. Steam and seed—my new perfume." },
  
  { "key": "waterbound_vows", "stageMin": 10, "path": "love", "text": "In the hottest pool, he whispered that I was his, forever. I believed him, filth and all." },
  { "key": "taboo_union", "stageMin": 10, "path": "hybrid", "text": "We fucked in the open bath, steam cloaking our bodies. I screamed his name, daring the world to judge us." }
],
      "brothel": [
  { "key": "brothel_entry", "stageMin": 0, "path": "any", "text": "The lanterns glowed red. Perfume and sweat clung to the walls. I told myself I didn’t belong here—but followed him in anyway." },

  { "key": "stolen_glances", "stageMin": 1, "path": "any", "text": "He smirked while women eyed him. My chest tightened with jealousy, though I said nothing." },

  { "key": "hands_on_back", "stageMin": 2, "path": "any", "text": "He pressed his palm to the small of my back, guiding me past silk curtains. It looked like ownership. It felt like it too." },

  { "key": "curtain_kiss", "stageMin": 3, "path": "love", "text": "Behind the drapes, he kissed me gently, as though the noise outside didn’t exist." },
  { "key": "wall_thrust", "stageMin": 3, "path": "corruption", "text": "He shoved me into the wall, hips grinding against me while laughter echoed from the next room. My breath betrayed me with moans." },
  { "key": "forbidden_tease", "stageMin": 3, "path": "hybrid", "text": "His lips were sweet, but his hands rough. I melted into both—the tender and the taboo." },

  { "key": "lap_dance", "stageMin": 4, "path": "corruption", "text": "He sat on the velvet chair, yanked me onto his lap. The music throbbed as I ground down shamelessly in time with it." },
  { "key": "silk_caress", "stageMin": 4, "path": "love", "text": "He draped silk across my bare shoulders, tracing it with reverence. Even here, he made me feel cherished." },

  { "key": "mirror_reflection", "stageMin": 5, "path": "any", "text": "We caught our reflection in the brothel mirror. My flushed face looked like someone else’s, someone I barely recognized." },

  { "key": "velvet_claim", "stageMin": 6, "path": "corruption", "text": "He bent me over a velvet couch and took me hard. The groans around us only made me wetter." },
  { "key": "slow_worship", "stageMin": 6, "path": "love", "text": "Among the chaos, he held me steady, whispering that I was the only one that mattered." },
  { "key": "scent_of_lust", "stageMin": 6, "path": "hybrid", "text": "Perfume and musk coated the air. His thrusts made me forget which scent was his and which was mine." },

  { "key": "open_chamber", "stageMin": 7, "path": "corruption", "text": "He pulled me into an open chamber. Curtains drawn back, eyes watching, and he still forced me down onto him. I screamed with abandon." },
  { "key": "half_hidden", "stageMin": 7, "path": "hybrid", "text": "We hid half behind a curtain while strangers laughed only steps away. The risk only made me crave him more." },

  { "key": "stage_show", "stageMin": 8, "path": "corruption", "text": "He tossed me onto the stage where others had performed. My body arched as he used me like the main act." },
  { "key": "shared_moan", "stageMin": 8, "path": "love", "text": "Amid the brothel’s chaos, we found each other’s mouths, our kiss louder than the moans around us." },

  { "key": "curtain_rip", "stageMin": 9, "path": "corruption", "text": "He tore the curtain aside, exposing me mid-thrust to the room. My shame turned instantly to dripping arousal." },

  { "key": "red_lantern_vows", "stageMin": 10, "path": "love", "text": "Under the red glow, he whispered promises against my neck: love lasting longer than lust." },
  { "key": "brothel_whore", "stageMin": 10, "path": "corruption", "text": "He made me scream until every client knew my name. I left the brothel dripping, claimed as his whore." },
  { "key": "taboo_queen", "stageMin": 10, "path": "hybrid", "text": "The girls cheered as if I’d joined their ranks. I strutted out, body wrecked and glowing, proud to be his taboo queen." },
        { "key": "brothel_pregnancy_scare", "stageMin": 5, "path": "any", "text": "The red lanterns blurred when my belly fluttered. Fear gnawed at me—what if his seed had already taken root here, of all places?" },

  { "key": "brothel_pregnancy_confession", "stageMin": 6, "path": "love", "text": "He touched my stomach softly after the act, whispering that no matter where it began—even here—our child would be ours." },

  { "key": "brothel_pregnancy_marked", "stageMin": 7, "path": "corruption", "text": "He finished inside me again and again, laughing that every man outside would hear me groan while he planted his claim deeper. I shivered at the thought of carrying it out the door." },

  { "key": "brothel_pregnancy_display", "stageMin": 8, "path": "hybrid", "text": "Curtains half-open, his hand slid down to my belly mid-thrust. He pressed there like he wanted the whole room to know I might already be his breeder." },

  { "key": "brothel_pregnancy_pride", "stageMin": 9, "path": "corruption", "text": "I staggered out, thighs dripping, one hand on my belly. The whores smiled knowingly, whispering 'his broodmare'—and I didn’t correct them." },

  { "key": "brothel_pregnancy_vow", "stageMin": 10, "path": "love", "text": "Beneath the red lantern, he kissed my swollen belly. I cried, not for shame, but for the vow that our child was proof of love in the filthiest of places." },

  { "key": "brothel_pregnancy_exhibition", "stageMin": 10, "path": "corruption", "text": "He forced me on stage with my belly heavy. Every thrust made the crowd roar. I moaned louder than ever, pride swelling that they saw me as nothing but his fertile whore." }
      ],
  "festival_tent": [
  { "key": "tent_entry", "stageMin": 0, "path": "any", "text": "The music outside was wild, but in here it felt too quiet. His shadow loomed close—I told myself it was just the lantern swaying." },

  { "key": "tent_glance", "stageMin": 1, "path": "any", "text": "He leaned close, laughter muffled by fabric walls. My heart raced—was it the drums, or the heat in his eyes?" },

  { "key": "tent_hand_brush", "stageMin": 2, "path": "any", "text": "Our fingers touched on the straw mat. Rough, dirty, too deliberate to be accidental. I didn’t pull away fast enough." },

  { "key": "tent_kiss_stolen", "stageMin": 3, "path": "love", "text": "The crowd cheered outside while he stole a kiss in the dark. I pressed back, desperate, hoping no one would hear the small sound I made." },

  { "key": "tent_forceful_grab", "stageMin": 3, "path": "corruption", "text": "He pinned me against the canvas and took my lips without asking. My muffled whimper melted into hunger I didn’t want to admit." },

  { "key": "tent_tangle", "stageMin": 4, "path": "hybrid", "text": "Half anger, half need—I pushed at him but let him hold me tighter. Shame bled into heat as our mouths crashed again." },

  { "key": "tent_moan_hidden", "stageMin": 5, "path": "any", "text": "I bit my knuckle when he touched me where no one else dared. Outside, the festival drums masked my moans—barely." },

  { "key": "tent_on_knees", "stageMin": 6, "path": "corruption", "text": "He pushed my head down, the dirt and musk overwhelming. I gagged softly, but part of me thrilled that anyone could pull open the flap and see." },

  { "key": "tent_lover_embrace", "stageMin": 6, "path": "love", "text": "He laid me down gentle on the straw, his forehead pressed to mine while the fireworks shook the canvas. I let him in, whispering his name like a prayer." },

  { "key": "tent_exhibition", "stageMin": 7, "path": "hybrid", "text": "He ripped my dress aside and pressed deep as the lantern light flickered. I wanted to scream, but the thought of being overheard made me burn hotter." },

  { "key": "tent_taken", "stageMin": 8, "path": "corruption", "text": "He took me hard against the pole, canvas shaking with every thrust. I cried out, knowing people outside heard—and I didn’t care." },

  { "key": "tent_devotion", "stageMin": 8, "path": "love", "text": "We moved together in silence, hiding love inside chaos. I wanted the moment to never end, even as the crowd laughed just beyond." },

  { "key": "tent_unashamed", "stageMin": 9, "path": "hybrid", "text": "His seed dripped down my thighs when he pulled me upright. We stepped out together, flushed, knowing eyes followed us. I smiled anyway." },

  { "key": "tent_possession", "stageMin": 9, "path": "corruption", "text": "He spilled inside me, then pushed me to the flap, holding me so the crowd could hear my panting. I was nothing but his, and I moaned my acceptance." },

  { "key": "tent_extreme", "stageMin": 10, "path": "any", "text": "The tent collapsed around us mid-act, shouts erupting from outside. Straw, canvas, bodies tangled—and I screamed his name, unashamed, as everyone saw the truth of what we were." },
  
  "festival_tent_pregnancy": [
  { "key": "tent_pregnancy_fear", "stageMin": 4, "path": "any", "text": "When he touched me beneath the lantern glow, I clutched my belly, terrified someone might notice how it swelled. The crowd laughed outside—I prayed they wouldn’t see." },

  { "key": "tent_pregnancy_desire", "stageMin": 5, "path": "love", "text": "He rested his hand on my stomach as he kissed me. I thought I’d cry from the tenderness. Even hidden in this tent, the world felt bright with the future inside me." },

  { "key": "tent_pregnancy_shame", "stageMin": 5, "path": "corruption", "text": "The drums outside rattled while he pushed me down. My swollen belly pressed against the mat, his seed already inside me. I whimpered—not from resistance, but from craving more." },

  { "key": "tent_pregnancy_public_thill", "stageMin": 7, "path": "hybrid", "text": "The fabric walls shuddered as he moved inside me. I arched back, one hand cradling the life he gave me, the other clinging to him. I wanted someone to hear—I wanted them to know." },

  { "key": "tent_pregnancy_weight", "stageMin": 8, "path": "corruption", "text": "Every thrust pressed down on the child growing within me. Shame should have stopped me, but I only begged louder, moaning as if daring the whole festival to hear." },

  { "key": "tent_pregnancy_devotion", "stageMin": 8, "path": "love", "text": "He kissed my swollen belly between every movement, whispering promises even as we trembled at the thought of being overheard." },

  { "key": "tent_pregnancy_display", "stageMin": 9, "path": "corruption", "text": "He pulled me to the flap, belly round and heavy, and slammed me against the canvas until it rattled. Voices outside paused—I flushed with shame, but I couldn’t stop moaning his name." },

  { "key": "tent_pregnancy_pride", "stageMin": 9, "path": "love", "text": "He held me in his arms, hand on my belly, while we lay tangled in straw. For the first time, I didn’t care if the world outside guessed—I was proud of what we’d made together." },

  { "key": "tent_pregnancy_extreme", "stageMin": 10, "path": "any", "text": "The tent collapsed around us, revealing everything—the sweat, the thrusts, the swell of my stomach. I cried out, overwhelmed, not in fear but in shameless pride that I was his, body and child both." }
  ],
  "starlight_snap_booth": [
  { "key": "snap_booth_shy", "stageMin": 0, "path": "any", "text": "The booth curtain closed, and we were shoulder-to-shoulder in the tiny space. My heart beat louder than the timer’s beep." },

  { "key": "snap_booth_brush", "stageMin": 1, "path": "any", "text": "Our arms brushed as the flash went off. I pretended to laugh, but I couldn’t stop thinking about how close he was." },

  { "key": "snap_booth_kiss", "stageMin": 2, "path": "love", "text": "The camera clicked the moment his lips found mine—an accidental souvenir of something I’ll never forget." },

  { "key": "snap_booth_hand", "stageMin": 2, "path": "corruption", "text": "His hand slid beneath my skirt just as the flash went off. If anyone sees the strip, they’ll know exactly what happened in that frame." },

  { "key": "snap_booth_caught", "stageMin": 3, "path": "hybrid", "text": "The curtain shifted, a giggle outside. We froze—me straddling his lap, his hands gripping me. The camera captured my gasp forever." },

  { "key": "snap_booth_tongue", "stageMin": 4, "path": "corruption", "text": "He kissed me with tongue, the wet sound loud in the silence between flashes. I knew the camera caught my moan." },

  { "key": "snap_booth_pressed", "stageMin": 5, "path": "love", "text": "He pressed me against the glass wall, kissing me like I was the only thing that mattered, while the camera clicked our laughter." },

  { "key": "snap_booth_fingers", "stageMin": 6, "path": "corruption", "text": "His fingers slipped inside me, and I bit his shoulder to keep from crying out. The photo strip will look innocent—only we know the truth." },

  { "key": "snap_booth_public", "stageMin": 7, "path": "hybrid", "text": "I bounced on his lap as the flashes went off in sequence, turning our filth into a set of photos I’ll never dare show anyone." },

  { "key": "snap_booth_extreme", "stageMin": 10, "path": "corruption", "text": "The booth curtain ripped open mid-thrust. I locked eyes with a stranger outside as the last flash burned his seed inside me onto film. I didn’t care. I wanted the world to see." }
  ],
  "starlight_snap_booth_pregnancy": [
  { "key": "snap_booth_belly_glance", "stageMin": 4, "path": "any", "text": "The flash caught my rounded belly between us. I flushed red, but his hands lingered there, proud and possessive." },

  { "key": "snap_booth_belly_kiss", "stageMin": 5, "path": "love", "text": "He kissed my swollen stomach just as the camera clicked. The picture showed nothing else, but to me it was everything." },

  { "key": "snap_booth_exposed_curve", "stageMin": 6, "path": "corruption", "text": "He tugged my dress up to expose the curve of me as the shutter snapped. I should’ve stopped him—but the thrill of being displayed burned hotter than shame." },

  { "key": "snap_booth_pregnant_straddle", "stageMin": 7, "path": "hybrid", "text": "I straddled him awkwardly, belly pressing into his chest. The photos will look obscene, but the smile on my lips was pure joy." },

  { "key": "snap_booth_pregnant_moan", "stageMin": 8, "path": "corruption", "text": "The camera caught my head thrown back, mouth open in a moan as he filled me, swollen belly shaking with every thrust." },

  { "key": "snap_booth_tender_family", "stageMin": 9, "path": "love", "text": "We sat close, his hand spread across my stomach. For once the photos looked less like scandal and more like a family portrait." },

  { "key": "snap_booth_public_flaunt", "stageMin": 10, "path": "corruption", "text": "He held me wide open, my swollen belly framed in the shot, his seed dripping out of me as strangers laughed outside the booth. I didn’t care—I wanted proof that I belonged to him." }
  ],
  "train_ride": [
  { "stage": 0, "path": "any", "text": "I sat across from him on the rattling bench, pretending not to notice the grime on his hands. He smirked at me like he knew I was watching." },
  { "stage": 1, "path": "any", "text": "The sway of the carriage rocked me closer. His knee brushed mine, rough fabric scraping my skin. I pulled away… too quickly." },
  { "stage": 2, "path": "love", "text": "The lantern light flickered over his face as he leaned close to whisper. I should have pushed him back. Instead, I found myself smiling." },
  { "stage": 2, "path": "corruption", "text": "His hand lingered far too long on my thigh. I hissed at him to stop, but my voice shook more with heat than anger." },
  { "stage": 3, "path": "any", "text": "The train rocked harder, and so did we—his arm curling around my waist, pulling me flush against his filthy chest. My heart pounded louder than the rails." },
  { "stage": 4, "path": "love", "text": "He kissed me by the window. The glass fogged as our mouths moved hungrily, the world speeding past unseen." },
  { "stage": 4, "path": "corruption", "text": "His filthy hand snuck under my skirt. I slapped it away, cheeks burning. He only grinned, the dirt under his nails still scratching my thigh." },
  { "stage": 5, "path": "any", "text": "We found a secluded corner near the freight car. His mouth was on mine, his hand gripping my hip. Every jolt of the tracks made us grind harder together." },
  { "stage": 6, "path": "love", "text": "He slid into me between the clatter of wheels, muffling my gasps with his lips. I clung to him, every thrust timed with the crash of the tracks." },
  { "stage": 6, "path": "corruption", "text": "He forced me against the wall, teeth on my neck, rutting like an animal. My skirt was up, his filth grinding into me raw. I moaned even as shame flooded me." },
  { "stage": 7, "path": "hybrid", "text": "We fucked like thieves, daring discovery. I kissed him through the dirt and sweat, crying his name as he pounded me into the rattling wood." },
  { "stage": 8, "path": "corruption", "text": "He bent me over the rattling bench and slammed himself inside, juices dripping onto the floor. The sound of flesh and filth mixed with the rail’s thunder." },
  { "stage": 9, "path": "any", "text": "I straddled him in the corner seat, bouncing shamelessly as the train screamed through tunnels. His hands smeared dirt over my breasts as he groaned into my mouth." },
  { "stage": 10, "path": "corruption", "text": "He spilled inside me as the conductor walked past the door. I didn’t care. I moaned louder, grinding down, clenching around his filth, milking every drop of his seed while the whole train could hear." }
  ],
  "dojo": [
  { "stage": 0, "path": "any", "text": "The tatami smelled of dust and sweat. I sat quietly, watching him mock the discipline of the place. I told myself I was only annoyed." },
  { "stage": 1, "path": "any", "text": "He picked up a staff, twirling it clumsily but grinning at me like he’d mastered it. I laughed, then regretted giving him the satisfaction." },
  { "stage": 2, "path": "love", "text": "I corrected his stance. My hands lingered on his wrists longer than I should have, guiding strength into filth." },
  { "stage": 2, "path": "corruption", "text": "He pressed too close during practice, his body foul and hot against mine. The master’s scrolls watched us in silence." },
  { "stage": 3, "path": "any", "text": "He pinned me mid-spar, his smirk daring me to wriggle free. I could feel his rough breath across my face." },
  { "stage": 4, "path": "love", "text": "We kissed between the wooden posts. His dirt smeared across my cheek, and I let it stay as proof." },
  { "stage": 4, "path": "corruption", "text": "He slammed me against the practice dummy, hand between my thighs. The creak of the dojo echoed louder than my gasp." },
  { "stage": 5, "path": "any", "text": "We stole a corner behind the weapon racks. He bit down on my shoulder while I clutched at the mats." },
  { "stage": 6, "path": "love", "text": "We fell together on the tatami, bodies slick, hips rocking in unison. My moans filled the quiet hall like chants of devotion." },
  { "stage": 6, "path": "corruption", "text": "He took me on the dojo floor, pounding into me raw while scrolls of discipline loomed above. My cries shook the walls meant for silence." },
  { "stage": 7, "path": "hybrid", "text": "We trained in lust instead of combat—his thrusts timed like drills, my body arching to meet each one. Tenderness blurred with filth." },
  { "stage": 8, "path": "corruption", "text": "He forced me face-down into the tatami, slamming harder, sweat and filth dripping into my hair. The dojo reeked of sex." },
  { "stage": 9, "path": "any", "text": "I straddled him in the practice ring, riding shamelessly. My moans bounced from the walls, louder than any sparring match." },
  { "stage": 10, "path": "corruption", "text": "He bred me like an animal in the master’s chair. His seed spilled deep, dripping onto the tatami. I screamed for more, not caring if the entire dojo heard." }
  ],
  
  "tavern_cellar": [
  { "key": "cellar_smell", "stageMin": 0, "path": "any", "text": "The cellar reeked of ale and damp wood. He leaned too close, and I wondered if the smell was him or the barrels." },
  { "key": "spill", "stageMin": 2, "path": "any", "text": "A barrel toppled, spilling froth across my skirt. He laughed—then reached to wipe it, far too slow." },
  { "key": "kiss_darkness", "stageMin": 3, "path": "love", "text": "In the candlelit dark, his lips found mine. Ale dripped down, bitter and sweet." },
  { "key": "tabletop_take", "stageMin": 5, "path": "corruption", "text": "He shoved me over the cellar table, wood splintering as he spread me wide." },
  { "key": "barrel_press", "stageMin": 7, "path": "hybrid", "text": "He pinned me against the keg, thrusts sloshing beer with every move. My laughter broke into moans." },
  { "key": "drunk_slave", "stageMin": 9, "path": "corruption", "text": "He poured ale over my chest before burying his mouth. I was drunk on him, not the drink." },
  { "key": "ale_whore", "stageMin": 10, "path": "corruption", "text": "Sticky with beer, my cries echoed with his name. I let him fuck me into the wood until I reeked of tavern and man alike." }
  ],
  "observatory": [
  { "stage": 0, "path": "any", "text": "The telescope pointed toward the stars. I wanted to talk about constellations; he only scoffed and muttered about how small they made him feel." },
  { "stage": 1, "path": "any", "text": "We stood shoulder to shoulder, gazing up. His arm brushed mine—grimy, rough. I should have moved. I didn’t." },
  { "stage": 2, "path": "love", "text": "I guided his eye to the telescope. His hands fumbled on the brass, but when he whispered my name under the stars, I melted." },
  { "stage": 2, "path": "corruption", "text": "He leaned close, stinking of sweat and smoke, whispering filth into my ear while the stars glittered indifferently above." },
  { "stage": 3, "path": "any", "text": "We kissed by the telescope’s base, the dome echoing the sound. My body trembled with a mix of shame and longing." },
  { "stage": 4, "path": "love", "text": "He pressed me softly against the railing. The cosmos swam overhead, but all I saw was the strange warmth in his dirty eyes." },
  { "stage": 4, "path": "corruption", "text": "He shoved me down over the telescope’s cold brass. My gasp echoed in the observatory as his hands roamed where they shouldn’t." },
  { "stage": 5, "path": "hybrid", "text": "We lay beneath the rotating dome, his filth against my skin, my lips whispering love against his neck. Tenderness and taboo tangled together." },
  { "stage": 6, "path": "any", "text": "He thrust into me under the skylight, each push timed with the rotation of the dome. The stars spun above as my cries filled the chamber." },
  { "stage": 7, "path": "corruption", "text": "He bent me over the telescope, fucking me until the glass fogged from my moans. The stars blurred as filth dripped between my thighs." },
  { "stage": 8, "path": "any", "text": "I rode him on the observation platform, head tossed back, breasts bouncing under the starlight. I didn’t care if the whole town below saw us." },
  { "stage": 9, "path": "corruption", "text": "He slammed into me against the dome wall, the sound of wet flesh and filth echoing louder than the turning gears. I begged for more." },
  { "stage": 10, "path": "corruption", "text": "He flooded me on the telescope’s brass, seed dripping down my thighs as I screamed like a star being born. I begged him to breed me again under the endless sky." }
  ],
  "abandoned_shack": [
  { "stage": 0, "path": "any", "text": "The shack smelled of rot and dust. I wrinkled my nose; he smirked like it suited him." },
  { "stage": 1, "path": "any", "text": "I sat on a broken chair. He leaned against the wall, grime blending with shadows. Somehow I wasn’t afraid." },
  { "stage": 2, "path": "love", "text": "The wind whistled through the cracks. He pulled his coat around me. It stank of smoke—but it was warm." },
  { "stage": 2, "path": "corruption", "text": "He pressed me against splintered wood, whispering filth as if the rot itself demanded I listen." },
  { "stage": 3, "path": "any", "text": "His lips crushed mine, dust falling from the rafters with every shuddering kiss." },
  { "stage": 4, "path": "love", "text": "We lay on a torn mattress, soft touches fighting the grit beneath us. I wanted to believe this ruin could hold something tender." },
  { "stage": 4, "path": "corruption", "text": "He bent me over the table, splinters biting my palms, his cock grinding filth into me as I whimpered at every thrust." },
  { "stage": 5, "path": "hybrid", "text": "We fucked on the floor, my moans swallowed by shadows. I loved him. I hated how much I loved the dirt, too." },
  { "stage": 6, "path": "any", "text": "He pinned me to the broken wall, each thrust rattling the whole shack. I screamed into his shoulder, knowing anyone could hear." },
  { "stage": 7, "path": "corruption", "text": "He held me down on the rotten floorboards, pounding into me while vermin scattered. His filthy seed soaked into the wood beneath us." },
  { "stage": 8, "path": "any", "text": "I rode him on the splintered table, breasts bouncing, juices soaking the rotting planks. I didn’t care if the place collapsed." },
  { "stage": 9, "path": "corruption", "text": "He spit on my face and fucked me harder, the shack echoing with wet slaps and my screams. I clawed the dirt, begging for more." },
  { "stage": 10, "path": "corruption", "text": "He bred me like an animal on the floor, seed gushing down my thighs, my body broken and marked. I screamed his name into the rotten walls until they shook." }
  ],
  "playground": [
  { "stage": 0, "text": "We passed the broken swings. I remembered children’s laughter, and felt uneasy seeing him smile there." },
  { "stage": 2, "text": "He pushed me lightly on the swing. Rust creaked, and his eyes lingered too long on my legs." },
  { "stage": 4, "text": "He caught me mid-swing, pulling me against him. My cheeks burned—this place isn’t for things like that." },
  { "stage": 6, "text": "We kissed hard on the slide, paint flaking beneath my back. Wrong place, wrong time, and I didn’t care." },
  { "stage": 8, "text": "He bent me over the metal bar, my cries mixed with squeaks of rusted chains. Anyone walking by could see everything." },
  { "stage": 10, "text": "He took me on the merry-go-round, thrusts spinning the world until I screamed. My body clung to him, juices dripping, painted in filth under the open night." }
  ],
  "back_alleys": [
  { "stage": 0, "text": "He led me down narrow streets, his hand rough on mine. I told myself it was just for safety." },
  { "stage": 2, "text": "The alley stank of rot, yet my pulse quickened when he pressed me against a wall and whispered filth." },
  { "stage": 4, "text": "He slid his hand under my skirt, daring me to push him away. I froze, torn between shame and heat." },
  { "stage": 6, "text": "I spread for him against the bricks, moaning low while footsteps passed just meters away." },
  { "stage": 8, "text": "He filled me raw in the filth of the alley, his grunts echoing with mine. Trash rustled, rats scattered—and I begged for more." },
  { "stage": 10, "text": "Pinned against dripping walls, my cries bounced off the stone. He bred me like an animal in public filth, and I came screaming his name for all to hear." }
  ],
  "love_hotel": [
  { "stage": 0, "text": "I passed the glowing sign and blushed. He chuckled, daring me to look inside. I refused." },
  { "stage": 2, "text": "He teased me outside the red door, saying one day I’d follow him in. My cheeks betrayed me." },
  { "stage": 4, "text": "Inside, velvet walls closed around us. My knees trembled when he locked the door." },

  { "stage": 6, "text": "He laid me on satin sheets, kissing down my neck as the mirror reflected every shiver." },
  { "stage": 6, "text": "We tried the mirror bed. Watching myself gasp as he thrust inside me made me hotter than I ever imagined." },
    
  { "stage": 7, "text": "He pushed me onto all fours in front of the mirror. My face burned as I watched myself moan like a whore." },
  { "stage": 7, "text": "He spread me wide on the velvet chair. My cries echoed off the gaudy walls, and I didn’t care who heard." },

  { "stage": 8, "text": "I rode him hard in the neon light, my breasts bouncing, his hands slapping my ass until I screamed." },
  { "stage": 8, "text": "He pulled out the restraints from the drawer. I let him tie me down and fuck me like I belonged to him." },

  { "stage": 9, "text": "He ripped off the condom mid-thrust, growling that he wanted me raw. My legs wrapped tight around him before I could think." },
  { "stage": 9, "text": "He slammed into me again and again, and when I begged him not to stop, he whispered, 'Then take all of it' as his seed filled me." },
  { "stage": 9, "text": "I felt him swelling inside me, pulsing, and I pulled him deeper with my legs locked around his waist. I wanted every drop." },
    
  { "stage": 10, "text": "Pinned to the mirrored wall, his cock split me wide. My moans shook the glass as he bred me like an animal." },
  { "stage": 10, "text": "I came so hard I nearly screamed the walls down. My juices soaked the sheets, his cum pouring out of me, and still he didn’t stop." },
  { "stage": 10, "text": "He pressed his hand against my belly, snarling that he wanted to see me swollen with his child. My body betrayed me—I came the hardest I ever have." }
  ],
 "playground": [
  { "stage": 0, "text": "The rusted swings creaked in the breeze. I sat for a moment, remembering being a child here." },
  { "stage": 1, "text": "He laughed when I sat on the swing. For a second it felt innocent… until I saw the hunger in his eyes." },
  { "stage": 2, "text": "We walked past the seesaw. He teased me, saying I should ride it with him. I blushed and kept walking." },
  { "stage": 3, "text": "He pushed me lightly on the swing, standing close. My heart raced with each shove forward." },
  { "stage": 4, "text": "He pulled me against the slide, lips crushing mine. The metal was cold on my back, his body hot." },

  { "stage": 6, "text": "He bent me over the slide, taking me from behind. The squeak of the metal made it feel louder, riskier." },
  { "stage": 6, "text": "I straddled him on the old roundabout, squealing as it spun, his cock bouncing inside me with every turn." },

  { "stage": 7, "text": "He shoved me onto the swing, fucking me while the chains rattled. I gripped tight, moaning with every thrust." },
  { "stage": 7, "text": "Pinned under the monkey bars, I screamed his name as he pounded me, the whole playground echoing my cries." },

  { "stage": 8, "text": "I rode his face on the slide, juices running down onto the rusted metal. He lapped me raw while I begged louder." },
  { "stage": 8, "text": "He spit on me in the sandbox, then fucked me until sand clung to my sweaty back and I moaned like a slut." },

  { "stage": 9, "text": "He tore off the condom mid-thrust in the swing seat. My legs wrapped tight around him—I wanted it raw, wanted it deep." },
  { "stage": 9, "text": "He pushed me onto the merry-go-round, thrusting while it spun. I begged him to fill me, screaming I wanted his child." },
  { "stage": 9, "text": "I clung to the monkey bars as he railed me from behind, snarling that he’d breed me here for everyone to see. I locked my legs and took every drop." },

  { "stage": 10, "text": "He threw me down in the sandbox, pounding me until the air left my lungs. Sand stuck to my ass as he spilled inside me again and again." },
  { "stage": 10, "text": "Straddling the seesaw, he slammed into me while I screamed for more. Our filth soaked the rusted wood, every squeal a filthy confession." },
  { "stage": 10, "text": "He made me kneel at the slide’s bottom, fucking my throat until I gagged, then pulled me up and bred me raw. My screams turned to moans as cum dripped down my thighs in the open air." }
 ], 
  
  "guard_tower": [
  { "key": "lookout", "stageMin": 0, "path": "any", "text": "We climbed the tower at dusk. I told myself it was for the view, not for him." },
  { "key": "lean_on_wall", "stageMin": 2, "path": "any", "text": "He braced against the stone, watching me instead of the horizon." },
  { "key": "kiss_high", "stageMin": 3, "path": "love", "text": "Wind tangled my hair as he kissed me hard, the city sprawling beneath us." },
  { "key": "armor_clash", "stageMin": 5, "path": "corruption", "text": "He tore at my clothes, metal clasps ringing like bells in the dark." },
  { "key": "bend_tower", "stageMin": 7, "path": "hybrid", "text": "He bent me over the parapet, thrusting while the city slept beneath our cries." },
  { "key": "watchman", "stageMin": 9, "path": "corruption", "text": "A guard below shouted up. I smothered my scream in his shoulder while he pounded deeper." },
  { "key": "skyline_slut", "stageMin": 10, "path": "corruption", "text": "At dawn, he filled me raw atop the tower. I welcomed the sun as proof of my ruin, high and unashamed." }
  ],
    
  "library": [
  { "key": "whisper", "stageMin": 0, "path": "any", "text": "Books lined the walls, dust thick as silence. His whisper felt louder than it should." },
  { "key": "page_brush", "stageMin": 2, "path": "any", "text": "His fingers brushed mine over a page. I forgot the words we were meant to be reading." },
  { "key": "kiss_between_stacks", "stageMin": 3, "path": "love", "text": "In the hidden aisle, he kissed me. Dust fell like confetti." },
  { "key": "silence_broken", "stageMin": 5, "path": "corruption", "text": "He lifted my skirt and shoved into me between shelves. I bit back screams; the books bore witness." },
  { "key": "reading_stand", "stageMin": 7, "path": "hybrid", "text": "He bent me over the oak reading stand. My moans blurred into the sound of flipping pages." },
  { "key": "page_torn", "stageMin": 9, "path": "corruption", "text": "He ripped a book page in the frenzy of thrusts. I laughed, moaned, begged for more." },
  { "key": "knowledge_whore", "stageMin": 10, "path": "corruption", "text": "He finished inside me atop a pile of scrolls. I came undone knowing history would reek of us forever." }
  ]
    },
  "events": {
    "jobs": {
  "flower_shop": [
  { "key": "arrange_bouquets", "stageMin": 0, "path": "any", "text": "I spent the morning arranging lilies. He leaned against the door, smirking, eyes on me instead of the flowers. I pretended not to notice." },
  { "key": "petal_touch", "stageMin": 1, "path": "any", "text": "His fingers brushed mine as I handed him a bloom. Rough, unwashed… but it made my heart skip." },
  { "key": "behind_counter", "stageMin": 2, "path": "any", "text": "He cornered me behind the counter. Dirt and sweat against petals, I whispered for him to stop. I didn’t move away." },

  { "key": "backroom_grab", "stageMin": 3, "path": "corruption", "text": "The shop was empty when his hands slid up my skirt. Surrounded by bouquets, I gasped, 'Not here…' He didn’t care. Neither did I." },
  { "key": "rose_thorns", "stageMin": 4, "path": "love", "text": "He pricked his hand on a thorn. I kissed the blood away. His lips caught mine next, raw and needy." },
  { "key": "stained_petals", "stageMin": 4, "path": "corruption", "text": "Petals fell as he bent me over the workbench, every thrust scattering roses and dirt. My moans echoed like a hymn of shame." },

  { "key": "display_window", "stageMin": 5, "path": "any", "text": "He pressed me against the front display window. Outside, footsteps passed. I prayed they wouldn’t glance in—while my body begged for him harder." },

  { "key": "scent_of_sex", "stageMin": 6, "path": "corruption", "text": "The shop reeked of sweat and cum more than flowers. My thighs dripped as I watered roses, aching for him to ruin me again." },
  { "key": "floral_womb", "stageMin": 7, "path": "corruption", "text": "He came inside me among the carnations, whispering that I was his fertile garden. I squeezed him tighter, craving the filth of being seeded here." },

  { "key": "petals_on_tongue", "stageMin": 8, "path": "hybrid", "text": "He stuffed petals into my mouth as his cock filled me. Their sweetness mixed with his salt. I choked on both, begging for more." },
  { "key": "display_case_fuck", "stageMin": 9, "path": "corruption", "text": "He threw me on the glass display, fucking me hard while bouquets toppled. My screams mixed with the crash of vases breaking." },
  { "key": "seeded_in_shop", "stageMin": 10, "path": "corruption", "text": "He pinned me down in the flower bed, thrusting deep until his seed spilled inside me. Windows wide open, I screamed his name—uncaring who heard. I wanted the whole slum to know I belonged to him." }
    ],
"barmaid": [
  { "key": "drink_orders", "stageMin": 0, "path": "any", "text": "I wiped mugs and carried trays. He sat at the end of the bar, watching like I was on the menu too." },
  { "key": "close_pour", "stageMin": 1, "path": "any", "text": "I leaned to pour his drink, his hand brushed mine on the handle. My cheeks burned hotter than the liquor." },
  { "key": "corner_table", "stageMin": 2, "path": "any", "text": "He tugged me toward the corner table when no one looked. His breath was strong with ale. I didn’t pull away." },
  { "key": "lap_sit", "stageMin": 3, "path": "corruption", "text": "I carried his drink over, he pulled me onto his lap in front of everyone. I gasped, pretending to fight him off. My hips betrayed me, grinding down." },
  { "key": "backroom_whisper", "stageMin": 4, "path": "love", "text": "He followed me behind the bar. I should’ve pushed him back, but instead I melted when his arms wrapped me tight, whispering I was his." },
  { "key": "storage_kiss", "stageMin": 5, "path": "any", "text": "Among crates and kegs he kissed me breathless. The smell of beer and sweat made it dizzying. I wanted more." },
  { "key": "bar_counter_grind", "stageMin": 6, "path": "corruption", "text": "He bent me forward over the sticky bar. Patrons shouted for drinks, and all I could feel was him pressing into me from behind." },
  { "key": "tabletop_claim", "stageMin": 7, "path": "hybrid", "text": "He threw me atop a table, knocking mugs aside. Shame and thrill tangled as I wrapped my legs around him with people just steps away." },
  { "key": "open_serving", "stageMin": 8, "path": "corruption", "text": "He slid me onto the counter, pulling me close while I still wore my apron. I moaned into the open bar, too far gone to care who saw." },
  { "key": "barmaid_taken", "stageMin": 9, "path": "corruption", "text": "He pulled my skirt up as I served drinks. Every thrust rocked me against the counter, and I spilled ale all over laughing patrons." },
  { "key": "public_exposure", "stageMin": 10, "path": "corruption", "text": "He yanked me into his lap mid-shift, legs spread wide in front of a room full of drunks. I begged, screamed, and came anyway as the bar roared." }
],
"nurse": [
  { "key": "bandage_wrap", "stageMin": 0, "path": "any", "text": "I cleaned his wounds, wrapping bandages tight. He hissed at the sting, but didn’t look away from my eyes." },
  { "key": "pulse_check", "stageMin": 1, "path": "any", "text": "I held his wrist to check his pulse. His skin was hot, and I realized mine was racing faster than his." },
  { "key": "bedside_whisper", "stageMin": 2, "path": "any", "text": "He tugged me close while I changed his sheets. His voice was low, rough—he called me his angel. I almost believed him." },
  { "key": "curtain_kiss", "stageMin": 3, "path": "love", "text": "I drew the privacy curtain, only to feel him grab my hand. He pulled me down onto the cot, kissing me hard enough to forget where we were." },
  { "key": "supply_closet", "stageMin": 4, "path": "corruption", "text": "I pushed him into the supply closet to scold him. He shoved me against shelves instead, my moans mixing with the rattle of medicine bottles." },
  { "key": "lap_check", "stageMin": 5, "path": "hybrid", "text": "I sat on his lap to take his temperature. He bit back a groan, pressing against me shamelessly. I didn’t stop writing notes." },
  { "key": "exam_table", "stageMin": 6, "path": "any", "text": "He lifted me onto the cold exam table. My legs shook as he spread them, and I gasped at the heat between us in such a sterile place." },
  { "key": "hallway_touch", "stageMin": 7, "path": "corruption", "text": "He caught me in the dark hallway. His hand slid beneath my skirt while footsteps passed outside. I choked down a moan, praying no one opened the door." },
  { "key": "drip_feed", "stageMin": 8, "path": "hybrid", "text": "The IV bag clicked overhead while he thrust into me, hard and fast. My screams turned into whimpers as I clung to the rails." },
  { "key": "clinic_claim", "stageMin": 9, "path": "corruption", "text": "He bent me over the patient desk. Papers scattered while he fucked me raw, his growls drowning out every plea for silence." },
  { "key": "nurse_unmasked", "stageMin": 10, "path": "corruption", "text": "In my uniform, stockings ripped, I straddled him in the open ward. He came inside me again and again, patients groaning nearby, and I didn’t care who watched." }
],
"maid": [
  { "key": "dusting", "stageMin": 0, "path": "any", "text": "I dusted the shelves while he lounged. He watched without shame, and I pretended not to notice." },
  { "key": "laundry", "stageMin": 1, "path": "any", "text": "I knelt to scrub his shirt clean. His eyes lingered low, and I flushed, scrubbing harder to distract myself." },
  { "key": "spilled_bucket", "stageMin": 2, "path": "any", "text": "I tripped, spilling water across the floor. He caught me before I fell, holding me just a beat too long." },
  { "key": "floor_wipe", "stageMin": 3, "path": "love", "text": "I scrubbed the floor on my knees. He crouched beside me, brushing my hair back gently, then stealing a kiss." },
  { "key": "apron_pull", "stageMin": 4, "path": "corruption", "text": "He yanked at my apron strings. I told him to wait. He didn’t." },
  { "key": "tray_drop", "stageMin": 5, "path": "hybrid", "text": "I dropped a tray of dishes when he pressed against me from behind. He whispered filth in my ear while I bent to clean up the mess." },
  { "key": "bed_sheets", "stageMin": 6, "path": "any", "text": "I tucked in fresh sheets, only for him to shove me onto the bed. His mouth covered mine before I could object." },
  { "key": "hallway_order", "stageMin": 7, "path": "corruption", "text": "He barked an order and I obeyed. On my knees in the hall, anyone could have walked past while he forced my lips open." },
  { "key": "feather_duster", "stageMin": 8, "path": "hybrid", "text": "He pinned me with the feather duster still in my hand. I gasped into the fabric as he took me hard, feathers flying everywhere." },
  { "key": "maid_owned", "stageMin": 9, "path": "corruption", "text": "He bent me over the table I’d just polished. Each thrust smeared sweat and filth into the shine. He called me his maid, his whore, his everything." },
  { "key": "public_uniform", "stageMin": 10, "path": "corruption", "text": "In full uniform, stockings ripped, he paraded me around the room. When he came inside me, dripping down my thighs, I was smiling—his perfect filthy servant." }
],
"librarian": [
  { "key": "cataloging", "stageMin": 0, "path": "any", "text": "I spent the morning cataloging books, pretending I didn’t notice his shadow following me between the aisles." },
  { "key": "shushed", "stageMin": 1, "path": "any", "text": "He whispered something indecent. I shushed him, cheeks burning, but part of me didn’t want him to stop." },
  { "key": "fallen_book", "stageMin": 2, "path": "any", "text": "A heavy book slipped from the shelf. He caught it—and brushed against me so closely I could smell the sweat and smoke clinging to him." },
  { "key": "reading_corner", "stageMin": 3, "path": "love", "text": "We shared a cramped reading chair, knees pressed together. His hand found mine between the pages." },
  { "key": "quiet_groan", "stageMin": 4, "path": "corruption", "text": "He pulled me onto his lap in the study alcove. I bit my lip to keep quiet as his hands roamed beneath my skirt." },
  { "key": "aisle_clutch", "stageMin": 5, "path": "hybrid", "text": "He pressed me against the dusty shelves, whispering filth into my ear. The whole library was silent, but my pulse thundered." },
  { "key": "study_desk", "stageMin": 6, "path": "love", "text": "I sprawled across a study desk, books scattered, his mouth against my chest. His tongue left me trembling as I begged for more." },
  { "key": "secret_stacks", "stageMin": 7, "path": "corruption", "text": "Deep in the restricted section, he bent me over the archive shelves. The slap of skin echoed louder than I could shush." },
  { "key": "knowledge_fucked", "stageMin": 8, "path": "hybrid", "text": "He shoved open ancient tomes to lay me across them. I screamed into the pages as he filled me, desecrating knowledge with lust." },
  { "key": "page_torn", "stageMin": 9, "path": "corruption", "text": "He ripped a book page in the frenzy of thrusts. I laughed, moaned, begged for more." },
  { "key": "knowledge_whore", "stageMin": 10, "path": "corruption", "text": "He finished inside me atop a pile of scrolls. I came undone knowing history would reek of us forever." }
],
"slum_caregiver": [
  { "key": "first_meeting", "stageMin": 0, "path": "any", "text": "I was tending to a coughing child in the alleys when he appeared—leaning in the shadows, eyes mocking, stinking of smoke and sweat. That was the first time I met him." },
  { "key": "offered_help", "stageMin": 1, "path": "any", "text": "He sneered at my bandages, called me foolish for wasting kindness. Still… he didn’t walk away." },
  { "key": "bloodied_hand", "stageMin": 2, "path": "any", "text": "I wrapped his hand when he got into a fight. He didn’t thank me, but he didn’t pull away either." },
  { "key": "lingering_touch", "stageMin": 3, "path": "love", "text": "I cleaned dirt from his face, fingers brushing over his cheek longer than they should. His grin softened, just for me." },
  { "key": "dark_teasing", "stageMin": 3, "path": "corruption", "text": "He leaned close while I treated his wounds, whispering filth about how my soft hands could do more than heal." },
  { "key": "slum_watchers", "stageMin": 4, "path": "any", "text": "People stared as I walked the alleys with him trailing after me. Their eyes burned with judgment. My heart burned with something else." },
  { "key": "forceful_kiss", "stageMin": 5, "path": "corruption", "text": "He pinned me against a wall behind the soup line, kissing me hard, tasting of grime. I should’ve pushed him off. I didn’t." },
  { "key": "charity_ruined", "stageMin": 6, "path": "hybrid", "text": "I came to hand out bread. He came to take me instead. My skirt hitched up as loaves fell to the dirt." },
  { "key": "moans_among_the_sick", "stageMin": 7, "path": "corruption", "text": "I tried to stay quiet while treating the fevered—but his fingers were already inside me. The sick groaned nearby. I groaned louder." },
  { "key": "slum_alley_claim", "stageMin": 8, "path": "corruption", "text": "He bent me over a broken crate in full view of the alleys. I clung to him, shaking, while people whispered. He owned me in front of them all." },
  { "key": "holy_inversion", "stageMin": 9, "path": "hybrid", "text": "I told myself it was charity still, letting him take me in the dirt. But the truth is I needed him—his filth, his possession, his ruin." },
  { "key": "marked_by_slums", "stageMin": 10, "path": "corruption", "text": "He finished inside me where the slums could see. My body, my moans, my seed-filled belly—proof that I belong to him, proof for everyone." }
],
"slum_singer": [
  { "stage": 0, "path": "any", "text": "The slum bar was thick with smoke and cheap liquor. I sang to keep their spirits alive… even if my own heart trembled." },
  { "stage": 1, "path": "any", "text": "Vagrant leaned at the back, smirking. He said my voice was 'too clean for this place'. I wanted to prove him wrong." },
  { "stage": 2, "path": "love", "text": "His eyes softened when I sang a softer hymn. For a moment, I believed he actually listened." },
  { "stage": 2, "path": "corruption", "text": "He shouted for a raunchier tune, the crowd laughed, and I felt heat rise to my cheeks as I obeyed." },
  { "stage": 3, "path": "any", "text": "He dragged me backstage, saying the crowd wanted 'more than a song'. My body shook between fear and excitement." },
  { "stage": 4, "path": "love", "text": "He pulled me into the shadows after a set, whispering that I belonged to him. My voice caught—but I didn’t pull away." },
  { "stage": 4, "path": "corruption", "text": "He pushed my face into the brick wall behind the stage, growling that if I wanted to keep singing, I had to earn it." },
  { "stage": 5, "path": "hybrid", "text": "The crowd cheered as his hands slid over me while I sang. Their laughter was cruel, but his touch set me on fire." },
  { "stage": 6, "path": "love", "text": "He kissed me right there as I finished my song. I thought I’d be ashamed—but the cheers made me smile." },
  { "stage": 6, "path": "corruption", "text": "He shoved my dress aside, his filthy hands claiming me while drunks whistled. I sang through a moan, my shame drowned out." },
  { "stage": 7, "path": "any", "text": "He made me sit in his lap between verses. The crowd howled; I flushed red, but couldn’t bring myself to move." },
  { "stage": 8, "path": "corruption", "text": "He made me straddle him on stage, grinding against me while I tried to sing. Every thrust turned my voice into a moan." },
  { "stage": 9, "path": "any", "text": "He bent me over the piano after hours, my voice cracking into cries that echoed through the empty bar." },
  { "stage": 10, "path": "corruption", "text": "He tore the mic from my hand and fucked me in front of the entire tavern, my juices dripping down my thighs as they cheered. I screamed out the last verse as he pumped his seed deep inside me, every eye watching." },
  { "stage": 10, "path": "hybrid", "text": "He made me his instrument—fingers inside me as I gasped lyrics into the mic. I came on stage, soaked and ruined, yet sang louder than ever." },
  { "stage": 10, "path": "love", "text": "He held me after the performance, dirty and raw, whispering that I was 'his star'. For the first time, I believed him… and I wanted the whole world to know it." }
],
"stall_merchant": [
  { "stage": 0, "path": "any", "text": "The stall smelled of fried food and dust. I smiled at passersby, trying not to notice Vagrant’s eyes on me as he leaned lazily against the crates." },
  { "stage": 1, "path": "love", "text": "He stacked boxes beside me, brushing my arm on purpose. I laughed it off, cheeks warm. It almost felt like partnership." },
  { "stage": 1, "path": "corruption", "text": "He brushed past me, hand sliding lower than it should’ve. I gasped, but he only smirked as if daring me to call him out." },
  { "stage": 2, "path": "any", "text": "We argued over prices, leaning too close. His breath was heavy with smoke, mine quick with something I refused to name." },
  { "stage": 2, "path": "corruption", "text": "Behind the stall curtain, his hand gripped my ass. I hissed at him to stop, but he squeezed harder. The heat in me betrayed my words." },
  { "stage": 3, "path": "love", "text": "He brushed my cheek with dirty fingers while I handed change to a customer. I should’ve scolded him, but I only blushed." },
  { "stage": 3, "path": "corruption", "text": "His bulge pressed against me while we pretended to stock goods. My thighs squeezed together, juices threatening to dampen my underwear." },
  { "stage": 4, "path": "hybrid", "text": "He pulled me into his lap behind the counter. I tried to stifle my moans, but the jostling baskets betrayed us." },
  { "stage": 4, "path": "corruption", "text": "He slid his filthy fingers under my skirt mid-shift. I squirted against his palm, soaking the wood floor. My knees buckled, but his grip kept me upright." },
  { "stage": 5, "path": "any", "text": "He made me sit astride him on the stall’s chair, grinding against me until my panties stuck wet against my flower. I prayed no one peeked under the curtain." },
  { "stage": 6, "path": "corruption", "text": "He pushed inside me quick and rough while a drunk customer haggled loudly outside. I bit his shoulder, trying not to squeal as his seed spilled in me." },
  { "stage": 6, "path": "love", "text": "He whispered, 'You’re mine even here,' as he slowly entered me. Customers walked past, and I clung to him, breathless, wet, praying they wouldn’t notice the juices dripping down my thigh." },
  { "stage": 7, "path": "hybrid", "text": "He pulled out mid-thrust, and I begged without words. He smirked and pushed back in harder, his filth dripping from me as I straddled him in broad daylight." },
  { "stage": 8, "path": "corruption", "text": "He bent me over sacks of grain and pounded me until my juices sprayed over the goods. A passerby saw through the flap—our eyes locked as Vagrant came deep inside me." },
  { "stage": 9, "path": "any", "text": "He ripped my blouse open during market rush, my breasts bouncing as he fucked me hard against the stall. The crowd roared with laughter, my body shaking with orgasm after orgasm." },
  { "stage": 10, "path": "corruption", "text": "He tore off the condom and spilled his seed into me in full view of gawking customers. My flower drooled filth down my thighs, and I begged him to keep breeding me as the stall shook." },
  { "stage": 10, "path": "love", "text": "He held my belly, thrusting slow but deep until I screamed. 'Our child will be born here in the slums,' he whispered, filling me as I came again, juices flooding the wooden floor." },
  { "stage": 10, "path": "hybrid", "text": "He pinned me atop the counter, pounding me raw, my flower squirting across the goods. I wrapped my legs around him, refusing to let him pull out, screaming, 'Fill me again!' until he bred me twice more." }
],
"tutor": [
  { "stage": 0, "path": "any", "text": "He smirked when I offered to tutor him in letters. I told myself it was just helping. His eyes followed my lips instead of the chalk." },
  { "stage": 1, "path": "any", "text": "He pretended to struggle, leaning closer every time. His breath reeked of smoke and yet… I didn’t pull away." },
  { "stage": 2, "path": "love", "text": "He traced the words I wrote with clumsy fingers. When our hands brushed, it felt more like affection than accident." },
  { "stage": 2, "path": "corruption", "text": "He 'forgot' how to write my name three times. The last time, he whispered it against my neck instead of the slate." },
  { "stage": 3, "path": "any", "text": "I leaned in to correct him and his hand settled brazenly on my thigh. My voice wavered, but I didn’t stop the lesson." },
  { "stage": 4, "path": "love", "text": "Our reading dissolved into soft laughter. His dirty hands smudged ink across my cheek as he kissed me for the first time during a lesson." },
  { "stage": 4, "path": "corruption", "text": "The lesson ended with my back pinned against the desk. He muttered 'Teacher’s pet' while pressing into me, filth staining my skirt." },
  { "stage": 6, "path": "any", "text": "I couldn’t tell if we were studying anymore. Every touch became a distraction, every word an excuse to be closer." },
  { "stage": 8, "path": "corruption", "text": "He shoved the books aside, bending me over the table where I taught him letters. His 'lesson' left me dripping, the chalk long forgotten." },
  { "stage": 9, "path": "hybrid", "text": "We laughed as I tried to keep reading aloud with his thrusts shaking me against the desk. Love and filth tangled on every syllable." },
  { "stage": 10, "path": "corruption", "text": "Ink splattered across the floor, my hair tangled in his fists as he drove into me. The tutor became the lesson—my body, his filthy textbook." }
],
"dancer": [
  { "stage": 0, "path": "any", "text": "He sat at the back of the tavern, arms folded, watching as I stumbled through my first steps. I told myself I didn’t care what he thought." },
  { "stage": 1, "path": "any", "text": "When my hips swayed, I felt his eyes burning into me. The crowd clapped. His smirk was for me alone." },
  { "stage": 2, "path": "love", "text": "He whistled low and soft. I spun, cheeks flushed, pretending it was for the crowd when my chest ached with pride." },
  { "stage": 2, "path": "corruption", "text": "He mouthed something filthy at me between steps—my knees nearly buckled mid-turn." },
  { "stage": 3, "path": "any", "text": "I danced closer, close enough for his rough fingers to brush my calf as I passed. My skin tingled hotter than the lanterns." },
  { "stage": 4, "path": "love", "text": "He pulled me into his arms after the show, spinning me, calling me his star. My laughter turned to a kiss under the lights." },
  { "stage": 4, "path": "corruption", "text": "Backstage, he pressed me into the curtain, filthy handprints on my thighs. I danced again, but this time only for him." },
  { "stage": 6, "path": "hybrid", "text": "Each performance became ours—my body arching for the crowd, my eyes locked on him. Tender when I faltered, greedy when I twirled too near." },
  { "stage": 8, "path": "corruption", "text": "He yanked me off the floor mid-routine, forcing me to grind against his lap in front of gawking drunks. Their cheers blurred into moans as his cock pressed hard between my cheeks, juices already soaking my costume." },
  { "stage": 9, "path": "hybrid", "text": "I spread my legs wide on stage, panties sticking wet against my folds, every thrust of his fingers sending squirts splashing down my thighs. The crowd thought it was part of the show—only he knew I was cumming for him." },
  { "stage": 10, "path": "corruption", "text": "He bent me over the stage rail, pounding me raw as music blared. 'This pussy’s mine,' he growled. My flower gushed over his cock, juices spraying down my legs. I screamed my climax into the roar of applause, knowing every eye saw me branded as his." }
],
"acolyte": [
  { "stage": 0, "path": "any", "text": "I lit the candles today, keeping my eyes low when he passed by the chapel doors. The smell of dirt didn’t belong here." },
  { "stage": 1, "path": "any", "text": "He lingered too long in the pews, smirking. I whispered the hymns louder, as if the words could drown out his gaze." },
  { "stage": 2, "path": "love", "text": "He asked if I believed the light could save him. I said yes… and meant it. My heart trembled with the hope of it." },
  { "stage": 2, "path": "corruption", "text": "His laugh echoed against the altar. 'Save me with your body,' he teased. My knees weakened as shame warmed my thighs." },
  { "stage": 3, "path": "any", "text": "I knelt to pray and felt his eyes roam every curve of me. I kept whispering ‘forgive me’ as heat pooled between my legs." },
  { "stage": 4, "path": "love", "text": "He touched my hand as I placed a candle. 'You shine brighter than this place,' he murmured. My breath caught like a confession." },
  { "stage": 4, "path": "corruption", "text": "Behind the altar, he grabbed my hips, grinding against my robes. My lips chanted devotion while my body begged for more." },
  { "stage": 6, "path": "hybrid", "text": "He pulled me into the confessional, whispering sin into my ear. I let him slip his hand under my skirt as I gasped ‘holy, holy…’" },
  { "stage": 8, "path": "corruption", "text": "Bent over the altar, my cries mixed with hymns as his cock drove into me, soaking the sacred cloth with my squirt. His seed spilled where prayers should rest." },
  { "stage": 9, "path": "hybrid", "text": "I rode him on the pulpit, breasts bouncing free of my habit, moaning his name like a hymn. Each thrust made the stained glass rattle as I begged for his filthy blessing inside me." },
  { "stage": 10, "path": "corruption", "text": "He fucked me in front of the holy statues, cock spearing my womb as I screamed his name like prayer. His cum poured into me, dripping down my thighs onto sacred stone. I grinned through tears—this temple belongs to him now, and so do I." }
],
"seamstress": [
  { "stage": 0, "path": "any", "text": "I pricked my finger threading a hem when he walked in. Dirt smeared on the counter where he leaned — it didn’t belong near fine cloth." },
  { "stage": 1, "path": "any", "text": "He brushed fabric with those filthy hands, smirking as I scolded him. My cheeks burned hotter than the iron press." },
  { "stage": 2, "path": "love", "text": "He asked me to patch his sleeve. I stitched in silence, feeling the weight of his gaze on my lips every time I bit the thread." },
  { "stage": 2, "path": "corruption", "text": "He whispered how pretty I’d look spread across the sewing table. My thighs pressed together under my skirt as the needle shook in my hand." },
  { "stage": 3, "path": "any", "text": "He tugged a ribbon I wore in my hair, teasing. My heart fluttered as if he’d unraveled me entirely." },
  { "stage": 4, "path": "corruption", "text": "Behind the counter he spread my lips, juices dripping onto the workshop floor. I whimpered—terrified someone would see, wetter each second." },
  { "stage": 5, "path": "hybrid", "text": "He bound my wrists with measuring tape, pulling me onto his lap. My tight flower clenched around him as I gasped against the fabric rolls." },
  { "stage": 6, "path": "love", "text": "He kissed my stitched fingers tenderly before sliding me onto his lap. Even through the filth, his eyes softened as my body gave way to him." },
  { "stage": 7, "path": "corruption", "text": "He plugged my pussy from behind, thrusting like an animal against the workbench. My cries mixed with the clatter of spools scattering on the floor." },
  { "stage": 8, "path": "hybrid", "text": "He spread me over the cutting table, fabric soaking beneath us. 'My breeding hole is yours,' I whispered as his gigantic cock reared and filled me again and again." },
  { "stage": 9, "path": "corruption", "text": "He ripped open my blouse, tits bouncing with each thrust as my juices sprayed across unfinished gowns. I squealed in ecstasy, begging to be ruined more." },
  { "stage": 10, "path": "corruption", "text": "Bent over piles of dresses, his cock drove into my womb as cum gushed down my thighs. I screamed like a whore, moaning about my filthy breeding hole while grinning—this shop is no longer mine. It’s his den, and I’m his cum-soaked seamstress." }
]
    },
    "daily_life_simple": [
  { "stage": 0, "text": "I watered the flowers and caught myself humming. When I glanced up, he was watching. I pretended not to notice." },
  { "stage": 0, "text": "Cooking stew in the slums, I felt his eyes linger on my hands. He never said a word." },
  { "stage": 0, "text": "He leaned against the wall while I swept the floor. He smelled of smoke. I kept sweeping anyway." },
  { "stage": 0, "text": "We passed each other in the market. His smirk was faint, but it followed me home." },

  { "stage": 1, "text": "He brushed against my shoulder in the crowd. I told myself it was accidental." },
  { "stage": 1, "text": "He brought scraps of food, pretending it was nothing. I smiled more than I should have." },
  { "stage": 1, "text": "I caught him whistling my tune. I didn’t call it out, but my heart skipped anyway." },
  { "stage": 1, "text": "The dirt on his cheek made me want to reach out… I didn’t." },

  { "stage": 2, "text": "He teased me while I sold flowers. I laughed louder than I meant to." },
  { "stage": 2, "text": "He handed me a coin for flowers and brushed my palm just a second too long." },
  { "stage": 2, "text": "He mocked the way I tuck hair behind my ear. I blushed, then scolded him." },
  { "stage": 2, "text": "We shared bread on a crate in the alley. I told myself it was just a meal." },

  { "stage": 3, "text": "He stood too close as I mixed herbs. I didn’t ask him to move." },
  { "stage": 3, "text": "He teased me for being too clean. I teased him for never trying. We both smiled." },
  { "stage": 3, "text": "He reached for a flower and brushed my hand instead. I let it stay." },
  { "stage": 3, "text": "I patched a tear in his sleeve. He didn’t thank me, but he wore it proudly." },

  { "stage": 4, "text": "He leaned over me while I was sewing. My breath caught, but I kept stitching." },
  { "stage": 4, "text": "He stole a bite of stew straight from my spoon. I laughed, then flushed." },
  { "stage": 4, "text": "He whispered something crude while I was hanging laundry. I scolded him… with a smile." },
  { "stage": 4, "text": "He brushed dirt on my cheek with his thumb. I didn’t wash it off right away." },

  { "stage": 5, "text": "He rested his hand on my lower back while we walked. I let it linger." },
  { "stage": 5, "text": "He cornered me in the alley, close enough to smell his skin. I didn’t push him away." },
  { "stage": 5, "text": "I dozed off on his shoulder. The grime on his shirt stained my cheek, but I didn’t move." },
  { "stage": 5, "text": "He teased me about blushing. I teased him about noticing. Neither of us stopped smiling." },

  { "stage": 6, "text": "He pulled me against him after a long day. I melted into the heat without protest." },
  { "stage": 6, "text": "He wiped sweat from my brow with his sleeve. I told him he smelled worse, but I leaned closer anyway." },
  { "stage": 6, "text": "He asked if I’d miss him if he disappeared. I answered before I thought: yes." },
  { "stage": 6, "text": "He touched my hand in front of others. I didn’t let go." },

  { "stage": 7, "text": "He kissed my forehead while I was cooking. The stew nearly burned." },
  { "stage": 7, "text": "He teased me in front of the children. My cheeks burned hotter than theirs." },
  { "stage": 7, "text": "He caught me staring at him while he fixed his boots. I didn’t look away fast enough." },
  { "stage": 7, "text": "He held me while I swept. The broom clattered to the ground." },

  { "stage": 8, "text": "He pressed me against the doorframe. I laughed nervously, but I didn’t resist." },
  { "stage": 8, "text": "He whispered filthy things while I poured tea. My hands shook; I nearly spilled." },
  { "stage": 8, "text": "He slid his hand lower than ever before, right in the open street. My heart raced at being seen." },
  { "stage": 8, "text": "He teased me about panting when we danced in the slum square. I slapped him playfully, still breathless." },

  { "stage": 9, "text": "He gripped me by the waist while I sold flowers. I barely managed a customer’s change." },
  { "stage": 9, "text": "He pulled me into the shadows mid-conversation. My lips were swollen when I returned." },
  { "stage": 9, "text": "He spread his jacket over us on the grass. The stars blurred with every touch." },
  { "stage": 9, "text": "He kissed me in front of everyone. I didn’t care anymore." },

  { "stage": 10, "text": "He bent me over the counter while customers waited outside. I moaned loud enough to be heard." },
  { "stage": 10, "text": "He pushed me into the flowers, crushing them beneath us. I gasped and begged for more." },
  { "stage": 10, "text": "He made me ride him on the bench by the fountain. Passersby stared; I only moved harder." },
  { "stage": 10, "text": "He filled me in the open street. I screamed his name, unashamed of who listened." }
    ]
  },
      "daily_life_tainted": [
  { "stage": 0, "text": "He brushed past me in the slums, his filthy shoulder grazing mine. I told myself it was an accident, but my chest burned anyway." },
  { "stage": 0, "text": "His laughter carried across the alley as I worked. I felt it crawl under my skin like dirt I couldn’t scrub out." },
  { "stage": 0, "text": "I caught him staring while I bent for water. I flushed with anger… but I didn’t stand up right away." },
  { "stage": 0, "text": "When our fingers brushed over coins, I jerked back. My hand tingled, and I hated the part of me that wanted to hold on." },

  { "stage": 1, "text": "When he leaned close, his smell clung to me. I hated that I carried it home—and hated more that I didn’t scrub it away." },
  { "stage": 1, "text": "He called me 'too clean' while smirking. I snapped back, but my cheeks warmed at his gaze." },
  { "stage": 1, "text": "He tossed grime my way, and I scolded him. The smile on his lips lingered longer in my thoughts than the insult." },
  { "stage": 1, "text": "He dropped a filthy rag into my hands. I grimaced, but my heart pounded when his fingers lingered." },

  { "stage": 2, "text": "His laugh echoed behind me as I bent to fetch water. My cheeks flushed when I realized I bent slower, letting him look." },
  { "stage": 2, "text": "I pretended to shoo him away, but the dirt he smeared on my arm stayed there until night. I kept glancing at it." },
  { "stage": 2, "text": "I cursed when his hand brushed mine again… but later, I pressed my palm to my lips, replaying the contact." },
  { "stage": 2, "text": "He stared openly as I worked. Instead of shame, I let myself sway just a little more." },

  { "stage": 3, "text": "Sweeping the floor, he caught my wrist. Dirt smeared my skin, and I didn’t pull away. The broom clattered to the ground." },
  { "stage": 3, "text": "He whispered filth in my ear while others were near. My body tensed, but a thrill stayed in my chest." },
  { "stage": 3, "text": "His rough laugh echoed in my shop. I tried to act disgusted, but I smiled when he couldn’t see." },
  { "stage": 3, "text": "When he pressed his knee against mine, I hissed at him to stop. He didn’t—and neither did I." },

  { "stage": 4, "text": "I let him press against me in the alley’s shadow. His breath was rank, his hands rough, and my body betrayed me by leaning back into it." },
  { "stage": 4, "text": "He pulled me into the dark, dirt grinding against my dress. I trembled—not with fear, but want." },
  { "stage": 4, "text": "My lips said 'no' but my hips leaned toward him. The contradiction burned hotter than any denial." },
  { "stage": 4, "text": "His hand on my throat left no mark, only the memory. I whispered a prayer and then begged him not to stop." },

  { "stage": 5, "text": "He made a joke of my dress catching on a nail—then tugged it lower instead of fixing it. My heart raced; I didn’t stop him." },
  { "stage": 5, "text": "He pushed me against the counter, filth against petals. I gasped, but didn’t push him away." },
  { "stage": 5, "text": "He smeared his stench across my lips, daring me to spit. Instead, I licked it away." },
  { "stage": 5, "text": "When he groped me openly, I hissed—but my thighs parted against his touch." },

  { "stage": 6, "text": "I wore his smell all day after he touched me, even when others noticed. Instead of shame, I felt proud." },
  { "stage": 6, "text": "I leaned into his filth, whispering that I wanted more. The grin he gave me made my chest burn." },
  { "stage": 6, "text": "His hands dragged grime across my breasts. I arched into them, shivering with heat." },
  { "stage": 6, "text": "I caught myself moaning his name while alone. The sound filled me with both horror and need." },

  { "stage": 7, "text": "He smeared dirt across my lips and told me to smile. I did. I swallowed the taste, trembling, and begged for more." },
  { "stage": 7, "text": "He called me his little whore in the slums. I blushed, then whispered, 'Yes' back to him." },
  { "stage": 7, "text": "I begged him to mark me deeper. His filth seeped into my skin, and I sighed in relief." },
  { "stage": 7, "text": "I pressed my face to his chest, inhaling smoke and grime, desperate for it never to fade." },

  { "stage": 8, "text": "He pinned me against the market wall while people passed. I pretended to protest, but every thrust of his hips made me wetter." },
  { "stage": 8, "text": "He pushed his fingers inside me mid-conversation with another. I smiled through the words, dripping down my thigh." },
  { "stage": 8, "text": "My juices stained my dress as he fondled me in daylight. Strangers stared. I bit my lip and leaned into his hand." },
  { "stage": 8, "text": "He spat in my mouth and laughed when I swallowed. I begged for more in the middle of the crowd." },

  { "stage": 9, "text": "He forced his fingers inside me as I sold flowers. Customers saw my flushed cheeks. They thought it was heat—only I knew better." },
  { "stage": 9, "text": "He bent me over the counter. My scream was muffled by petals, my body dripping for him." },
  { "stage": 9, "text": "He made me taste myself on his fingers, whispering how dirty I’d become. I licked them clean eagerly." },
  { "stage": 9, "text": "I squirted against his hand in public. My legs shook, but I grinned at the onlookers." },

  { "stage": 10, "text": "I no longer care who sees. My body is his display. When his filth leaks from me in the daylight, I smile like it’s a badge." },
  { "stage": 10, "text": "He bred me openly, growling as I screamed his name. Gasps surrounded us—I only moaned louder." },
  { "stage": 10, "text": "He called my pussy his breeding hole. I begged him to fill it until I couldn’t walk." },
  { "stage": 10, "text": "He dragged me into the street, juices streaming down my thighs. 'Yours,' I moaned, proud for all to hear." }
      ]
    },
    "daily_life_love": [
  { "stage": 0, "text": "I watered the flowers while he lingered nearby. His silence felt safe, like he was guarding me without saying a word." },
  { "stage": 0, "text": "We shared bread on a broken step. He didn’t say much, but I caught him smiling when I laughed." },
  { "stage": 0, "text": "He carried a bucket for me, grumbling, but his hand brushed mine on the handle. I felt steady." },
  { "stage": 0, "text": "I caught him watching as I hummed a tune. For once, I didn’t look away." },

  { "stage": 1, "text": "He walked me home. Neither of us spoke, but the silence was warm." },
  { "stage": 1, "text": "I stitched a tear in his shirt. My fingers lingered on the fabric long after." },
  { "stage": 1, "text": "He leaned against the doorway as I cooked. His presence turned the meal into comfort." },
  { "stage": 1, "text": "When I tripped, he steadied me with one hand. My heart skipped." },

  { "stage": 2, "text": "We shared tea under the stars. I let the quiet stretch because it felt right." },
  { "stage": 2, "text": "He brushed dirt from my cheek, and I didn’t flinch. I wanted his touch to stay." },
  { "stage": 2, "text": "He walked close, our arms grazing. I wished the path were longer." },
  { "stage": 2, "text": "He handed me a trinket he found in the alleys. It meant nothing, but I kept it like treasure." },

  { "stage": 3, "text": "He let me lean on his shoulder while I dozed. The world felt softer there." },
  { "stage": 3, "text": "He reached for my hand. I didn’t pull away; I squeezed back." },
  { "stage": 3, "text": "We shared a blanket in the cold. I pretended to sleep so I could stay close." },
  { "stage": 3, "text": "He carried me when I was too tired. I protested weakly but nestled into his chest." },

  { "stage": 4, "text": "He kissed my forehead without a word. I held the warmth for hours." },
  { "stage": 4, "text": "We sat together, his rough hand brushing my hair back. I let him." },
  { "stage": 4, "text": "His laughter filled the room. I wanted to be the reason it kept coming." },
  { "stage": 4, "text": "I let my head rest on his lap. He didn’t move, and neither did I." },

  { "stage": 5, "text": "He kissed me gently at the door. My lips tingled long after he left." },
  { "stage": 5, "text": "His arms wrapped around me when I shivered. I didn’t want him to let go." },
  { "stage": 5, "text": "We fell asleep side by side, not touching, but I woke up with his hand in mine." },
  { "stage": 5, "text": "He told me my smile was the only clean thing in this city. I blushed." },

  { "stage": 6, "text": "Our kisses deepened, lingering until my knees went weak." },
  { "stage": 6, "text": "He held my face in both hands like I was something precious." },
  { "stage": 6, "text": "We cooked together, bumping shoulders, laughing like we’d done it forever." },
  { "stage": 6, "text": "I whispered his name before sleep, hoping he’d hear it in his dreams." },

  { "stage": 7, "text": "His kisses left me breathless, his touch reverent even in its hunger." },
  { "stage": 7, "text": "He cradled me against his chest, murmuring that I belonged there." },
  { "stage": 7, "text": "We lay tangled in the sheets. His heart beat steady against my ear." },
  { "stage": 7, "text": "I saw him smile softly at me when he thought I wasn’t looking." },

  { "stage": 8, "text": "We gave ourselves to each other slowly, tenderly, like a promise." },
  { "stage": 8, "text": "He kissed every inch of me as though memorizing a map." },
  { "stage": 8, "text": "We whispered dreams between kisses, dreams only for us." },
  { "stage": 8, "text": "He told me he loved me with every thrust, and I believed him." },

  { "stage": 9, "text": "We made love like it was sacred. Every sigh was worship." },
  { "stage": 9, "text": "I cried softly in his arms—not from sorrow, but from fullness." },
  { "stage": 9, "text": "He pressed his forehead to mine as he moved inside me. We breathed as one." },
  { "stage": 9, "text": "I told him I’d never leave. The way he held me said he already knew." },

  { "stage": 10, "text": "We lost ourselves in love so deep it erased the world." },
  { "stage": 10, "text": "His name left my lips like prayer, over and over." },
  { "stage": 10, "text": "Every part of me was his, gladly, fully, without hesitation." },
  { "stage": 10, "text": "Our love burned bright enough to make even the filth feel holy." }
    ]
  },
    "daily_life_hybrid": [
  { "stage": 0, "text": "I tended the flowers while he leaned in the doorway, filthy and amused. I wanted to scold him… yet part of me wanted him to stay." },
  { "stage": 0, "text": "He brushed past me, reeking of smoke. I wrinkled my nose but caught myself smiling." },
  { "stage": 0, "text": "We shared a meal, and when his rough hand grazed mine, I didn’t know whether to pull away or hold on." },
  { "stage": 0, "text": "I told myself he didn’t belong here. Still, my eyes followed him as he left." },

  { "stage": 1, "text": "He made a joke at my expense; I rolled my eyes, but laughter spilled out anyway." },
  { "stage": 1, "text": "I patched a tear in his sleeve, my fingers trembling at the dirt still clinging to it." },
  { "stage": 1, "text": "He leaned too close while I cooked. I felt disgust twist into a dangerous sort of warmth." },
  { "stage": 1, "text": "He grinned, and I hated how my chest tightened in response." },

  { "stage": 2, "text": "He pressed against me in a crowded alley, claiming it was an accident. My cheeks burned… because I didn’t step away." },
  { "stage": 2, "text": "He touched my cheek with a dirty hand. I should’ve slapped it away, but I closed my eyes instead." },
  { "stage": 2, "text": "His smell clung to my scarf. I buried my face in it, hating myself for liking it." },
  { "stage": 2, "text": "We walked together under lanterns. I wanted people to see us, to see me choose him—grime and all." },

  { "stage": 3, "text": "He pulled me close, smirk sharp, and I whispered for him to stop even as I melted into him." },
  { "stage": 3, "text": "We shared a blanket. I told myself it was only for warmth, but the heat in my body betrayed me." },
  { "stage": 3, "text": "He dared me to kiss him. I said no, then leaned in anyway." },
  { "stage": 3, "text": "He mocked my blush, and I hated him for noticing… but I kept blushing for him." },

  { "stage": 4, "text": "His lips tasted of ash. I told myself I hated it, then kissed him again." },
  { "stage": 4, "text": "He pinned me to the wall, and I whispered for him to stop—but my hands clutched his shirt tighter." },
  { "stage": 4, "text": "Every glance at him feels like betrayal and desire at once. I can’t tell which wins anymore." },
  { "stage": 4, "text": "He laughed when I let him hold me. I should have pushed him away. Instead, I leaned closer." },

  { "stage": 5, "text": "I kissed him first this time, then told myself it was a mistake." },
  { "stage": 5, "text": "He took my hand in front of others. My shame burned hot—but I didn’t let go." },
  { "stage": 5, "text": "He whispered filth in my ear. I should have recoiled, but I shivered with want." },
  { "stage": 5, "text": "When he left, I touched my lips and prayed no one saw how I smiled." },

  { "stage": 6, "text": "He kissed me hard enough to bruise. My lips ached, my heart raced, and I wanted more." },
  { "stage": 6, "text": "He called me his. I didn’t deny it. The word made my stomach twist—and drip with heat." },
  { "stage": 6, "text": "We pressed against each other in the shadows, daring someone to notice." },
  { "stage": 6, "text": "He pulled me onto his lap, and though I hissed for him to stop, I shifted to fit him better." },

  { "stage": 7, "text": "He licked dirt from his fingers, then touched my lips with them. I opened my mouth anyway." },
  { "stage": 7, "text": "He whispered how ruined I’d look on his cock. I trembled, because I wanted to hear it again." },
  { "stage": 7, "text": "He shoved me into an alley kiss, his stubble burning my skin raw. I clawed at him, begging silently for more." },
  { "stage": 7, "text": "When he held me down, my voice said no but my hips betrayed me." },

  { "stage": 8, "text": "He forced me onto all fours in the dirt. I moaned at the shame of it, louder than I should." },
  { "stage": 8, "text": "His filth smeared across my thighs as he thrust. I loved the way it marked me." },
  { "stage": 8, "text": "I begged him to take me rougher. Every slap of his hips made me wetter." },
  { "stage": 8, "text": "We fucked where anyone could see. My fear made it hotter." },

  { "stage": 9, "text": "He spat on me, and I licked it up without thinking. I hated how much it thrilled me." },
  { "stage": 9, "text": "He called me his whore, and I gasped—because I wanted to hear it again." },
  { "stage": 9, "text": "His cock slammed me against the wall, juices dripping onto the street. I didn’t care who saw." },
  { "stage": 9, "text": "I begged him to come inside me, even as people walked past." },

  { "stage": 10, "text": "He broke me open with his cock, and I screamed his name for the whole slum to hear." },
  { "stage": 10, "text": "My breeding hole throbbed around him, leaking and aching, begging for more." },
  { "stage": 10, "text": "Every thrust made me cry with ecstasy. I didn’t care if the world thought me ruined—I was his." },
  { "stage": 10, "text": "He fucked me until my legs gave out, my juices soaking the dirt. I whispered thank you." }
    ]
  },
  "intimacy": [
  { "stage": 0, "path": "any", "text": "He brushed past me, and though his clothes stank of smoke, my heart fluttered before I scolded myself for noticing." },
  { "stage": 0, "path": "any", "text": "Our hands touched by accident. I pulled away too quickly, cheeks hot, telling myself it meant nothing." },
  { "stage": 0, "path": "any", "text": "I felt his eyes linger. I pretended not to notice, yet my stomach turned with a strange warmth." },
  { "stage": 0, "path": "any", "text": "When he teased me about being ‘too pure,’ I laughed too hard—trying to mask the tiny thrill it gave me." },

  { "stage": 1, "path": "any", "text": "He leaned close to whisper a joke. His breath was foul, but my lips tingled anyway." },
  { "stage": 1, "path": "any", "text": "His hand steadied me as I stumbled. I pulled free quickly, but the warmth lingered." },
  { "stage": 1, "path": "any", "text": "I scolded him for brushing dirt onto my dress, but secretly I liked the attention." },
  { "stage": 1, "path": "any", "text": "When he called me beautiful, I rolled my eyes—but my chest ached with pride." },

  { "stage": 2, "path": "any", "text": "His fingers grazed mine deliberately. I froze, then let it linger too long." },
  { "stage": 2, "path": "any", "text": "We sat too close on the bench; my thigh burned where it pressed against his rough jeans." },
  { "stage": 2, "path": "any", "text": "He smelled of sweat and smoke. I should’ve hated it… but I inhaled deeper." },
  { "stage": 2, "path": "any", "text": "He teased me about blushing. I lied and said it was the cold." },

  { "stage": 3, "path": "love", "text": "He wrapped me in his arms, and though he was unwashed, I felt safe." },
  { "stage": 3, "path": "corruption", "text": "His hand wandered lower while we embraced. I gasped, but didn’t stop him right away." },
  { "stage": 3, "path": "hybrid", "text": "I buried my face against his chest. Filth, sweat, and comfort all at once—I hated how much I liked it." },
  { "stage": 3, "path": "any", "text": "His forehead pressed against mine. I could smell him. I didn’t move away." },

  { "stage": 4, "path": "love", "text": "Our lips brushed soft and unsure. My heart soared despite the grime." },
  { "stage": 4, "path": "corruption", "text": "He pressed his mouth on mine, tongue rough and demanding. I shivered… and let him in." },
  { "stage": 4, "path": "hybrid", "text": "I kissed him back, even as his dirt smeared my cheek. Sweetness and shame tangled inside me." },
  { "stage": 4, "path": "any", "text": "When I pulled away, my lips ached for more." },

  { "stage": 5, "path": "love", "text": "We lay together quietly, his fingers stroking my hair. I thought: maybe this is love." },
  { "stage": 5, "path": "corruption", "text": "He grabbed me hard, claiming my lips like they belonged to him. And they did." },
  { "stage": 5, "path": "hybrid", "text": "I craved both—the tenderness of his hand and the rough pull of his grip. I wanted it all." },
  { "stage": 5, "path": "any", "text": "When I looked at him, dirty and raw, I saw only the man who had made me his." },

  { "stage": 6, "path": "love", "text": "His kisses lingered on my neck. I clutched him tighter, wanting every second." },
  { "stage": 6, "path": "corruption", "text": "His tongue explored mine with animal hunger. I moaned into him, shameless." },
  { "stage": 6, "path": "hybrid", "text": "Every kiss turned to bites, every bite softened to kisses. Pleasure and pain twined like us." },
  { "stage": 6, "path": "any", "text": "My body trembled each time his lips found me." },

  { "stage": 7, "path": "love", "text": "He whispered that I was his light. I whispered back: I’m not going anywhere." },
  { "stage": 7, "path": "corruption", "text": "He shoved me against the wall, kissing me rough, and I kissed him back harder." },
  { "stage": 7, "path": "hybrid", "text": "I want the dirt, the bruises, and the warmth. I want it all at once, over and over." },
  { "stage": 7, "path": "any", "text": "I’m addicted to his mouth. Even when I push him away, I always return." },

  { "stage": 8, "path": "love", "text": "We tangled beneath the stars, kisses slow and endless. I wanted to be his forever." },
  { "stage": 8, "path": "corruption", "text": "He forced his tongue deep and I moaned, clutching his filthy shirt, begging for more." },
  { "stage": 8, "path": "hybrid", "text": "I dragged him closer, greedy for every kiss. The dirtier it got, the sweeter it felt." },
  { "stage": 8, "path": "any", "text": "Every kiss left me breathless, aching, wanting him inside me." },

  { "stage": 9, "path": "love", "text": "We kissed until tears wet my cheeks. I wanted all of him—forever, not just tonight." },
  { "stage": 9, "path": "corruption", "text": "His mouth owned mine, his hands pinning me. I surrendered to the filth and the fire." },
  { "stage": 9, "path": "hybrid", "text": "Love made me stay. Desire made me open wider. Together, they made me his." },
  { "stage": 9, "path": "any", "text": "Each kiss felt like a promise written in sweat and sin." },

  { "stage": 10, "path": "love", "text": "We devoured each other, not kisses but vows, raw and desperate. My body, my heart, my soul—his." },
  { "stage": 10, "path": "corruption", "text": "His filthy tongue claimed me, spit dripping down my chin. I moaned like a whore and begged for more." },
  { "stage": 10, "path": "hybrid", "text": "He crushed me with kisses, filth and tenderness at war. I didn’t care who won—I only wanted him." },
  { "stage": 10, "path": "any", "text": "The world disappeared, leaving only his mouth and the ruinous bliss of belonging to him." }
  ]
},
"erotic_lips": [
  { "stage": 0, "path": "love",       "text": "He brushed his lips over mine, soft and hesitant. My chest fluttered, but I turned away quickly." },
  { "stage": 0, "path": "corruption", "text": "His dirty mouth stole a peck from me. I scolded him, but deep down I wanted more." },
  { "stage": 0, "path": "hybrid",     "text": "He teased me with a quick kiss, his taste of smoke lingering. I hated it, and yet I didn’t wipe it away." },

  { "stage": 1, "path": "love",       "text": "Our lips brushed longer this time. I felt his warmth even through the grime." },
  { "stage": 1, "path": "corruption", "text": "He forced his lips onto mine, rough and demanding. I gasped, but my body leaned in anyway." },
  { "stage": 1, "path": "hybrid",     "text": "He kissed me dirty, I kissed him back gently. Sweetness tangled with his stench." },

  { "stage": 2, "path": "love",       "text": "He kissed me under lantern light, tender but shy. My heart ached for more." },
  { "stage": 2, "path": "corruption", "text": "He pressed his filthy lips on mine and shoved his tongue past my teeth. I whimpered, hating how good it felt." },
  { "stage": 2, "path": "hybrid",     "text": "He kissed me with filth and I kissed him with care. Somehow it felt whole." },

  { "stage": 3, "path": "love",       "text": "His lips lingered against mine like a vow. I held him there, wanting it never to end." },
  { "stage": 3, "path": "corruption", "text": "He sucked on my bottom lip until it hurt, spit slicking my chin. I moaned instead of pushing him away." },
  { "stage": 3, "path": "hybrid",     "text": "We traded bites and kisses. Shame and thrill knotted together on our tongues." },

  { "stage": 4, "path": "love",       "text": "He kissed me like I was precious. For once, I forgot the dirt." },
  { "stage": 4, "path": "corruption", "text": "He claimed my mouth like it belonged to him. My body shuddered as his tongue explored every corner." },
  { "stage": 4, "path": "hybrid",     "text": "I kissed him back, grime and all, as though filth and tenderness could coexist." },

  { "stage": 5, "path": "love",       "text": "We melted into each other, lips pressing, sighs shared. It felt like love written in touch." },
  { "stage": 5, "path": "corruption", "text": "He pinned me, mouth crushing mine, his spit marking me as his. I moaned into his tongue." },
  { "stage": 5, "path": "hybrid",     "text": "His filthy lips, my gentle kisses—we made it our own rhythm, both sweet and wrong." },

  { "stage": 6, "path": "love",       "text": "He kissed me slow, lips mapping devotion across my face." },
  { "stage": 6, "path": "corruption", "text": "He tongued me deep until drool spilled. I didn’t care who saw me panting like that." },
  { "stage": 6, "path": "hybrid",     "text": "I kissed him softly, he kissed me filthy. It blended into something I couldn’t name but craved." },

  { "stage": 7, "path": "love",       "text": "He kissed me like prayer, each touch worshipful. I felt holy in his arms." },
  { "stage": 7, "path": "corruption", "text": "He shoved his tongue deep, spit dripping down my chin. I moaned like a whore and begged for more." },
  { "stage": 7, "path": "hybrid",     "text": "He bit and licked my lips. Pain and pleasure blurred—I didn’t want him to stop." },

  { "stage": 8, "path": "love",       "text": "We kissed beneath the stars, soft and endless. His lips felt like forever." },
  { "stage": 8, "path": "corruption", "text": "He kissed me until my mouth was raw, tongue forcing deeper, spit and moans echoing in the night." },
  { "stage": 8, "path": "hybrid",     "text": "We tangled tongues in messy lust, filth and affection dripping together." },

  { "stage": 9, "path": "love",       "text": "Every kiss was a vow—I wanted his lips for every day to come." },
  { "stage": 9, "path": "corruption", "text": "His dirty mouth owned mine, rough, sloppy, making me whimper as spit leaked between us." },
  { "stage": 9, "path": "hybrid",     "text": "I kissed him back harder, craving both the filth and the tenderness. It was ours." },

  { "stage": 10, "path": "love",       "text": "We devoured each other with lips and tongues, hearts pounding—love expressed in ruinous bliss." },
  { "stage": 10, "path": "corruption", "text": "He forced his tongue down my throat until I gagged, spit dripping everywhere. I moaned louder, addicted to his filth." },
  { "stage": 10, "path": "hybrid",     "text": "We kissed until we were drenched, spit and lust smeared across our mouths. It was dirty, it was tender, it was everything." }
],
"erotic_nipples": [
  { "stage": 0, "path": "love",       "text": "He brushed against me by accident, his arm grazing my chest. I blushed and quickly turned away." },
  { "stage": 0, "path": "corruption", "text": "His rough hand lingered too long near my chest. I slapped it away, but his smirk stayed with me." },
  { "stage": 0, "path": "hybrid",     "text": "He teased me playfully, tugging my scarf low enough to make me flustered, yet I didn’t stop him." },

  { "stage": 1, "path": "love",       "text": "He brushed a finger along my collarbone, pausing as if unsure. My heart raced faster than my breath." },
  { "stage": 1, "path": "corruption", "text": "He pinched lightly through my clothes, making me squeak. I should’ve scolded him harder." },
  { "stage": 1, "path": "hybrid",     "text": "He grazed my chest with rough fingers, my body stiffened but my lips betrayed me with a smile." },

  { "stage": 2, "path": "love",       "text": "He pressed closer, his chest brushing mine. A shiver shot through me though I said nothing." },
  { "stage": 2, "path": "corruption", "text": "His thumb circled over the thin fabric—taunting, daring me to react. I felt my resolve weaken." },
  { "stage": 2, "path": "hybrid",     "text": "He teased roughly, then soothed with a soft touch. It made me crave both at once." },

  { "stage": 3, "path": "love",       "text": "His lips pressed softly against me, tender and unsure. I bit my lip, torn between innocence and desire." },
  { "stage": 3, "path": "corruption", "text": "He tugged my top down and latched on greedily. I gasped—ashamed, aroused, trembling." },
  { "stage": 3, "path": "hybrid",     "text": "He teased and then sucked hard, leaving marks. I laughed, then moaned, unsure which I wanted more." },

  { "stage": 4, "path": "love",       "text": "He kissed gently, like he wanted to worship me. My whole body melted into his warmth." },
  { "stage": 4, "path": "corruption", "text": "He bit down hard enough to sting. My cry twisted into a moan as he pulled away smirking." },
  { "stage": 4, "path": "hybrid",     "text": "His mouth was rough, then soft again, like punishment and reward mixed together." },

  { "stage": 5, "path": "love",       "text": "He nursed at me with such care I felt like I was glowing, like he was drinking my affection itself." },
  { "stage": 5, "path": "corruption", "text": "He twisted and pulled shamelessly, groaning as if owning me. The pain made me wetter." },
  { "stage": 5, "path": "hybrid",     "text": "He played with me until I moaned, half from hurt, half from joy. I couldn’t tell which I wanted more." },

  { "stage": 6, "path": "love",       "text": "He pressed his lips in worship, whispering that I was beautiful. I wanted him to never stop." },
  { "stage": 6, "path": "corruption", "text": "He tugged my nipples hard while I whimpered, calling me his toy. My shame only made me hotter." },
  { "stage": 6, "path": "hybrid",     "text": "He licked and bit, coaxing me between bliss and pain, until I gave up resisting entirely." },

  { "stage": 7, "path": "love",       "text": "He sucked and kissed me lovingly, pausing only to gaze at me with eyes that said 'mine'." },
  { "stage": 7, "path": "corruption", "text": "He smacked and tugged until my body shook. My cries turned into begging before I even knew it." },
  { "stage": 7, "path": "hybrid",     "text": "He punished me with his mouth, then soothed me with his tongue, forcing me to crave the cycle." },

  { "stage": 8, "path": "love",       "text": "He lavished me with long kisses and suckles, coaxing moans that felt shameless but sacred." },
  { "stage": 8, "path": "corruption", "text": "He pulled my nipples until I squirted. My mind screamed no, but my body betrayed me completely." },
  { "stage": 8, "path": "hybrid",     "text": "He left me raw, swollen, and desperate—then kissed me sweetly as if it were all love." },

  { "stage": 9, "path": "love",       "text": "He nuzzled me with such devotion it felt like worship. I arched into him, gasping for more." },
  { "stage": 9, "path": "corruption", "text": "He growled as he mauled my chest, spitting filth and calling me his slut. I screamed yes." },
  { "stage": 9, "path": "hybrid",     "text": "He growled filth into my ear while licking me soft. I trembled in lust and love alike." },

  { "stage": 10, "path": "love",       "text": "He took his time, suckling until I sobbed from the intensity, whispering I was his forever." },
  { "stage": 10, "path": "corruption", "text": "He latched on like an animal, twisting, sucking, drooling, until milk or not, I felt utterly bred." },
  { "stage": 10, "path": "hybrid",     "text": "He abused me, then kissed me tender, my nipples red and wet, my heart torn between shame and bliss." }
],
"erotic_ass": [
  { "stage": 0, "path": "love",       "text": "He brushed my hip lightly, an accident maybe, but it left me flustered." },
  { "stage": 0, "path": "corruption", "text": "He slapped my rear suddenly. I yelped, but his grin made me blush despite myself." },
  { "stage": 0, "path": "hybrid",     "text": "He leaned close, whispering something crude while letting his hand rest too low. I didn’t pull away." },

  { "stage": 1, "path": "love",       "text": "He rested a gentle hand at the small of my back, guiding me closer. I didn’t mind the touch." },
  { "stage": 1, "path": "corruption", "text": "He squeezed my ass through my skirt. I gasped in shock, but my body tingled traitorously." },
  { "stage": 1, "path": "hybrid",     "text": "He teased me with soft pats that quickly turned into firm squeezes. I pretended to protest." },

  { "stage": 2, "path": "love",       "text": "He held me from behind, his hand brushing lower than it should. I pressed into him anyway." },
  { "stage": 2, "path": "corruption", "text": "He grabbed me shamelessly, fingers digging in, making me squeal. His roughness thrilled me." },
  { "stage": 2, "path": "hybrid",     "text": "He cupped and squeezed, sometimes gentle, sometimes brutal, leaving me breathless either way." },

  { "stage": 3, "path": "love",       "text": "He kissed my lower back while his hands lingered on my hips. I trembled but leaned closer." },
  { "stage": 3, "path": "corruption", "text": "He spread my cheeks roughly, smirking at how exposed I was. My shame only made me hotter." },
  { "stage": 3, "path": "hybrid",     "text": "He alternated between soft kisses and hard squeezes, confusing me with pleasure and humiliation." },

  { "stage": 4, "path": "love",       "text": "He nuzzled against me, his hands roaming, but there was tenderness in every squeeze." },
  { "stage": 4, "path": "corruption", "text": "He bit my ass hard enough to leave marks, laughing when I gasped and whimpered." },
  { "stage": 4, "path": "hybrid",     "text": "He kissed softly, then spanked me hard. The mix left me shivering in lust and confusion." },

  { "stage": 5, "path": "love",       "text": "He traced soft circles over me, his lips brushing where his hands had lingered. I melted." },
  { "stage": 5, "path": "corruption", "text": "He smacked me over and over until I moaned instead of protesting. My body betrayed me." },
  { "stage": 5, "path": "hybrid",     "text": "He groped and spanked, then soothed the sting with kisses. I craved both." },

  { "stage": 6, "path": "love",       "text": "He held me close, his palms warm and reassuring on my curves, whispering that I was beautiful." },
  { "stage": 6, "path": "corruption", "text": "He forced my hips back against him, growling as he claimed me with every squeeze." },
  { "stage": 6, "path": "hybrid",     "text": "He spanked, then stroked, turning my cries into moans. Shame and bliss mingled inside me." },

  { "stage": 7, "path": "love",       "text": "He pressed tender kisses across my skin, holding me steady as my knees weakened." },
  { "stage": 7, "path": "corruption", "text": "He spread me open roughly and spat crude words, groaning as I shivered under his control." },
  { "stage": 7, "path": "hybrid",     "text": "He smacked me raw, then soothed me with soft lips. My body begged for both extremes." },

  { "stage": 8, "path": "love",       "text": "He kissed every inch of me, tender and reverent, leaving me feeling cherished despite my shame." },
  { "stage": 8, "path": "corruption", "text": "He rammed into me from behind, each thrust slapping flesh to flesh. I squealed in ecstasy, juices running down my thighs." },
  { "stage": 8, "path": "hybrid",     "text": "He spanked me until I burned, then slid inside with rough passion. I screamed and clung to him." },

  { "stage": 9, "path": "love",       "text": "He kissed my spine while filling me, whispering devotion into my skin. I cried with bliss." },
  { "stage": 9, "path": "corruption", "text": "He mauled my ass, pounding like an animal while calling me his breeding hole. My body squirted without control." },
  { "stage": 9, "path": "hybrid",     "text": "He filled me roughly, then soothed me with tender kisses. My body worshipped both pain and love." },

  { "stage": 10, "path": "love",       "text": "He worshipped my ass with lips, hands, and devotion, making me climax again and again." },
  { "stage": 10, "path": "corruption", "text": "He pinned me down, spreading me wide, thrusting until I screamed his name. His seed spilled deep, marking me forever." },
  { "stage": 10, "path": "hybrid",     "text": "He used me with filthy words and brutal thrusts, then kissed me tenderly as my juices dripped down my legs. I belonged to him completely." }
],
"erotic_caress": [
  { "stage": 0, "path": "love",       "text": "His hand brushed mine, lingering longer than it should. My cheeks burned, but I didn’t pull away." },
  { "stage": 0, "path": "corruption", "text": "He stroked my thigh casually, like he already owned me. I froze, my body betraying me with a shiver." },
  { "stage": 0, "path": "hybrid",     "text": "His fingers hovered over my arm, never quite touching, but the anticipation left me trembling." },

  { "stage": 1, "path": "love",       "text": "His palm rested against my cheek, rough but gentle. I leaned into it despite the dirt." },
  { "stage": 1, "path": "corruption", "text": "He let his hand wander lower, stroking where no one else dared. My gasp made him smirk." },
  { "stage": 1, "path": "hybrid",     "text": "He caressed me with one hand and squeezed me with the other, tender and crude all at once." },

  { "stage": 2, "path": "love",       "text": "His thumb traced my lips as though memorizing them. My heart stuttered under his gaze." },
  { "stage": 2, "path": "corruption", "text": "He dragged his fingers across my chest brazenly, leaving heat and shame in their wake." },
  { "stage": 2, "path": "hybrid",     "text": "He stroked my cheek and slid lower, alternating between tenderness and possession." },

  { "stage": 3, "path": "love",       "text": "He cradled me against him, his touch grounding me. For a moment I forgot the world outside." },
  { "stage": 3, "path": "corruption", "text": "His hand slid boldly under my clothes, fingertips grazing skin I swore I’d never reveal." },
  { "stage": 3, "path": "hybrid",     "text": "He stroked me like a lover, then grabbed like a thief. My body responded to both." },

  { "stage": 4, "path": "love",       "text": "He traced soft patterns on my arm and back, soothing me as though I was something precious." },
  { "stage": 4, "path": "corruption", "text": "He squeezed my breasts roughly, laughing when I moaned. Shame and heat fused inside me." },
  { "stage": 4, "path": "hybrid",     "text": "He switched between soft caresses and vulgar gropes, confusing me with pleasure and humiliation." },

  { "stage": 5, "path": "love",       "text": "He stroked my hair, kissed my temples, held me like I was fragile. I melted in his arms." },
  { "stage": 5, "path": "corruption", "text": "He gripped me from behind, hands exploring everywhere, ignoring my weak protests." },
  { "stage": 5, "path": "hybrid",     "text": "He pressed me against him, stroking gently one moment, groping hard the next. I craved both." },

  { "stage": 6, "path": "love",       "text": "He stroked every inch of me with patience, murmuring that he wanted to know my body fully." },
  { "stage": 6, "path": "corruption", "text": "His fingers slid between my folds without warning, slicking themselves shamelessly with my wetness." },
  { "stage": 6, "path": "hybrid",     "text": "He caressed me until I sighed, then thrust his fingers roughly inside. I moaned through the mix of care and cruelty." },

  { "stage": 7, "path": "love",       "text": "He mapped me with slow kisses and strokes, each caress worshipping me like I was holy." },
  { "stage": 7, "path": "corruption", "text": "He clawed and squeezed until bruises formed, groaning as I whimpered beneath his grip." },
  { "stage": 7, "path": "hybrid",     "text": "He alternated between worshipping my skin and using me like a toy. Both left me wet and trembling." },

  { "stage": 8, "path": "love",       "text": "His caresses turned desperate, like he couldn’t get enough of touching me, whispering my name with every stroke." },
  { "stage": 8, "path": "corruption", "text": "He mauled my body, pinching, slapping, and groping until I squealed, juices dripping freely." },
  { "stage": 8, "path": "hybrid",     "text": "He rubbed me raw with one hand, soothed me with the other, forcing me to climax from both pain and pleasure." },

  { "stage": 9, "path": "love",       "text": "He stroked me with a reverence that broke me open, making me cry out his name through waves of bliss." },
  { "stage": 9, "path": "corruption", "text": "He spread me open roughly, fingers plunging in and out, groaning at the mess he made of me." },
  { "stage": 9, "path": "hybrid",     "text": "He alternated between tender caresses and brutal grabs, leaving my body quaking with release." },

  { "stage": 10, "path": "love",       "text": "His caresses became worship, mapping my entire body with love, every orgasm a prayer answered." },
  { "stage": 10, "path": "corruption", "text": "He ravaged me with his hands, fingering, slapping, squeezing until I screamed, squirting uncontrollably." },
  { "stage": 10, "path": "hybrid",     "text": "He treated me like both goddess and toy, caressing with devotion one second and ravaging with filth the next. I belonged to it all." }
],
"erotic_breasts": [
  { "stage": 0, "path": "love",       "text": "His gaze lingered on my chest too long. I crossed my arms, blushing, pretending not to notice." },
  { "stage": 0, "path": "corruption", "text": "He brushed against my chest as if by accident, smirking when I stiffened." },
  { "stage": 0, "path": "hybrid",     "text": "He stared openly, bold and shameless. I should’ve slapped him, but my lips curved instead." },

  { "stage": 1, "path": "love",       "text": "His hand rested lightly against my collarbone, warm and protective rather than possessive." },
  { "stage": 1, "path": "corruption", "text": "His palm cupped me through the fabric, rough and deliberate. I gasped but didn’t stop him." },
  { "stage": 1, "path": "hybrid",     "text": "He brushed over me slowly, then squeezed hard. My heart raced at the mix of comfort and control." },

  { "stage": 2, "path": "love",       "text": "His thumb traced the edge of my neckline, tender as though he feared to break me." },
  { "stage": 2, "path": "corruption", "text": "He tugged my top down carelessly, squeezing my breasts bare-handed. My cheeks burned, but I moaned." },
  { "stage": 2, "path": "hybrid",     "text": "He fondled me gently with one hand, pinched hard with the other. My body responded to both." },

  { "stage": 3, "path": "love",       "text": "His lips pressed to my chest reverently, a worship I wasn’t ready to admit I craved." },
  { "stage": 3, "path": "corruption", "text": "He bit down on my nipple through the cloth, sharp enough to make me squeal. His laugh was cruel." },
  { "stage": 3, "path": "hybrid",     "text": "He licked tender circles before biting hard enough to leave marks. I hated how wet it made me." },

  { "stage": 4, "path": "love",       "text": "He undressed me carefully, kissing each breast as if they deserved devotion." },
  { "stage": 4, "path": "corruption", "text": "He mauled my breasts roughly, slapping them together, laughing at my shameless moans." },
  { "stage": 4, "path": "hybrid",     "text": "He alternated between tender worship and lewd groping, breaking me down with contradictions." },

  { "stage": 5, "path": "love",       "text": "He nursed on me like a starving man, but every suck was filled with warmth, not greed." },
  { "stage": 5, "path": "corruption", "text": "He twisted my nipples brutally, pulling until I whimpered. My shame was dripping between my thighs." },
  { "stage": 5, "path": "hybrid",     "text": "He groped me shamelessly in public, then kissed them softly in private. I loved both." },

  { "stage": 6, "path": "love",       "text": "He pressed his face between my breasts, whispering that they were his sanctuary." },
  { "stage": 6, "path": "corruption", "text": "He spat on my chest, rubbing it into my nipples with greedy fingers as I moaned helplessly." },
  { "stage": 6, "path": "hybrid",     "text": "He toyed with my nipples roughly, then soothed them with tender licks. Pleasure blurred with humiliation." },

  { "stage": 7, "path": "love",       "text": "He massaged them slowly, lips sucking until I melted into his arms." },
  { "stage": 7, "path": "corruption", "text": "He used my breasts like toys, squeezing until bruises formed, moaning as I cried out in bliss." },
  { "stage": 7, "path": "hybrid",     "text": "He bit, sucked, and kissed until I was dripping, begging for more of his cruelty and care." },

  { "stage": 8, "path": "love",       "text": "He whispered that my breasts were perfect, worshipping them with lips and tongue until I lost myself." },
  { "stage": 8, "path": "corruption", "text": "He slapped my tits until they bounced, then sucked them greedily, drool and milk mixing down my skin." },
  { "stage": 8, "path": "hybrid",     "text": "He forced my tits together for his cock, groaning as he slid between them before kissing them tenderly after." },

  { "stage": 9, "path": "love",       "text": "He made love to my breasts as if they were sacred, every lick reverent, every squeeze tender." },
  { "stage": 9, "path": "corruption", "text": "He fucked my breasts brutally, coating me in filth, laughing when I begged for more." },
  { "stage": 9, "path": "hybrid",     "text": "He fucked my tits with shameless lust, then pulled me close and whispered, 'I love you.'" },

  { "stage": 10, "path": "love",       "text": "He kissed every inch of my chest like I was holy, worshipping me through climax." },
  { "stage": 10, "path": "corruption", "text": "He mauled my tits like a beast, drool, spit, and cum soaking me. I screamed as milk sprayed, surrendering completely." },
  { "stage": 10, "path": "hybrid",     "text": "He fucked my tits until I squirted down my thighs, then kissed my chest sweetly, making me his filthy goddess." }
],
"erotic_talking": [
  { "stage": 0, "path": "love",       "text": "I told him gently to stop teasing me. My voice trembled, but part of me wished he’d keep going." },
  { "stage": 0, "path": "corruption", "text": "He whispered filth in my ear, words I shouldn’t even know. I gasped, cheeks red, but listened all the same." },
  { "stage": 0, "path": "hybrid",     "text": "He teased me about being 'too pure for the slums.' I snapped back, pretending not to enjoy the way it made me blush." },

  { "stage": 1, "path": "love",       "text": "He called me 'beautiful.' I whispered back 'thank you,' barely above a breath." },
  { "stage": 1, "path": "corruption", "text": "He called me his 'little slut' under his breath. I should’ve slapped him, but my thighs pressed together." },
  { "stage": 1, "path": "hybrid",     "text": "He whispered something crude, then softened with 'but you’re mine.' My chest tightened at both." },

  { "stage": 2, "path": "love",       "text": "I whispered that I liked being near him. He grinned, and I blushed deeper." },
  { "stage": 2, "path": "corruption", "text": "He told me I was dripping for him, filthy and shameless. I denied it, though my body betrayed me." },
  { "stage": 2, "path": "hybrid",     "text": "He called me 'naughty' and kissed me tenderly after. I couldn’t decide what flustered me more." },

  { "stage": 3, "path": "love",       "text": "I told him he made me feel safe. His reply was a kiss against my hairline." },
  { "stage": 3, "path": "corruption", "text": "He forced me to say his name while he touched me. I moaned it louder than I intended." },
  { "stage": 3, "path": "hybrid",     "text": "I whispered 'don’t stop,' even as my face burned. He smirked, then kissed me deeper." },

  { "stage": 4, "path": "love",       "text": "I murmured 'I want this,' surprising even myself. He smiled, softer than usual." },
  { "stage": 4, "path": "corruption", "text": "He made me repeat, 'I’m yours to use.' The words made me shudder in shame and desire." },
  { "stage": 4, "path": "hybrid",     "text": "I gasped 'you’re ruining me,' only to feel him kiss my lips tenderly right after. Both ruined and cherished." },

  { "stage": 5, "path": "love",       "text": "I told him I loved him. He froze for a heartbeat, then kissed me fiercely." },
  { "stage": 5, "path": "corruption", "text": "He called me his 'fucktoy.' I repeated it back, blushing furiously as my hips bucked against him." },
  { "stage": 5, "path": "hybrid",     "text": "I confessed 'I love the way you use me,' before burying my face in his chest. His laugh was cruel, his touch tender." },

  { "stage": 6, "path": "love",       "text": "I whispered 'I want to stay with you forever,' my voice breaking with sincerity." },
  { "stage": 6, "path": "corruption", "text": "He made me beg for his cock, every filthy word spilling from my lips without shame." },
  { "stage": 6, "path": "hybrid",     "text": "I told him 'I want it rough… but only from you.' His smirk sent chills down me." },

  { "stage": 7, "path": "love",       "text": "I cried out his name like a prayer, every syllable filled with devotion." },
  { "stage": 7, "path": "corruption", "text": "He ordered me to say I was his whore, and I screamed it, wet and wild, as if I believed it." },
  { "stage": 7, "path": "hybrid",     "text": "I moaned 'you own me,' then seconds later whispered, 'I love you.' Both truths tangled together." },

  { "stage": 8, "path": "love",       "text": "I begged him to never let me go, confessing my body was only alive when he touched me." },
  { "stage": 8, "path": "corruption", "text": "I screamed obscenities at the height of climax, calling myself his breeding bitch, his slut, his hole." },
  { "stage": 8, "path": "hybrid",     "text": "I whispered 'fuck me, love me, ruin me,' all at once. His response was both tender and brutal." },

  { "stage": 9, "path": "love",       "text": "I whispered into his ear, 'I want your child.' My voice was filled with desperate devotion." },
  { "stage": 9, "path": "corruption", "text": "I begged, 'Breed me. Fill me. Make me yours forever,' drool slipping from my lips as I choked out the words." },
  { "stage": 9, "path": "hybrid",     "text": "I moaned 'Make me your wife, your slut, your everything,' as his thrusts stole my breath." },

  { "stage": 10, "path": "love",       "text": "I cried out, 'I love you, I love you,' with every shuddering climax, shameless and true." },
  { "stage": 10, "path": "corruption", "text": "I screamed, 'Fuck my pussy, ruin my body, make me your cumdump!' The words made me gush harder than ever before." },
  { "stage": 10, "path": "hybrid",     "text": "I moaned 'I love being your slut,' before gasping 'I love you' in the same breath. His cock silenced me with truth." }
],
"erotic_mouth": [
  { "stage": 0, "path": "love",       "text": "He kissed my cheek so suddenly. I laughed nervously, but part of me wished he hadn’t stopped there." },
  { "stage": 0, "path": "corruption", "text": "He pressed his lips against mine, unwashed and rough. I recoiled, but the heat lingered against my mouth." },
  { "stage": 0, "path": "hybrid",     "text": "His lips brushed mine. I gasped and pulled away, but my fingers stayed on his sleeve." },

  { "stage": 1, "path": "love",       "text": "He kissed me softly, almost like he was afraid I’d break. My heart fluttered too much to pull back." },
  { "stage": 1, "path": "corruption", "text": "His tongue forced into my mouth, tasting of ash and dirt. I gagged… but then melted against him." },
  { "stage": 1, "path": "hybrid",     "text": "He kissed me hard, then gentle. I couldn’t decide which part made me ache more." },

  { "stage": 2, "path": "love",       "text": "Our mouths met again and again, and I realized I didn’t want to count anymore." },
  { "stage": 2, "path": "corruption", "text": "He shoved his tongue between my lips, claiming me. I moaned shamefully into his mouth." },
  { "stage": 2, "path": "hybrid",     "text": "He bit my lower lip, then soothed it with a soft kiss. I trembled, craving both." },

  { "stage": 3, "path": "love",       "text": "I leaned into his kiss, hands trembling on his chest, savoring the warmth even through the grime." },
  { "stage": 3, "path": "corruption", "text": "He made me open my mouth wide for him, tongue exploring as if he owned it. My knees buckled." },
  { "stage": 3, "path": "hybrid",     "text": "He kissed me like he wanted to devour me, then whispered 'mine.' I whispered 'yours' back." },

  { "stage": 4, "path": "love",       "text": "We kissed until the world blurred. I forgot the filth, the danger—there was only us." },
  { "stage": 4, "path": "corruption", "text": "His spit filled my mouth as our tongues tangled. I swallowed, shamefully eager for more." },
  { "stage": 4, "path": "hybrid",     "text": "We kissed until I was dizzy, his roughness bruising my lips, his tenderness undoing me." },

  { "stage": 5, "path": "love",       "text": "He kissed me with such need that I nearly wept. My lips ached, my heart did too." },
  { "stage": 5, "path": "corruption", "text": "He shoved his fingers in my mouth, making me suck them. I moaned around the taste of salt and dirt." },
  { "stage": 5, "path": "hybrid",     "text": "I begged him to kiss me deeper, filth and all, and he obeyed with a smirk." },

  { "stage": 6, "path": "love",       "text": "He kissed me awake this morning. My lips still tingled all day." },
  { "stage": 6, "path": "corruption", "text": "He spat in my mouth mid-kiss. I gagged… and then begged for another." },
  { "stage": 6, "path": "hybrid",     "text": "He kissed me until I was gasping, drool stringing between us. I didn’t care how filthy it looked." },

  { "stage": 7, "path": "love",       "text": "We kissed under the stars until I forgot who I was without him." },
  { "stage": 7, "path": "corruption", "text": "He forced my head back and tongue-fucked me until I moaned like a slut. I wanted more." },
  { "stage": 7, "path": "hybrid",     "text": "He kissed me hard, spit dripping between our mouths, and I whispered 'I love you' through the mess." },

  { "stage": 8, "path": "love",       "text": "Our kisses turned frantic, desperate, like we couldn’t survive without the other’s lips." },
  { "stage": 8, "path": "corruption", "text": "He used my mouth like a hole, forcing his spit, his tongue, his taste until I was drooling and moaning shamelessly." },
  { "stage": 8, "path": "hybrid",     "text": "I begged him to ruin my mouth with kisses and filth, but also to hold me after. He did both." },

  { "stage": 9, "path": "love",       "text": "I whispered 'kiss me forever.' He did, until I could barely breathe." },
  { "stage": 9, "path": "corruption", "text": "He shoved his cock against my lips, growling until I opened. His taste and smell filled me, and I moaned around it." },
  { "stage": 9, "path": "hybrid",     "text": "He fucked my mouth with his tongue, then kissed me tender after. Both ruined me, both thrilled me." },

  { "stage": 10, "path": "love",       "text": "I kissed him like a prayer, begging for more, my lips swollen and wet with devotion." },
  { "stage": 10, "path": "corruption", "text": "I screamed for more spit, more tongue, more filth. My mouth was his hole, and I loved it." },
  { "stage": 10, "path": "hybrid",     "text": "I moaned 'fuck my mouth, love my lips,' drool dripping down my chin as I clung to him." }
],
"erotic_vaginal": [
  { "stage": 0, "path": "love",       "text": "He pressed against me, and I froze. I whispered 'not yet' and he actually listened." },
  { "stage": 0, "path": "corruption", "text": "His hand pushed between my thighs. I clenched them shut, breath shaking. He only grinned." },
  { "stage": 0, "path": "hybrid",     "text": "I felt him press close, dirty and insistent. I turned away, but the ache lingered." },

  { "stage": 1, "path": "love",       "text": "He brushed against me through cloth. It made me blush and press my knees tighter together." },
  { "stage": 1, "path": "corruption", "text": "He forced my legs apart with his knee. I gasped and whimpered, but he didn’t stop." },
  { "stage": 1, "path": "hybrid",     "text": "He rubbed me through my skirt, rough and teasing. I moaned before I could stop myself." },

  { "stage": 2, "path": "love",       "text": "He slid just barely inside, careful, waiting for me to breathe yes. My heart pounded louder than my voice." },
  { "stage": 2, "path": "corruption", "text": "He shoved inside me without warning. It burned, it hurt—my cry only made him smile." },
  { "stage": 2, "path": "hybrid",     "text": "He entered me suddenly. I cursed and clutched him, torn between shame and pleasure." },

  { "stage": 3, "path": "love",       "text": "It hurt, but his touch soothed me, his kisses grounding me as he moved slow." },
  { "stage": 3, "path": "corruption", "text": "He rammed into me, using me rough. The sting blurred into a heat that made me moan despite myself." },
  { "stage": 3, "path": "hybrid",     "text": "He was merciless and then gentle, thrusting me open, then kissing my tears away. I let him do both." },

  { "stage": 4, "path": "love",       "text": "We moved together clumsily, learning each other’s rhythm. His gaze stayed locked on mine." },
  { "stage": 4, "path": "corruption", "text": "He pinned me down and pumped until my cries broke. My body betrayed me with wetness dripping down my thighs." },
  { "stage": 4, "path": "hybrid",     "text": "His cock split me wide, rough and sweet. I clung to him, torn between bliss and guilt." },

  { "stage": 5, "path": "love",       "text": "He groaned my name into my neck. Each thrust carried need but also care. I melted into it." },
  { "stage": 5, "path": "corruption", "text": "He slammed me raw, juices splattering. I squealed shamelessly, my body begging for more abuse." },
  { "stage": 5, "path": "hybrid",     "text": "I begged him to go harder, then cried when he did. My shame turned to hunger in the same breath." },

  { "stage": 6, "path": "love",       "text": "He stretched me slowly, whispering 'breathe, flower.' The gentleness made me cry softly." },
  { "stage": 6, "path": "corruption", "text": "He plugged me full, thrusting like an animal. My juices dripped, soaking the ground beneath us." },
  { "stage": 6, "path": "hybrid",     "text": "He alternated tenderness and filth, kissing me sweetly as his cock bruised my insides." },

  { "stage": 7, "path": "love",       "text": "He held me close, our hips rocking until I came with a broken moan against his shoulder." },
  { "stage": 7, "path": "corruption", "text": "He used my pussy like a hole, fucking me until I screamed. My legs quivered, juices pouring freely." },
  { "stage": 7, "path": "hybrid",     "text": "I clutched him as he thrust wild, loving the filth and the sweetness tangled together." },

  { "stage": 8, "path": "love",       "text": "We made love feverishly, desperate and messy. I cried his name as release shook me apart." },
  { "stage": 8, "path": "corruption", "text": "He jackhammered into me, cock slamming deep. My pussy gushed uncontrollably, soaking his filthy skin." },
  { "stage": 8, "path": "hybrid",     "text": "He filled me over and over, tender words mixed with filthy growls. I moaned shamelessly for both." },

  { "stage": 9, "path": "love",       "text": "He worshipped my body with every thrust, our cries blending into something sacred." },
  { "stage": 9, "path": "corruption", "text": "He fucked me raw until my pussy screamed. His cum flooded me, dripping endlessly down my thighs." },
  { "stage": 9, "path": "hybrid",     "text": "He took me like I was his slut and his bride both. I begged for his seed, for his love, for more filth." },

  { "stage": 10, "path": "love",       "text": "We became one, his cock filling me as I screamed his name. My heart swore it would never want another." },
  { "stage": 10, "path": "corruption", "text": "My breeding hole was his to own—he fucked me until my womb overflowed with his seed. I squealed, drooled, begged for more." },
  { "stage": 10, "path": "hybrid",     "text": "I begged him to ruin me, to fill me with love and filth both. My pussy gushed as I screamed for his cock, for his seed, for everything he is." }
]
},
"pregnancy_discovery": [
  { "key": "missed_cycle", "stageMin": 0, "path": "any", "text": "I was late this month. I told myself it was nothing, but the thought kept me awake all night." },
  { "key": "first_twinge", "stageMin": 1, "path": "love", "text": "I felt a strange flutter in my belly today. Could it be? My heart leapt and trembled all at once." },
  { "key": "first_twinge_corr", "stageMin": 1, "path": "corruption", "text": "My stomach twisted, not from food. A filthy thought hit me—did his seed take root already? The idea made me shiver in ways I shouldn’t admit." },
  { "key": "first_twinge_hyb", "stageMin": 1, "path": "hybrid", "text": "Something feels different inside me. I should be afraid, but instead I feel a secret thrill… as if his mark is growing." },

  { "key": "secret_test", "stageMin": 2, "path": "love", "text": "I picked up herbs to test quietly at home. When the leaves changed color, I almost dropped them. I wanted to laugh and cry together." },
  { "key": "secret_test_corr", "stageMin": 2, "path": "corruption", "text": "I checked with trembling hands. When the sign appeared, I didn’t scream. I… smiled. My body is his now, in the deepest way possible." },
  { "key": "secret_test_hyb", "stageMin": 2, "path": "hybrid", "text": "The moment the test showed the truth, my chest filled with both dread and heat. His life inside me—sinful and sacred at once." },

  { "key": "mirror_confession", "stageMin": 3, "path": "love", "text": "I stood in front of the mirror, whispering to my reflection: 'You’re carrying his child.' My hand trembled, then held steady." },
  { "key": "mirror_confession_corr", "stageMin": 3, "path": "corruption", "text": "I stared at my belly in the mirror, imagining it swelling with his child. A filthy grin spread across my lips before I could stop it." },
  { "key": "mirror_confession_hyb", "stageMin": 3, "path": "hybrid", "text": "I pressed my palm against my stomach. My heart whispered 'love,' my body whispered 'desire.' Both truths burned into me." }
]
