{
  "version": "1.0",
  "characterId": "aerith",
  "desires": {
    "vagrant": {
      "love": [
        "Stage 0 — I met him among the alleys; beneath the filth I sense a loneliness I can’t turn away from.",
        "Stage 1 — If he’d let me close, I’d show him he’s more than the dirt the world sees.",
        "Stage 2 — His rough smile is cracked, but when it’s for me I feel warm all the way through.",
        "Stage 3 — I want to be the person who coaxes gentleness out of him, even if my hands come away stained.",
        "Stage 4 — Love can hold contradictions: I can cherish him as he is and still wish to heal what hurts.",
        "Stage 5 — No matter what others smell or say, I choose him; I want a future woven from tenderness and grit."
      ],
      "corruption": [
        "Stage 0 — He is unwashed and shameless; the wrongness lingers on my skin… and it won’t leave my thoughts.",
        "Stage 1 — The weight of his presence clings like smoke; fear mixes with a heat I don’t understand.",
        "Stage 2 — When he leans close, the filth feels like a claim; my breath catches and I don’t pull away.",
        "Stage 3 — I want him to mark me so the world knows I’m his—terrible and thrilling in the same breath.",
        "Stage 4 — The more he tests my limits, the more I find new ones to surrender; I ache for the surrender itself.",
        "Stage 5 — Let me be his without pretense; stain me with him until even my doubts carry his scent."
      ],
      "hybrid": [
        "Stage 0 — He’s everything I should refuse, yet part of me leans closer just to see what happens.",
        "Stage 1 — Sin and softness together tempt me: his filth, my care; my blush, his smirk.",
        "Stage 2 — If loving him means touching what’s forbidden, then let my hands be honest and my heart be brave.",
        "Stage 3 — Shame turns to thrill when it’s ours; I want the secret and the sweetness in the same heartbeat.",
        "Stage 4 — This feels like choosing fire and rain at once; I want both the scorch and the bloom.",
        "Stage 5 — I accept the paradox: tender devotion wrapped in taboo—our own kind of pure."
      ]
    }
  },
  "witnessed": {
    "vagrant": {
      "tifa": [
        { "stage": 0, "path": "love",       "text": "Tifa’s nose wrinkled at his smell; still, her eyes lingered a second too long. I felt a pinch of something I won’t name." },
        { "stage": 1, "path": "corruption", "text": "He stood too close to Tifa; the air turned heavy. My pulse stuttered—disgust, envy, and a spark I shouldn’t feel." },
        { "stage": 2, "path": "hybrid",     "text": "She didn’t flinch this time. I hated that I noticed… and that part of me wished it was me instead." },
        { "stage": 3, "path": "love",       "text": "They spoke in low tones; his roughness softened. It hurt—and yet I smiled for both of them." },
        { "stage": 4, "path": "corruption", "text": "Her breath hitched when he leaned in. The alley felt too warm; jealousy braided with a darker want." },
        { "stage": 5, "path": "hybrid",     "text": "Filth and closeness and something tender—between them, and inside me. I’m frightened by how much I understand." }
      ],
      "renna": [
        { "stage": 0, "path": "love",       "text": "Renna laughed off his mockery, unbothered by the grime. I wish I could be so light." },
        { "stage": 1, "path": "corruption", "text": "She let him crowd her space—reckless, smiling. I felt heat rise in my cheeks for reasons I won’t write twice." },
        { "stage": 2, "path": "hybrid",     "text": "Her ease with him pricked me; I envied her boldness and feared where it leads." },
        { "stage": 3, "path": "love",       "text": "She teased him into a softer mood. I caught myself rooting for them—and then for myself." },
        { "stage": 4, "path": "corruption", "text": "He tested her with a daring touch; she didn’t pull away. My heart pounded in something like approval." },
        { "stage": 5, "path": "hybrid",     "text": "Watching them felt like watching a secret I already share: danger, laughter, and a choice to keep wanting." }
      ],
      "yuffie": [
        { "stage": 0, "path": "love",       "text": "Yuffie joked about his stink and made even him laugh. I laughed, too—traitorously." },
        { "stage": 1, "path": "corruption", "text": "She tossed him a grin that said: your dirt doesn’t scare me. The thrill in my chest startled me." },
        { "stage": 2, "path": "hybrid",     "text": "She turned grime into a game. I wondered what it would be like to play along." },
        { "stage": 3, "path": "love",       "text": "He softened around her mischief; I understood the charm—and felt my own grow sharper." },
        { "stage": 4, "path": "corruption", "text": "Her teasing let him be bolder. My breath quickened, jealous and fascinated in equal measure." },
        { "stage": 5, "path": "hybrid",     "text": "This triangle of jokes and heat felt inevitable; I wrote the truth: I want what she has, and what I have, too." }
      ]
    }
  },
  "events": {
    "intro": [
      { "key": "first_meeting",      "stageMin": 0, "path": "any", "text": "I met him in the slums—rags, smoke, and eyes that dared me to care. I did." },
      { "key": "first_conversation", "stageMin": 0, "path": "any", "text": "He called me too clean for these alleys. I stayed anyway; something in me wanted to prove him wrong." }
    ],
    "intimacy": [
      { "key": "first_touch", "stageMin": 1, "path": "any", "text": "His fingers grazed mine—rough and unwashed—and my skin lit like a match." },
      { "key": "first_kiss",  "stageMin": 2, "path": "any", "text": "He tasted of ash and sweat; it should have repelled me. I leaned in instead." },
      { "key": "quiet_hold",  "stageMin": 3, "path": "love", "text": "We said nothing. His weight, his warmth, the grime—somehow it felt like safety." },
      { "key": "claimed_whisper", "stageMin": 4, "path": "corruption", "text": "He murmured at my ear that I’m his. The word sank deep; I didn’t fight it." }
    ],
"erotic": [
  { "key": "ass_grab", "stageMin": 0, "path": "any", "text": "His huge hands squeezed my behind, a small yelp left my lips. I was quick to scold him. I hope that never happens again." },

  { "key": "nipple_tease", "stageMin": 1, "path": "any", "text": "I felt his fingers run down my chest and linger where I'm most sensitive. I promised myself I won't let it happen again." },

  { "key": "bath_play", "stageMin": 2, "path": "love", "text": "He convinced me to help him wash the other day. He just seems so helpless, how could I refuse. While bathing, I couldn't help but notice how big he was... S-s-stop thinking about it Aerith." },

 { "key": "first_tent_oral", "stageMin": 2, "path": "corruption", "text": "I-I-I couldn't hold back my curiosity, he slowly unzipped and unleashed his monster. Stench dripping off it ... I felt my thighs heat up. The smell was so intoxicating, my lips quivered but were soon engulfed in his stench" },

  { "key": "first_time_corruption", "stageMin": 3, "path": "corruption", "text": "One minute he was whispering in my ear. The next... I lost control. He finally made me his. I can still feel his filth all over me, marking me as his." },

  { "key": "first_time_love", "stageMin": 3, "path": "love", "text": "The night was soft, and even with his rough edges, he touched me like I mattered. It hurt, but I wanted him close. I wanted all of him." },

  { "key": "first_time_hybrid", "stageMin": 3, "path": "hybrid", "text": "I told myself I hated how dirty he was, but when he pressed me down and kissed me with that smirk, I melted. Shame and thrill mixed, and I gave in." },

   { "key": "first_tongue_kissing", "stageMin": 3, "path": "corruption", "text": "He leaned in for a kiss and before I knew it our tongues were dancing together. I just can't get enough of this taste" },

  { "key": "morning_aftermath", "stageMin": 4, "path": "any", "text": "I woke sore and flushed, his smell still clinging to me. I should have bathed immediately, but part of me wanted to keep it—like proof of last night." },

  { "key": "rough_claim", "stageMin": 4, "path": "corruption", "text": "He pushed me hard against the wall, and I didn’t resist. The sting, the filth—it made me tremble in ways I never imagined I’d crave." },

  { "key": "tender_bed", "stageMin": 4, "path": "love", "text": "He lay beside me, unwashed and raw, yet he touched me so gently. I buried my face in his chest, choosing to see past the dirt to the man inside." },

   { "key": "tent_caught",     "stageMin": 3, "path": "love", "text": "I--I-I was lost in the moment with him. Every inch slid deeper but then Cloud started calling for me. As he peeked into the tent I've never felt so ashamed. We covered up in time, Vagrant still teased me from behind. I made up some excuse but Cloud definitely suspects something..." },

  { "key": "stained_flower", "stageMin": 4, "path": "corruption", "text": "He'd always use protection... Up until now. He kept teasing me, pushing my limits. I finally caved in and accepted." },

  { "key": "dirtied_inside", "stageMin": 4, "path": "corruption", "text": "I shouldn't want it, but I kept clinging to him. I locked my legs around him preventing any escape. Feeling his filthy seed inside me. I've never felt more conflicted." },

  { "key": "tainted_blossom", "stageMin": 5, "path": "corruption", "text": "Every inch of me feels claimed. I can’t wash away his touch anymore—his dirt lives inside me now, and shamefully, I don’t want to." },

  { "key": "forbidden_bond", "stageMin": 5, "path": "hybrid", "text": "We kissed with filth still on our skin. It should feel wrong, but instead it felt sacred. Like a secret only we’re allowed to share." },

  { "key": "pregnant_touch", "stageMin": 5, "path": "any", "text": "His hand lingered on my belly today, possessive and heavy. Whether love or corruption, I know now—my body belongs to him." }
],
    "exploration": [
      { "key": "slum_walk",     "stageMin": 0, "path": "any", "text": "We walked alleys that smelled of rust and rain. He mocked the world; I laughed despite myself." },
      { "key": "church_visit",  "stageMin": 1, "path": "any", "text": "He stepped into the church with mud on his boots. I should’ve scolded him. I asked him to stay." },
      { "key": "night_market",  "stageMin": 2, "path": "any", "text": "Lanterns flickered on his cheekbones; the dirt didn’t look so ugly in the warm light." }
      { "key": "slum_walk_marked",     "stageMin": 5, "path": "corruption", "text": "We walked the dark alleys together. His hands clinging to my body in front of everyone. Everyone looks disgusted, but it makes me even more excited." },  
    ],
    "haunted_mansion": [
      { "key": "threshold",   "stageMin": 2, "path": "any", "text": "At the mansion doors, the air went cold. I took his arm and told myself it was the wind." },
      { "key": "whispers",    "stageMin": 3, "path": "any", "text": "Floorboards sighed; I held his sleeve. He smirked at my grip—and I didn’t let go." },
      { "key": "shadow_nook", "stageMin": 4, "path": "hybrid", "text": "Hidden in a shadowed room, I pressed close, heart racing at danger and desire braided together." }
    ],
    "beach": [
      { "key": "secluded_rocks_microbikini",   "stageMin": 3, "path": "any", "text": "We went on a secluded excursion, just the two of us. His eyes lingered on my body. What possessed me to wear this... I couldn't help but wonder what he was thinking as his eyes devoured my body." },
    ],
    "pregnancy": [
      { "key": "scare",      "stageMin": 3, "path": "any", "text": "I felt lightheaded today. Fear pricked at me… and a strange, secret joy." },
      { "key": "confirmed",  "stageMin": 4, "path": "any", "text": "It’s real. His life grows inside me. The future smells like smoke and roses." },
      { "key": "protective", "stageMin": 5, "path": "love", "text": "I rested my hand against a new heartbeat and prayed the world would be kind." },
       { "key": "Excitement",      "stageMin": 5, "path": "Corruption", "text": "I've been marked again by his seed. Another child of his grows inside me and I will welcome it." },
      { "key": "possessive", "stageMin": 5, "path": "corruption", "text": "When another girl touched his arm, I felt a growl rise; he is mine, and everyone should know." }
    ],
    "confession": [
      { "key": "why_stay",     "stageMin": 2, "path": "any", "text": "He asked why I stay. I told him the truth: I want him exactly as he is." },
      { "key": "own_words",    "stageMin": 4, "path": "hybrid", "text": "I said it out loud: I love the tenderness and the taboo. It’s ours." },
      { "key": "forever_hint", "stageMin": 5, "path": "any", "text": "I pictured a small home that smells like tea and rain—and a little smoke that never quite leaves." }
    ],
    "daily_moments": [
      { "key": "flower_water", "stageMin": 0, "path": "any", "text": "Watering flowers, I caught myself humming the tune he whistled yesterday." },
      { "key": "sleepless",    "stageMin": 1, "path": "any", "text": "I couldn’t sleep; the night felt too quiet without the rasp of his laugh in it." },
      { "key": "scarf_smell",  "stageMin": 2, "path": "any", "text": "My scarf picked up his scent. I should wash it. I didn’t." }
    ]
  },
  "entries": [],
  "meta": {
    "notes": "Desires (path lanes 0–5), Witnessed (per stage & path), Events (category/key) ready for triggers. Timeline entries append into `entries` at runtime.",
    "updated": "2025-08-30"
  }
}
