{
  "locations/cave": [
    { "key": "drip_echoes",       "stageMin": 0,  "path": "any",       "text": "Water dripped like a slow clock. I kept close for warmth, pretending I wasn't using him as an excuse." },
    { "key": "torch_light",       "stageMin": 1,  "path": "any",       "text": "Torchlight made his grime glow copper. I caught myself staring and looked away too slowly." },
    { "key": "hand_bridge",       "stageMin": 2,  "path": "any",       "text": "A narrow ledge, he offered his hand. Rough, unwashed, steady. I took it and didn't let go until long after." },
    { "key": "whisper_path",      "stageMin": 3,  "path": "any",       "text": "He guided me by the small of my back. I shivered and blamed the cold, not his touch." },
    { "key": "hide_from_bats",    "stageMin": 4,  "path": "any",       "text": "A flurry of bats flew towards us. He covered me with his body. His musky stench reeked, yet I didn't complain." },
    { "key": "kiss_in_dark",      "stageMin": 5,  "path": "love",      "text": "The torch died, and he stole a kiss. His kiss tasted like ash and I wanted more." },
    { "key": "wall_press",        "stageMin": 5,  "path": "hybrid",    "text": "I leaned against the wall and he pressed himself against my ass, gripping his palm around my waist. I said 'careful' but pushed back into him anyway." },
    { "key": "echo_laughter",     "stageMin": 6,  "path": "any",       "text": "Our laughter echoed too loud. I covered his mouth with my fingers; he kissed my knuckles, filthy and sweet." },
    { "key": "lap_warmth",        "stageMin": 7,  "path": "love",      "text": "We sat to rest; he tugged me onto his lap. I stayed, pretending it was just to keep warm." },
    { "key": "rough_graze",       "stageMin": 7,  "path": "corruption","text": "His unwashed tongue scraped my neck and I arched to meet it. I didn't ask him to stop." },
    { "key": "hidden_pool",       "stageMin": 8,  "path": "hybrid",    "text": "We found a subterranean pool. He waded in boots and all; I followed, dress clinging, heart racing." },
    { "key": "wet_mark",          "stageMin": 9,  "path": "corruption","text": "Water beaded on my skin; he smeared it away with his hands, leaving dirt in its place. I shivered and let it stay." },
    { "key": "echoed_plea",       "stageMin": 9,  "path": "love",      "text": "He asked if I was sure. I said yes, and the cave repeated it back to us—yes, yes, yes." },
    { "key": "altar_of_stone",    "stageMin": 10, "path": "hybrid",    "text": "On a flat slab of rock, we made our own ritual, a ritual intent on breeding." },
    { "key": "claim_in_the_dark", "stageMin": 10, "path": "corruption","text": "He marked me where no light reached. I wore the cave's silence like a veil and gave myself to it." }
  ]
}
