{
  "tifa": [
    { "stageMin": 0, "path": "any", "text": "I saw him lean too close to Tifa. It shouldn't sting… but my chest ached like it mattered." },
    { "stageMin": 2, "path": "any", "text": "Her laugh at his crude jokes cut sharper than it should. Why does it bother me so much?" },
    { "stageMin": 3, "path": "love", "text": "She blushed when his hand brushed hers. I told myself it's nothing. But I couldn't stop watching." },
    { "stageMin": 4, "path": "corruption", "text": "I caught his hand on her waist. Heat flared in me—anger… and something wetter I can't admit." },
    { "stageMin": 5, "path": "hybrid", "text": "Their lips met in shadow. My thighs clenched as jealousy tangled with an ache that made me furious at myself." },
    { "stageMin": 6, "path": "love", "text": "I cried into my pillow. I want him, but he looks at her the way I dream he'd look at me." },
    { "stageMin": 7, "path": "corruption", "text": "They fucked in the next room. Her moans stabbed me until I realized my own fingers were between my legs." },
    { "stageMin": 8, "path": "hybrid", "text": "I pressed my ear to the wall, burning with shame as I rubbed myself raw to the sound of them. I hate her. I want her. I want him. Gods forgive me." },
    { "stageMin": 9, "path": "corruption", "text": "I watched them, hidden, as he pumped into her. My pussy drooled down my thigh. I whispered, 'take me next…'" },
    { "stageMin": 10, "path": "corruption", "text": "Her cries filled the tent as his cock split her apart. I crawled closer, shameless, begging to taste him off her lips when he finished." }
  ],
  "renna": [
  { "stageMin": 0, "path": "any", "text": "She giggled when he teased her. She doesn't see how filthy he is. I should have warned her… why didn't I?" },
  { "stageMin": 2, "path": "any", "text": "Renna's eyes sparkle when he mocks her. It looks childish, innocent. I tell myself that's all it is… but my stomach knots." },
  { "stageMin": 3, "path": "love", "text": "He touched her hair, and she blushed. My throat went dry—why did I feel like I'd just lost something precious?" },
  { "stageMin": 4, "path": "corruption", "text": "I caught him pressing too close, his hand sliding down her back. She didn't even resist. My thighs clenched with anger—yet a wet heat betrayed me." },
  { "stageMin": 5, "path": "hybrid", "text": "She leaned into him willingly. I hated her for it, envied her… and in the shadows, I squeezed my legs together, dripping with need." },
  { "stageMin": 6, "path": "love", "text": "She giggled at something he whispered in her ear. I turned away, pretending not to care—but my chest burned like fire." },
  { "stageMin": 7, "path": "corruption", "text": "Her little gasps carried through the walls. My fingers were already working between my thighs before I realized what I was doing." },
  { "stageMin": 8, "path": "hybrid", "text": "She rode him shamelessly, squealing like a girl. I hated myself for it, but I touched myself watching them—wondering what it would feel like to share." },
  { "stageMin": 9, "path": "corruption", "text": "I saw his cock disappear into her, her body trembling. My pussy ached, juices soaking my legs as I whispered, 'please, me too…' " },
  { "stageMin": 10, "path": "corruption", "text": "She squirted all over his cock, crying his name. I crawled closer, shameless, begging him to fuck me next, to let me taste his filth straight from her lips." }
  ],
  "yuffie": [
  { "stageMin": 0, "path": "any", "text": "Yuffie laughed and pointed, teasing me—'Aerith, you're blushing so hard!' I wanted to disappear." },
  { "stageMin": 2, "path": "any", "text": "She caught me staring at them too long. Her smirk said she knew, and my cheeks burned hotter." },
  { "stageMin": 4, "path": "love", "text": "She barged in just as his lips left mine. Yuffie gasped, then giggled—'Didn't think you had it in you, Aerith!' My heart nearly burst." },
  { "stageMin": 5, "path": "corruption", "text": "I froze as she watched his hand slide under my skirt. Yuffie's eyes widened—then narrowed, as if daring me to stop. I didn't." },
  { "stageMin": 6, "path": "hybrid", "text": "She lingered in the doorway, biting her lip as his tongue claimed mine. My shame deepened knowing she stayed to watch." },
  { "stageMin": 7, "path": "love", "text": "Yuffie covered her mouth, eyes huge, when I moaned his name. I felt ruined… yet I didn't push him away." },
  { "stageMin": 8, "path": "corruption", "text": "She taunted me—'You like it, don't you?' as his thrusts shook my body. I couldn't deny it, not even to her." },
  { "stageMin": 9, "path": "hybrid", "text": "Her giggles echoed as she watched me ride him shamelessly, my juices dripping onto the floor. 'Aerith, you're dirtier than me,' she whispered." },
  { "stageMin": 10, "path": "corruption", "text": "She leaned close, breath hot against my ear as she watched his cock stretch me wide. 'You're gone, Aerith. Totally his.' And I knew she was right." }
  ]
    }
