{
  "vagrant": {
    "love": [
      "I shouldn't look twice at a man like him… yet something gentle flickers beneath the grime, and I want to see it again.",
      "When he lets the mask slip, I feel warmth. If I stay patient, maybe he'll trust me with more of himself.",
      "His rough edges don't scare me anymore. I find myself wishing he'd stay a little longer each time.",
      "When he's near, my chest settles. I want to be the place he can rest without pretending.",
      "I don't mind the dirt if the smile is real. I want to be the reason it is.",
      "I want quiet mornings and honest evenings—no bravado, just us breathing the same air.",
      "I want to stand beside him in the open, unashamed, and call what we have by its name.",
      "I choose him, not a cleaned-up fantasy—him, as he is, and I'll meet the world's doubts with my certainty.",
      "I want a life woven with his: shared work, shared laughter, shared burdens, and a key that fits both our doors.",
      "Let them whisper. I know what I feel. My heart doesn't want a savior or a project—it wants him.",
      "This love is a vow I make daily: to see him clearly, to be seen in return, and to keep choosing us."
    ],
    "corruption": [
      "Something about him feels like a dare I shouldn't take—and I keep stepping closer anyway.",
      "His grin makes rules feel flimsy. Part of me wonders how far I'd go just to keep it aimed at me.",
      "I'm learning how temptation sounds when it uses my name. It's reckless… and thrilling.",
      "He tilts the world off its axis and I don't rush to set it straight. I like the tilt.",
      "If I cross one more line, will I still recognize myself? The thought doesn't scare me as much as it should.",
      "I catch my reflection and see someone braver—or is it hungrier? Either way, I don't look away.",
      "The shame fades faster now, replaced by heat that lingers. I invite it to stay.",
      "I crave the power of surrender, the rush of being chosen and claimed—no excuses, no masks.",
      "It's not that I've lost myself; it's that I've discovered a self that reaches back when darkness reaches for me.",
      "I don't ask permission from the world anymore. Desire writes its own rules, and I sign my name.",
      "Whatever we are, it's undeniable—and I accept the mark it leaves on me."
    ],
    "hybrid": [
      "He's everything I should avoid and everything I can't ignore—dangerous and oddly tender.",
      "I'm split between scolding him and staying close. The truth: I like being near the storm.",
      "If he is the shadow and I'm the light, then maybe we're meant to blur at the edges.",
      "I want the forbidden and the sincere at once—hands that take and then hold.",
      "It's a secret I carry gladly: I love him when he's rough and when he's real.",
      "I don't need to choose between pure and profane if what we have is honest.",
      "Let sweetness follow the burn; I want both and I won't apologize.",
      "We can be soft after we're bold; we can be bold because we're soft. That paradox feels like us.",
      "I'm done pretending the thrill isn't part of the love. It is—and it makes the love brighter.",
      "Our story is messy and true. I'll write it with ink that doesn't wash off.",
      "If love is a sanctuary and desire a wildfire, then our home is a hearth built from both."
    ]
    }
}
